{
  "id": "employee_58",
  "name": "Jon Milner",
  "title": "Front End Developer & Interactive Designer",
  "mugshot_uid": "2014/07/24/10/43/46/658/file",
  "about": "<p>I am a web designer and front-end developer with a passion for making things better on the web. Having grown up during the dot-com bubble, I can remember visiting poorly designed websites and wanting to improve them. Though the web has improved dramatically since then, there's still plenty we can do to push the limits of what's possible.</p><p>It's really exciting to be in an industry where there's an opportunity to learn something new every single day. I love being challenged with innovative mockups and coding them into websites or web apps using the latest frameworks, libraries and tools to make them as lean and modular as possible. I take pride in focusing on user experience, site performance, and code maintainability.</p><p>I spend way too much free time watching Netflix (but that's okay because Breaking Bad and House of Cards are incredible). I also enjoy playing basketball, watching good movies (e.g. Tarantino, Scorsese), playing video games, and drawing. I listen to a wide and random variety of music from classic rock to 90's hip-hop, but while I'm working, I'm either listening to instrumental electronic or video game music.</p>",
  "image_uid": "2014/07/15/17/45/55/991/file",
  "slug": "jon-milner",
  "email": "jon@smashingboxes.com",
  "encrypted_password": "$2a$10$6IV0EisW8xmGWk.6Zmvt0O2ur5UXAUOUecd7pD8jE5VnDg8VRGURm",
  "reset_password_token": "KFUVLK93aP3SDNLk3jsQ",
  "reset_password_sent_at": null,
  "remember_created_at": null,
  "sign_in_count": 1,
  "current_sign_in_at": "2014-08-04T14:22:20+00:00",
  "last_sign_in_at": "2014-08-04T14:22:20+00:00",
  "current_sign_in_ip": "50.55.55.10",
  "last_sign_in_ip": "50.55.55.10",
  "failed_attempts": 0,
  "unlock_token": null,
  "locked_at": null,
  "created_at": "2014-06-10T18:09:31+00:00",
  "updated_at": "2015-02-17T16:56:32+00:00",
  "seniority": -8388542,
  "published": true,
  "imageAltText": "",
  "mugshotAltText": "",
  "database_id": 58,
  "roles": [
    {
      "type": "role",
      "id": "role_1"
    },
    {
      "type": "role",
      "id": "role_1"
    }
  ]
}