{
  "id": "job_9",
  "title": "Senior User Experience Designer",
  "description": "<p>You are the advocate for the user. Best practices and convention have their place, but your varied life experiences, empathy, and love of the human spirit are what set you apart and allow you to transform business goals into enjoyable and memorable experiences. You work primarily in the digital space but view it through a lens of holistic service, understanding that an application or website is only one of myriad touch points in a user’s journey.</p><p>As a Senior UX Designer at Smashing Boxes, you will play an integral role in defining the future of our User Experience, both within our walls and outside of them. In this role, you will be the right hand (wo)man to our Director of UX, helping to create and facilitate a departmental roadmap, while providing mentorship and direction to other designers.</p>",
  "responsibilities": "<ul><li>Work closely with the Director of User Experience to create and facilitate a departmental roadmap, while providing mentorship and direction to designers.</li><li>Work with Product Directors to determine client goals and project requirements.</li><li>Document requirements using text, flowcharts, wireframes, functional prototypes, etc., as the situation requires.</li><li>Work with UI Designers to design an interface and service experience that meets goals and requirements.</li><li>Conduct and/or utilize the results of user research, competitive analysis, and user testing</li><li>Work with UI Designers and Front-End and Mobile Developers to create interactions and animations that add interest and sophistication to an experience.</li><li>Create prototypes for specific flows and interactions, as required.</li><li>Direct and mentor junior designers in the above endeavors.</li></ul>",
  "lookingFor": "<ul><li>An exceptional portfolio showcasing the evolution of user-centered projects from concept to completion.</li><li>Experience directing and mentoring other designers.</li><li>Strong communication skills and the ability to bring an energy to your work that inspires and motivates both the team and clients alike.</li><li>Great listening skills; and compassion for client’s problems that rivals your desire to solve them.</li><li>Enthusiasm for user research/testing; and enough experience to lead a team in both testing methodologies and practical application.</li><li>Proficiency in sketching and wireframe/design software.</li><li>A willingness to take risks and challenge the status quo.</li><li>Agency experience a major plus. </li></ul>",
  "active": false,
  "created_at": "2014-07-28T19:51:42+00:00",
  "updated_at": "2015-07-26T19:46:32+00:00",
  "submitClass": "ux-designer",
  "importance": -5734580,
  "database_id": 9
}