{
  "id": "job_31",
  "title": "QA Specialist",
  "description": "<p>Are you someone who loves to make computers do your work for you? Do you enjoy working on a diverse set of projects with a diverse group of people? Do you value professional growth and continuous self improvement? If so, Smashing Boxes is looking for an experienced QA Specialist who has a knack for problem solving, a love for bleeding-edge technology, and a strong desire to work smarter not harder. If you live to solve the mysteries of the world, while researching ways to make your job easier, we have a place for you!<br></p>",
  "responsibilities": "<ul><li>Author and execute test plans with a mindset of automate first, manual test last</li><li>Work with backend developers to expand their automated test suites</li><li>Adhere to core testing principles set by team and group leadership</li><li>Record and document results and compare to expected results</li><li>Develop and document application test plans based on software requirements and technical specifications</li><li>Document anomalies and issues in solid bug reports</li><li>Participate in application planning meetings</li><li>Ensure data integrity standards</li></ul>",
  "lookingFor": "<p>We have a few core requirements, they are:\r\n</p><ul>\r\n\t<li>A strong understanding of software testing methodologies</li>\r\n\t<li>Firm grasp of the software development life cycle, technical requirements, and project management</li>\r\n\t<li>Prior automation, software testing, or programming experience</li>\r\n\t<li>Experience working in an Agile environment</li>\r\n\t<li>Strong eye for detail and ability to quickly define defects</li>\r\n\t<li>Must also have the ability to work collaboratively with others as part of a team</li>\r\n\t<li>Exceptional communication and organizational abilities </li>\r\n</ul><p>And if you can check these boxes as well, we'll order you a whole pizza on your first day. Yep, just for you:\r\n</p><ul>\r\n\t<li>Mobile development automation experience is awesome!</li>\r\n\t<li>Previous agency experience is awesome!</li>\r\n\t<li>Appium knowledge is super awesome!</li>\r\n</ul>",
  "active": false,
  "created_at": "2014-10-10T16:53:32+00:00",
  "updated_at": "2015-09-11T18:47:07+00:00",
  "submitClass": "qa-specialist",
  "importance": -6736799,
  "database_id": 31
}