{
  "id": "job_25",
  "title": "Agile Project Manager",
  "description": "<p>Smashing Boxes project managers aren’t merely taskers or go-betweens. They’re the leaders of our projects from inception to completion. They scope and plan projects, lead teams and clients through our process and workflow, and ensure that work is delivered on time, on budget and is of the highest quality. As the day-to-day point of contact for our clients, they deliver a key component of our client experience. They are likable and understanding people with uncanny problem solving abilities. They keep clients focused on progress and confident in our abilities. As leaders of our internal process and the central point of contact for team members, their attitude and actions set the example for others to follow. In their day-to-day and in high-pressure situations, they are calm, collected, reliable, and optimistic and consistently maintain a positive presence with the team.</p>",
  "responsibilities": "<ul>\r\n<li>Working with sales and other team members to define requirements and plan, scope and estimate projects.</li><li>Owning team and client kick-off meetings to set expectations and the pace for the project.</li><li>Managing all project details and assigning and prioritizing tasks to the appropriate team members.</li><li>Ensuring projects are always moving forward and everyone is clear on next steps and the greater vision.</li><li>Alerting the appropriate SB staff at the first sign of any potential risk or barrier that may prevent work from being completed.</li><li>Meeting with clients on a weekly basis.</li><li>Providing detailed weekly project status updates to the appropriate management team members.</li><li>Creating project documentation as needed and/or ensuring all documentation is saved on our central server.</li><li>Providing quality control before sending any work to the client.</li><li>Participating or leading standups, sprint and release planning with teams.</li><li>Tracking project budgets and issuing new SOWs as needed.</li><li>Coordinating any internal and client meetings as needed.</li><li>Working with operations to properly resource projects to meet timeline goals.</li><li>Contributing to company processes and proactively identifying areas for improvement.</li></ul>",
  "lookingFor": "<ul><li>At least 3 years prior agency, interactive / digital production or marketing, account or project management experience</li><li>Leadership with integrity and direct attitude. </li><li>Exceptional written and verbal communication skills.</li><li>Extreme attention to detail.</li><li>Outstanding judgment, especially in high-pressure situations.</li><li>Comfort in a fast-paced environment.</li><li>Ability to anticipate problems and risks in advance, and change plans accordingly.</li><li>Ability to multi-task – you’d actually prefer to be involved in multiple projects at once.</li><li>Entrepreneurial spirit, salesmanship skills and presentation chops.</li><li>Basic HTML/CSS knowledge. You can talk the talk even if you can’t code.</li><li>Passion for new technologies. </li><li>Experience with Google Apps (Basecamp and Harvest are additional bonuses).</li></ul>",
  "active": false,
  "created_at": "2014-08-11T19:52:26+00:00",
  "updated_at": "2015-09-15T19:04:40+00:00",
  "submitClass": "digital-project-manager",
  "importance": -8097483,
  "database_id": 25
}