{
  "id": "employee_42",
  "name": "Colton Jenkins",
  "title": "Back End Developer",
  "mugshot_uid": "2014/07/24/10/34/38/675/file",
  "about": "<p>I am a software enthusiast and an adrenaline junkie. I enjoy anything that relates to computer science or involves something dangerous. I'm always up to try something new given life is nothing more than a collection of experiences, both good and bad. When I'm not out thrill seeking I'm typically working on a software project or hanging out with my family watching House or Hannibal. I tend to be a perfectionist when time allows as I see my work as a form of art. I am lucky to be one of the individuals to discover their passion and I continue to love every&nbsp;day I'm doing it!</p><p>At a previous employer I was tasked to bring an unstructured tech company to something more functional. With little to no knowledge on how, I was able to discover the existing issues and either fix them or bring them up for further analysis. At the end of my stay there was a development process, new tools making everyday life easier for everyone, and better internal communication throughout leading them to success.</p><p>A few personal interests of mine are the following; snowboarding, gaming, cars, drifting, skydiving, paintball, computational genomics, data mining, teaching, automating, and pretty much anything related to computer science or an activity that increases my pulse over 120 BPM. </p>",
  "image_uid": "2014/07/15/17/03/26/687/file",
  "slug": "colton-jenkins",
  "email": "colton@smashingboxes.com",
  "encrypted_password": "$2a$10$NnAhYzs/w22cJ8bi5LplwOvcAluzWRO8H63db4GThDlySi3NBCLeO",
  "reset_password_token": "c7ZyezUouGYohg_fiJxB",
  "reset_password_sent_at": null,
  "remember_created_at": null,
  "sign_in_count": 1,
  "current_sign_in_at": "2014-11-13T16:48:08+00:00",
  "last_sign_in_at": "2014-11-13T16:48:08+00:00",
  "current_sign_in_ip": "184.4.25.199",
  "last_sign_in_ip": "184.4.25.199",
  "failed_attempts": 0,
  "unlock_token": null,
  "locked_at": null,
  "created_at": "2014-06-10T17:50:57+00:00",
  "updated_at": "2015-02-17T17:13:41+00:00",
  "seniority": -8388560,
  "published": true,
  "imageAltText": "",
  "mugshotAltText": "",
  "database_id": 42,
  "roles": [
    {
      "type": "role",
      "id": "role_2"
    },
    {
      "type": "role",
      "id": "role_2"
    }
  ]
}