{
  "id": "employee_88",
  "name": "Derek Kniffin",
  "title": "Back End Apprentice",
  "mugshot_uid": "2015/08/14/16/00/13/636/file",
  "about": "<p>I'm a design-focused software developer. I am well-versed in many parts of the web stack, including UI, Javascript, APIs, back-end applications, databases, and Linux. I love learning the ins and outs of technology, and how all the various pieces fit together. However, what interests me more is using technology to improve people's lives in small, but significant ways.<br> <br> After spending my early life in the northeast, and high school in Clayton, North Carolina, I moved out west, and attended the University of Colorado, Boulder. I started out pursuing a degree in architecture and design, but came to realize my true passion was in computing. In the end, I left CU with a degree in Comp Sci, and five years of experience in System and Database Administration.<br> <br> Outside of work, my life is centered around my best friend and wife, Tammy. Having lived in Colorado, we love the outdoors. If the weather is nice, we're probably out hiking and geocaching with our energetic pup, Maggie. We're also both gamers, and enjoy everything from solving puzzles in Portal, to building a great deck in Dominion.<span></span></p>",
  "image_uid": "2015/08/14/16/04/12/930/file",
  "slug": "derek-kniffin",
  "email": "derek.kniffin@smashingboxes.com",
  "encrypted_password": "$2a$10$wdmJc16hPa4oyOBmea22se33S2uiizzJqYaahtobhx1u2STZ1ZGVK",
  "reset_password_token": null,
  "reset_password_sent_at": null,
  "remember_created_at": null,
  "sign_in_count": 0,
  "current_sign_in_at": null,
  "last_sign_in_at": null,
  "current_sign_in_ip": null,
  "last_sign_in_ip": null,
  "failed_attempts": 0,
  "unlock_token": null,
  "locked_at": null,
  "created_at": "2015-08-14T20:04:18+00:00",
  "updated_at": "2015-08-14T20:04:18+00:00",
  "seniority": -8388562,
  "published": true,
  "imageAltText": "Derek Kniffin | Smashing Boxes | Web Developer",
  "mugshotAltText": "Derek Kniffin | Smashing Boxes | Web Developer",
  "database_id": 88,
  "roles": [
    {
      "type": "role",
      "id": "role_2"
    },
    {
      "type": "role",
      "id": "role_2"
    }
  ]
}