{
  "id": "employee_81",
  "name": "David Melgar",
  "title": "iOS Developer",
  "mugshot_uid": "2015/08/05/12/50/23/161/file",
  "about": "<p>I grew up in warm South Florida, in a household filled with my father’s half implemented electronics projects. I caught the bug at an early age and started building… stuff. Software is awesome modeling clay. Very malleable and incredibly powerful especially when carried around in personal mobile devices. Entrepreneurship is another outlet for creativity that I love having started my own software business. Combining technology and entrepreneurship is the ultimate mashup. </p><p>I’ve been developing iOS and Mac apps since 2007 for my own business and clients and have worked in the industry on a wide variety of languages, platforms, devices and protocols. I’ve taken on various roles including software development, contributing to SOAP standards, and technical marketing with clients such as VW, Harris Teeter and others in the retail and other verticals. I’m an evangelist for the Lean Startup method and love new technology including electric vehicles.<br><br></p><p>Smashing Boxes is a great way to indulge my interests. When I’m not glued to technology you may find me dreaming of sailing or spending time with my two energetic growing boys and lovely soul mate (aka wife).</p>",
  "image_uid": "2015/08/05/13/06/02/689/file",
  "slug": "david-melgar",
  "email": "david.melgar@smashingboxes.com",
  "encrypted_password": "$2a$10$Z8QE7pTTbbl.UqBpnuCPWuXhkQKyLy.REfJqp5tz1lEos0NquFA8q",
  "reset_password_token": null,
  "reset_password_sent_at": null,
  "remember_created_at": null,
  "sign_in_count": 0,
  "current_sign_in_at": null,
  "last_sign_in_at": null,
  "current_sign_in_ip": null,
  "last_sign_in_ip": null,
  "failed_attempts": 0,
  "unlock_token": null,
  "locked_at": null,
  "created_at": "2015-08-05T17:06:08+00:00",
  "updated_at": "2015-08-05T17:08:08+00:00",
  "seniority": -8388559,
  "published": true,
  "imageAltText": "David Melgar Smashing Boxes",
  "mugshotAltText": "",
  "database_id": 81,
  "roles": [
    {
      "type": "role",
      "id": "role_2"
    },
    {
      "type": "role",
      "id": "role_2"
    }
  ]
}