{
  "id": "post_379",
  "title": "Five Predictions For The Future of Wearables",
  "summary": "While wearable technology is still in its infancy, the growth and excitement around them will ensure the technology matures rapidly over the next few years. ",
  "body": "<p>\r\n\tPeople have long been fascinated with a future where humans and machines become one. Science fiction author Philip K. Dick (adapted films include Blade Runner and Minority Report to name a few) describes a world where high-tech enhancements increase our ability to process information. This allows us to become superhuman. This co-evolution of technology and physiology is no longer the stuff of science fiction. It will shape the story of the 21st Century.</p><p>\r\n\tWith that said, we are still in the toddler phase of the “wearable” generation. Much of what we “touch” currently is just noise in the form of data. There are hundreds of devices that monitor everything from sleep to blood glucose. To make this data relevant, these devices must communicate with each other and provide a smarter interpretation of the data. And there is still much to be desired where battery life and wearable interfaces are concerned. We can dig into what’s being done to break down these barriers in a bit, but first we should probably answer the big question: Why does this matter?</p><p>\r\n\tLet’s begin with some predictions. </p><h3>Where I think wearables will make the most impact in the next five years:</h3><p>\r\n\t<strong><em>Data Facilitated Care</em></strong></p><p>\r\n\tWhat is it: Embedded biometric sensors and software that provide continuous capture, delivery and interpretation of health and performance. This allows physicians, care teams and coaches to make prescriptive decisions quickly and from anywhere.</p><p><img src=\"/media/W1siZiIsIjIwMTUvMDMvMzAvMjEvMTYvMjQvMTM0LzcwNjk1Nzg5NTNfNDE0MzVlMzhiMV96LmpwZyJdXQ/7069578953_41435e38b1_z.jpg?sha=86ef8702\" alt=\"\" style=\"display: block; margin: auto;\"></p><p style=\"text-align: center;\"><em>Biometric sensors embedded in clothing. Photo Credit: Keoni Cabral</em></p><p style=\"text-align: center;\"><em><br></em></p><p>\r\n\tDr. David Berkoff, Sports Medicine Physician at UNC Department of Orthopaedics explains. “One of the main objectives right now is to improve continuity of care,” he said. “Currently we get a very inconsistent snapshot of a patients health. They come in for a visit, we review the data presented that day and make decisions.” According to Dr. Berkoff, “with ‘wearables’ we are close to having continuous, accurate data about an individual's physiology and daily behaviors. This is key to empowering healthcare professionals to make better decisions and help drive behavior change and outcomes.”</p><p>\r\n\t<strong><em>Personalized Wearables</em></strong></p><p>\r\n\tWhat is it: ‘Made to fit’ sensor-enabled apparel and medical devices that use advances in 3D printing technology to personalize the experience for an individual.</p><p>\r\n\tAccording to a <a href=\"http://qz.com/315924/the-patented-nike-shirt-that-could-track-your-heart-rate-and-blood-pressure-while-you-exercise\">recent article in Quartz</a>, Nike is using advances in nano-technology to embed sensors in their apparel. This combined with the ability to print an individual t-shirt with a 3D enabled printer will allow people to customize their apparel. Athletes and coaches will better understand when they are overtraining or under-training, and when they are under hydrated and overstressed. It will also reduce the cost of production and management of the supply chain for companies like Nike.</p><p><img src=\"/media/W1siZiIsIjIwMTUvMDMvMzAvMjEvNDIvMTUvMzM1Lzc2NTAzNjI1NTZfM2YxZmZhMDZkZV96LmpwZyJdXQ/7650362556_3f1ffa06de_z.jpg?sha=383fed75\"></p><p style=\"text-align: center;\"><em>Photo Credit: Atos</em></p><p>\r\n\tSensor-embedded 3D printing will also impact the medical device industry. Mayo Clinic has already produced its <a href=\"http://hitconsultant.net/2014/04/01/the-future-of-3d-printing-in-healthcare/\">first custom hip</a>. They are looking for ways to embed sensors in the devices to improve monitoring of a patient's function and wear and tear on the joint.</p><p>\r\n\t<strong><em>Active Coaching</em></strong></p><p>\r\n\tWhat is it: Sensor-embedded hardware and apparel that monitor performance, provide interpretation and make suggestions on how to progress. This next step in wearable technology will help individuals improve everything from their fitness to their biomechanics (posture and gait for example).</p><p>\r\n\tOne of the keys for active coaching to be successful is to improve the validity of the data and interpretation. Dr. Steven LeBoeuf, Founder and President of Valencell says, “one reason we started with optical signal sensor based technology in the ear was the validity of the data.”</p><p>\r\n\tThe next step, according to LeBoeuf is to make the data relevant to improve engagement. “We need good data and then software that accurately interprets the data and provides useful advice on how to progress to make a dent in improving health and fitness outcomes.”</p><p>\r\n\t<strong><em>Gesture Based Interfacing</em></strong></p><p>\r\n\tWhat is it: Empowers individuals to use gestures and other natural movements to interplay with devices. By adopting everyday movements and gestures in lieu of complex machine based tasks, we can improve the user experience and make it easier for people to onboard to new devices and software.</p><p><img src=\"/media/W1siZiIsIjIwMTUvMDMvMzAvMjEvMzQvNDcvODU1Lzg3NDczNzYzNzBfY2VlNTFmMWM4YV96LmpwZyJdXQ/8747376370_cee51f1c8a_z.jpg?sha=6583961a\"></p><p style=\"text-align: center;\"><em>\r\n\tWe’ve already seen the beginning of gesture-based interfacing with Google Glass which lets users take a picture by blinking. Photo Credit: CyberHades</em></p><p><em><br></em></p><p>According to \r\n\t<a href=\"http://wallstcheatsheet.com/technology/apple/apple-patent-outlines-intelligent-gesture-based-user-interface.html/?a=viewall\">recent patents from Apple</a>, their new Watch may allow for gesture-based adaptive learning. This may communicate actions like navigating through Apple TV, flipping pages on your iPad while running on a treadmill, shutting off the lights, and more.</p><p>\r\n\t<strong><em>Authenticated You</em></strong></p><p>\r\n\tWhat is it: Wearables have the ability to provide a unique signature to the individual. Using unique characteristics such as heart rhythm could take the place of outdated credentialing methods like a written password.</p><p>\r\n\tHow many times have you forgotten your password or had your email hacked? This could soon be a problem of the past. New technologies like watch-enabled heart rate monitors can measure one’s unique rhythm and convert it to a password. Other companies are creating ingestibile technology that allows external devices to log in when the individual is near. Acid in the stomach powers the battery.</p><h3>Barriers To Success</h3><p>\r\n\tAccording to <a href=\"http://www.juniperresearch.com/viewpressrelease.php?pr=476\" style=\"background-color: initial;\">a report from Juniper Research</a>, the wearable tech market is expected to expand rapidly within the next few years. The firm projects that the wearable tech market will hit $4.5 billion by the end of 2014, and reach $53.2 billion by 2019. This is great news for OEMs who are investing heavily in wearable tech initiatives. However, several things need to fall into place in order for this market opportunity to achieve its full potential.</p><ul>\r\n\t<li>Increased Battery Life</li>\t<li>Improved User Experience</li>\t<li>Making Data Useful</li></ul><h3>Death By Discharge</h3><p>\r\n\tOne of the key issues challenging wearable device engagement at the six month mark is the inconvenience of having to charge it. According to LeBoeuf, industry statistics show that as soon as someone takes off the device there is a more than one third chance they won’t put it back on.</p><p>\r\n\t“When you have to take your device off to charge it, you immediately disengage the user and they begin to wonder how much value they are getting by counting steps.” This is what LeBoeuf calls “death by discharge.” “If their experience with the device is a good one, then they will likely put it back on but if not it may become best friends with the underwear drawer,” he said.</p><p>\r\n\tDr. Berkoff agrees. “As an athlete, it’s one of my biggest frustrations...I’m ready to go on a long ride and I forgot to charge my device,” he said. He also sees battery life as a big barrier to getting regular joes to purchase the devices, “If it’s a problem for early adopters, then you know it’s going to be an issue for everyone else.”</p><p>\r\n\tOrganizations like <a href=\"http://assist.ncsu.edu/\">Advanced Self-Powered Systems of Integrated Sensors and Technologies(ASSIST)</a> at North Carolina State University are working on solving the battery life issue. They are developing technologies to enable battery free and body powered devices. Tom Snyder, Industry Liaison for ASSIST explains, “we are utilizing nanotechnology to bring the energy requirement for sensors and wireless data transmission down to a level that your body can be utilized as a power supply.” As an example, ASSIST materials, embedded in a textile can harvest energy from the temperature difference between the skin and air, and use this to power the sensors. This not only has an impact on clothing but also on medical devices. They’re currently working on a battery free pacemaker.</p><h3>Human-Centered Design Will Be Key</h3><p>\r\n\tMarrying a relevant user experience with the appropriate interface will be key. Sensors embedded in a shirt to free up space coupled with a watch interface that delivers the information from clothing is one example. Another example of providing a good user experience is embedding technology in devices that are familiar, like headphones.</p><p>\r\n\t“We started with headphones because our audience were athletes and weekend warriors,” said LeBoeuf. “They already wore headphones when they worked out so it made sense. Why make them work harder and purchase another device?”</p><p>\r\n\tAccording to an industry report by <a href=\"http://www.slideshare.net/RockHealth/the-future-of-biosensing-wearables-by-rockhealth)\">Rock Health</a>, a health incubator and fund based in San Francisco, California, one of the biggest barriers to engagement is at the onset of using the device. Meaning, quite literally, the pain of getting it out of the box and setting it up. Reports indicate that close to 10 percent of technology products are returned before they are even used.</p><p>\r\n\tFashion is also an important element in adoption; it’s about both form and function. Technology software and hardware designers are not accustomed to the nuances of fashion design. Consider the success of the smartphone, given it is typically stuffed in our pockets. If wearables are to succeed, brands must immerse themselves in fashion trends and psychology to inspire design.</p><h3>Getting Personal</h3><p>\r\n\tIn 2013, over 70 million wearable devices were sold and <a href=\"http://www.gartner.com/newsroom/id/2913318\">by 2016 that number will reach over 90 million</a>. With that said, the adoption rate will slow or decline if these devices don’t provide more meaning and context about how to improve our health, fitness, and life based upon our goals and needs.</p><p>\r\n\tTo truly connect the data, simplifying the communication between devices through a universal API will become critically important. It will start when devices talk to each other. Thanks to your phone’s G.P.S., RFID, or Bluetooth, you’ll get a personalized workout plan the second you arrive at the gym and adjust the intensity based upon your previous workout, cortisol levels and hydration. The device will know that it took longer for you to fall into REM sleep because home sensors indicate that you kept the lights on.</p><p>\r\n\tA number of companies including Nike are already moving towards coach-enhanced apps that learn from your performance outputs and adjusts your next workout accordingly. Apple’s new health and fitness app will tell you when you need to stand or move more (two keys to cardiovascular health) based upon real time information from their Watch. In addition to Apple and Nike, a number of other companies are hiring teams of exercise physiologists, data scientists, and physicians to help move data from descriptive to prescriptive.</p><p>\r\n\tDr. Berkoff agrees that for devices to be adopted by the mainstream they have to provide more than just entertaining data to the user. “Physicians and their patients need to understand how they are progressing and if there is the need for an intervention,” he said. “Data is just data without proper interpretation and there may be times where the physicians don’t have time during a clinic visit to interpret the data. We just need to know when to connect with the patient.”</p><p>\r\n\tDr. Berkoff says that sports medicine physicians, physical therapists and other healthcare professionals can benefit from the continuous monitoring and interpretation of movement. “I can only get so much information in a 10-15 minute office visit,” he explained. “I may watch someone walk or run during that visit, but they may be on their best behavior giving me less than perfect data. To really understand how they move and to make the best prescription we would benefit from continuous monitoring and feedback which we could then use to provide the patient with a better plan on how to progress and improve.”</p><h3>The Future Is Already Here...Sort Of</h3><p>\r\n\tCompanies and startups are already creating new ways to measure health and performance and help people be more productive. Parents and their children are finding significant value in products like <a href=\"https://www.sqord.com/\">Sqord</a> - the first wearable for kids that helps curb childhood obesity and improve children’s health. It uses sensors to track activity and provides feedback and motivation to help kids move more.</p><p>\r\n\tCompanies like <a href=\"http://www.fitlinxx.net/\">Fitlinxx</a> are also changing the game with their new product, AmpStrip. The heart rate and activity tracking monitor is designed to stick to the wearer’s torso and be left for a week or more at a time. Once they’re done with it, they can remove it like a bandaid and recharge, add adhesive and put it back on.</p><p>\r\n\tWhile wearable technology is still in its infancy, the growth and excitement around them will ensure the technology matures rapidly over the next few years.  </p>",
  "slug": "five-predictions-for-the-future-of-wearables",
  "slug_history": "--- []\n",
  "visits": 941,
  "published": "2015-03-31T04:00:00+00:00",
  "authorName": "Andrew Hooge",
  "category_id": 2,
  "image_uid": "2015/03/30/12/53/56/319/file",
  "created_at": "2015-03-30T15:14:36+00:00",
  "updated_at": "2015-07-14T19:40:56+00:00",
  "markdown": "",
  "image_alt_text": "five predictions for the future of wearables",
  "featured": false,
  "database_id": 379,
  "category": {
    "type": "Entry",
    "id": "category_2"
  },
  "tags": [
    {
      "type": "tag",
      "id": "tag_31"
    },
    {
      "type": "tag",
      "id": "tag_31"
    }
  ],
  "authors": [
    {
      "type": "employee",
      "id": "employee_71"
    },
    {
      "type": "employee",
      "id": "employee_71"
    }
  ]
}