{
  "id": "post_346",
  "title": "Tips for Passing the 2014 Google Analytics Exam",
  "summary": "Last month, we introduced you to the practice and service that is Growth Engineering. What we didn’t tell you is that Google Analytics is a HUGE component of growth engineering. While you don’t have to be GA certified to be in this industry, it definitely helps. And to become certified, you have to take the Google Analytics Individual Qualification (GAIQ) Exam. So, this is where I come in.",
  "body": "<p>Last month, we introduced you to the practice and service that is <a href=\"http://smashingboxes.com/ideas/growth-engineering-growth-hacking-grown-up\" target=\"_blank\">Growth Engineering</a>. What we didn’t tell you is that Google Analytics is a HUGE component of growth engineering. While you don’t have to be GA certified to be in this industry, it definitely helps. And to become certified, you have to take the Google Analytics Individual Qualification (GAIQ) Exam. So, this is where I come in.</p><p>You may have heard the GAIQ Exam can be pretty difficult to pass. Well Google released an updated version of the test in <a href=\"http://www.pr2020.com/blog/passing-the-new-google-analytics-iq-exam-2014\" target=\"_blank\">January 2014</a> and along with it came a whole slew of new questions, new answers and more confusing verbiage. Awesome!</p><p>If you were anything like me when I was first preparing for it, you’re probably in the process of trying to find out as much information as possible about the test before taking the plunge. When I took the test, I was a little nervous about taking it because I am a terrible test taker. I read every article, blog post, and forum I could find that mentioned the test, and some were helpful and some not so much. But I passed on my first time taking it and now want to pass on my (study tips) onto you. In this post I will address the test format, study resources, and test tips. Hopefully this resource will save you some time and stress and point you in the right direction before you take it.</p><p><strong>Test Format</strong></p><p>Quick facts about the GAIQ:</p><ul> \r\n<li>Costs $50 to take</li><li>70 multiple-choice questions</li><li>90-minute time limit (you can pause the test as many times as you like, but the time expires five days after starting it)</li><li>It is an open book test (don’t be misled; this doesn’t make it much easier)</li><li>80% is the passing score (you can’t miss more than 14 questions)</li><li>You receive a certificate and your name appears in <a href=\"https://www.starttest.com/9.0.0.0/searchcert.aspx?cmd=start&amp;program=googleanalytics&amp;type=consumer&amp;target=center&amp;limit=search\" target=\"_blank\">Google’s database of Qualified Individuals</a> (you can look me up!)</li><li>Certification expires after 18 months (and then we get to start this whole process over, WOO!)</li></ul><p>You’ll pay and take the test in <a href=\"https://google.starttest.com/\" target=\"_blank\">Google’s Testing Center</a>. If you get below an 80% you will have to wait 15 days before you can try again. However, after the test (pass or fail) Google will provide you with areas you need to improve upon. </p><p><strong>Study Resources</strong></p><p>I want to offer you my three “must study” resources:</p><ol> \r\n<li><a href=\"https://analyticsacademy.withgoogle.com/explorer\" target=\"_blank\">Google’s Analytics Academy</a> is the first place you should start. I believe this was once called Conversion University (so if you see other blogs telling you to use CU just know they are the same thing). Google’s Analytics Advocate, <a href=\"http://cutroni.com/blog/about-2/\" target=\"_blank\">Justin Cutroni</a>, walks you through an overview of Google Analytics in the <a href=\"https://analyticsacademy.withgoogle.com/course01\" target=\"_blank\">Digital Analytics Fundamentals</a> course. Personally, I think this is the best resource because the videos are easy to understand and there are assessments after each lesson.</li></ol><p style=\"margin-left: 60px;\">Resource Tip: Each lesson has a text version. I downloaded those and made a PDF pseudo-textbook for the test. This will cut down on searching for the answer to a tricky question.</p><p style=\"margin-left: 60px;\">- They now have more lessons with assessments that focus more attention on subjects covered in the fundamentals course, e.g. Ecommerce</p><p>2.     Once you complete the free course and the final assessment, you should check out this <a href=\"http://www.googleanalyticstest.com/\" target=\"_blank\" style=\"background-color: initial;\">Google Analytics Practice Test</a>. The practice test has more than 200 practice questions and you can pick what topics you want to study, e.g. Goals &amp; Funnels or Internal Site Search. It was developed by <a href=\"http://www.e-nor.com/google-analytics-training-course/instructor/\" target=\"_blank\" style=\"background-color: initial;\">Eric Fettman</a>; the man is a Google Analytics genius. Many say that the practice test is harder than the actual test and I would have to agree. It reinforces your knowledge and shows what you may need to study more before taking the real test. Definitely check it out.</p><p>3.     If you are not a fan of watching videos and would rather read to obtain this knowledge, you should check out <a href=\"http://www.jenssorensen.co.uk/2010/07/google-analytics-individual-qualification-exam-test-notes/\" target=\"_blank\" style=\"background-color: initial;\">Jens Sorensen</a>’s analytics blog post. But be prepared, it is packed full of information and is extremely lengthy for a blog post. Also fair warning, he wrote this post in 2010 and while still a very good resource, Google has removed some of the topics that you will see on the test (e.g. _utmv cookie).</p><p>I strongly urge you to check out/do these first before attempting to take the test. I found that cheat sheets were great for finding answers quickly and printed them out to have in front of me during the test:</p><ul> \r\n<li><a href=\"http://www.blastam.com/blog/index.php/2012/12/handy-google-analytics-reference-guide-80-tips/\" target=\"_blank\">Blast Handy Google Analytics Reference Guide</a></li><li><a href=\"http://files.dnr.state.mn.us/temp/intersec-handout.pdf\" target=\"_blank\">Portent Interactive Google Analytics Cheat Sheet 2</a></li></ul><p>If you’re brave you can try taking the test with just these. But I suggest that you study the first three resources. </p><p><strong>Test Tips:</strong></p><ol> \r\n<li>Practice \r\nIf you don’t have a Google Analytics account, you need to make one. This will allow you to play around with the interfaces and it will give you a better understanding of the lessons. It also is great to have open during the test as a reference.</li><li>Know the types of Questions\r\nWhat stressed me out most about the test was that I didn’t know what the format of the questions were going to be like. In all the resources I found, they mentioned that the questions are multiple choice but never gave more detail as to exactly what type of multiple choice questions they are (single answer? multiple answer? all of the above?, WHAT?!). In the course and practice test there were a lot of “Select all that apply” multiple choice questions. Well, I hate to say it, but they’re also on the real test. The test questions vary between true/false, single answer, and select all that apply. Additionally, there are either four or five answer choices for each question.</li><li>Pay attention to time\r\nYou have 90 minutes to complete the test, and the countdown clock in the top right corner of the test window doesn’t let you forget it. You have about a minute and thirty seconds for each question. No pressure, right? However, the pause button is the saving grace. If you get stumped you can pause the test, which will blur out the question and you scan through your resources to find the answer. If you rather not pause the test and continue trucking through you can mark questions you’re not sure of. There is a scrolling list of questions on the right side of the window and you can easily navigate back to the marked ones.</li><li>Open Resources\r\nSince the test is open book, you can have all your handy resources open in other windows/tabs. I had these three open while taking the test: <a href=\"http://gaconfig.com/google-analytics-event-tracking/\" target=\"_blank\">Google Analytics Configuration Tool</a>, <a href=\"https://support.google.com/analytics/answer/1033867?hl=en\" target=\"_blank\">URL Builder</a>, and <a href=\"https://support.google.com/analytics/?hl=en#topic=3544906\" target=\"_blank\">Google’s Analytics Help Center</a>. Some other blogs say to have an easy RegEx (Regular Expression) <a href=\"http://scriptular.com/\" target=\"_blank\">generator</a> open. I didn’t have any RegEx questions, but better safe than sorry. </li></ol><p>If I missed something that you were looking for you may want to check out these other resources about the test:</p><p><a href=\"http://moz.com/blog/google-analytics-certification-how-to-pass-the-gaiq-test\" target=\"_blank\">Google Analytics Certification and How to Pass the GAIQ Test</a> - Fantastic general guide for the GAIQ test it also has a practice test questions that you can download.  </p><p><a href=\"https://www.distilled.net/blog/web-analytics/gaiq-study-sheet/\" target=\"_blank\">GAIQ Study Sheet</a> - This is an older study sheet but it still has a lot topics that the GAIQ covers.</p><p><a href=\"http://viget.com/advance/how-to-pass-the-google-analytics-iq-test-in-two-days-zero-to-hero\" target=\"_blank\">How to Pass the Google Analytics IQ Test in Two Days: Zero to Hero</a> - Great resource guide for the GAIQ especially if you’re trying to pass quickly.</p><p><a href=\"http://www.firstclickconsulting.com.au/blog/the-complete-guide-to-studying-for-the-google-analytics-test/\" target=\"_blank\">The Complete Guide to studying for the Google Analytics IQ Exam</a> - Awesome guide for studying and has great advice from experts. </p><p>Hopefully this has given you a better understanding or confidence about the test. Now go practice! If you have any additional questions about the test, I would love to help, so feel free to leave a comment below.</p><p><a href=\"http://smashingboxes.com/work\"></a></p><p>Read more about the essentials of Google Analytics <a href=\"http://smashingboxes.com/ideas/growth-engineering-101-google-analytics-essentials\">here</a>.</p>",
  "slug": "tips-for-passing-the-2014-google-analytics-exam",
  "slug_history": "--- []\n",
  "visits": 8483,
  "published": "2014-09-03T22:12:21+00:00",
  "authorName": "Ross Ozburn",
  "category_id": 2,
  "image_uid": "2014/09/03/10/12/12/943/file",
  "created_at": "2014-09-02T16:04:54+00:00",
  "updated_at": "2015-06-15T19:13:49+00:00",
  "markdown": "",
  "image_alt_text": "",
  "featured": false,
  "database_id": 346,
  "category": {
    "type": "Entry",
    "id": "category_2"
  },
  "tags": [
    {
      "type": "tag",
      "id": "tag_32"
    },
    {
      "type": "tag",
      "id": "tag_32"
    }
  ]
}