{
  "id": "post_235",
  "title": "The Impact of Healthcare IT: The Lay of the Land",
  "summary": "An interview series with Mark Braunstein, Director of the Health Systems Institute at Georgia Tech, and columnist at InformationWeek. A decade or so ago only a very few professionals used the term logistics, yet it very quickly moved from an IT and Operations handle into the boardroom — and eventually to consumers when it became…",
  "body": "<p style=\"text-align: left;\" align=\"center\">\r\n\t<em>An interview series with Mark Braunstein, Director of the Health Systems Institute at Georgia Tech, and columnist at InformationWeek.</em></p><p style=\"text-align: left;\" align=\"center\">\r\n\tA decade or so ago only a very few professionals used the term l<em>ogistics, </em>yet it very quickly moved from an IT and Operations handle into the boardroom &mdash; and eventually to consumers when it became the tagline and promotional vanguard for UPS. Much like what manufacturing and retail experienced when data flow was systematized for operational efficiency, the health care industry is now experiencing: the development, propagation and consumerization of a data logistics system.</p><p>\r\n\t<a href=\"http://www.ic.gatech.edu/people/mark-braunstein\">Dr. Mark Braunstein</a>, a physician who also heads up the Health Systems Institute at Georgia Institute of Technology (Georgia Tech) in Atlanta, works with nearly every aspect of the medical industry to help develop a sensible and efficient approach to information management in medical industries. We interviewed the good doctor to help educate us about what’s current in the world of Healthcare IT. What we learned was so thought provoking that we thought we’d share it here. Over the next few weeks, we will submit for you a series of blogs about this bourgeoning industry in hopes that you, too, find the information inspiring.</p><h3>\r\n\tThe Factors Impacting Health Informatics\r\n</h3><p>\r\n\tCall it what you will – Electronic Health Records, Healthcare IT, Digital Health – digitizing patient records, caregiver operations and pharma/device manufacturer information is having enormous impact on consumers, healthcare providers, payers and even entrepreneurs.&nbsp; Health information for every American will soon be stored in the cloud, for access by any physician to whom the patient’s permission is given. And that data is further expanding the processes being developed not only for payer/provider, but for the pharmaceutical and biotech industries at large. Our conversations with Dr. Braunstein highlighted three major factors driving and impacting the world of healthcare informatics: Big Data; Finance/the Affordable Care Act; Entrepreneurship.</p><p>\r\n\tWe will explore these topics in future blog posts. But first, we asked Dr. Braunstein for an overview of the environment in which health care is operating. He shared the following insights into the State of Healthcare:</p><ul>\r\n\t\r\n<li>\r\n\t<strong>Chronic diseases impact care and cost</strong>: between 70% and 95% of health care costs are directly related to treating chronic diseases. Many of these are on the rise, such as diabetes, heart conditions and cancer among them. In fact, a surprising number of people battling chronic diseases are battling multiple chronic diseases.</li></ul><ul>\r\n\t\r\n<li>\r\n\t<strong>Too few primary care physicians: </strong>In the United States, only 12% of doctors are primary care physicians. This seems almost absurd to those in foreign countries. Compare it to France, for example, where the vast majority of doctors are primary care, healthcare costs are half of that of the US, and life expectancy is significantly longer as well.</li></ul><ul>\r\n\t\r\n<ul>\r\n\t\t\r\n<li>Americans see a complicated network of specialists for treatment&hellip; quite often, up to 14 different doctors each year. Patient data must be shared among each of these care givers in order for appropriate diagnosis and treatments to be given.</li>\t</ul></ul><ul>\r\n\t\r\n<li>\r\n\t<strong>Doctors are moving to EMR, but slowly</strong>: Only about 50% of private physicians have made the move to fully compliant electronic medical records, and approximately 75% of hospitals are ‘there.’ But they’re beginning to move more quickly now as they will very soon be left out of the network entirely if they are not in compliance.</li></ul><p>\r\n\tThese factors, along with those we will address in future blog posts, actually spell out significant opportunity for creative businesses. If you have an interest in finance, data access/storage and security, or entrepreneurship, read part 2 of the series&nbsp;<a href=\"/ideas/the-impact-of-healthcare-it-part-2/\">The Impact of Healthcare IT Part 2: Big Data, Big Cloud, Big Finance</a>.</p><p>\r\n\t<em style=\"background-color: initial;\">Smashing Boxes is a web and mobile app development company know for creating a lasting experience through bold design and disrupting the status quo. We are entrepreneurs and craftsmen first, and a digital creative agency second. Inspired by our visionary clients, we transform ideas into innovative web and mobile applications. </em><a href=\"http://smashingboxes.com/work\" style=\"background-color: initial;\">Take a look at our work.</a></p><p><em><a href=\"http://smashingboxes.com/work\" style=\"background-color: initial;\"></a>Cover photo by&nbsp;</em><a href=\"http://www.martindoersch.at/\" style=\"background-color: initial;\"><em>Martin Dörsch</em></a></p>",
  "slug": "the-impact-of-healthcare-it-part-1",
  "slug_history": "---\n- the-impact-of-healthcare-it\n",
  "visits": 513,
  "published": "2014-01-14T05:00:00+00:00",
  "authorName": "Katie McMillan",
  "category_id": 4,
  "image_uid": "2014/07/28/17/20/56/202/file",
  "created_at": "2014-06-05T18:21:28+00:00",
  "updated_at": "2014-07-31T20:02:50+00:00",
  "markdown": null,
  "image_alt_text": null,
  "featured": false,
  "database_id": 235,
  "category": {
    "type": "Entry",
    "id": "category_4"
  },
  "authors": [
    {
      "type": "employee",
      "id": "employee_59"
    },
    {
      "type": "employee",
      "id": "employee_59"
    }
  ]
}