{
  "id": "post_344",
  "title": "Durham’s First Code Academy Produces First-class Work at Demo Day",
  "summary": "The Iron Yard Academy powered by Smashing Boxes is Durham's first code school. The school represents an equal partnership between The Iron Yard and Smashing Boxes, marrying credibility and experience with a strong understanding of the local technology landscape. Our location in the entrepreneurial and tech-friendly American Tobacco Campus, just minutes from Research Triangle Park, is optimal for embracing technology and securing an enviable job in tech. ",
  "body": "<p>Kent Lovelace has had a pretty awesome life. He was the first African-American to be hired in the Creative Department of The Martin Agency, worked as graphic designer with world-renowned copywriters and Fortune 500 clients, and adopted a daughter with his wife of 20+ years. Now in his mid-50s, he can say he’s an accomplished front-end web developer learning everything he knows about coding in only 12 weeks.</p><p style=\"text-align: center;\"><img src=\"/media/W1siZiIsIjIwMTQvMDgvMjUvMTIvMTYvMzQvOTIwL3dtaUE1SHZhbmVSd1UyazY5eEpNUkxOTlg1a21jV1c5SDNUeXN2ZTl5RWMuanBnIl1d/wmiA5HvaneRwU2k69xJMRLNNX5kmcWW9H3Tysve9yEc.jpg?sha=cb06790e\"></p><p>Kent’s story doesn’t stand alone though. The 21 other students who graduated with him on Friday, Aug. 22 from <a href=\"http://academy.smashingboxes.com/\" target=\"_blank\">The Iron Yard Powered by Smashing Boxes</a> can also accept the title of Front-End Engineer or Ruby on Rails Developer. In fact, two of them have already accepted full-time jobs, one with with Validic and one with Smashing Boxes. Students presented to potential employers and the press Friday afternoon in a packed house at the Full Frame Theater on the <a href=\"http://www.americantobaccohistoricdistrict.com/\" target=\"_blank\">American Tobacco Campus</a>. Afterwards, employers eagerly spoke with students about their futures after graduation. </p><p>The experience was closer to polished product pitches to investors than your typical project presentation. “The apps were branded! They went so far past just the coding of the app,” remarked Jessica Mitsch, the Academy’s Campus Director and person responsible for helping students find jobs. Several groups even wore t-shirts touting the logo they designed for their app. </p><p style=\"text-align: center;\"><img src=\"/media/W1siZiIsIjIwMTQvMDgvMjUvMTIvMDIvMTcvMTAvMWZsQXVoNkFaOHMybVdZdkpqemU5UVVqWjNNeXVUSlloQmtMM1AxTXE3OC5qcGciXV0/1flAuh6AZ8s2mWYvJjze9QUjZ3MyuTJYhBkL3P1Mq78.jpg?sha=49a83b98\"></p><p>What were the student’s final projects? Check them out below:</p><p><a href=\"http://www.pladel.io/\" target=\"_blank\">Pladel</a> - Pladel is a mobile health application that uses Validic’s API to sync wearable devices and movement apps into one app that lets users input meals, get recipes from Yummly and score healthy behavior based on preset movement, diet and sleep goals.</p><p><a href=\"http://klovelacek.github.io/lifestory-portfolio/\" target=\"_blank\">Personal Journey</a> - Kent Lovelace chronicles his personal triumphs and tragedies in an interactive timeline website. The site concludes with projects that have come out of his</p><p>experience at The Iron Yard Academy powered by Smashing Boxes.</p><p>Syth Sandbox - Synth Sandbox is a creative environment for programmers to write and share code examples that are written with timbre.js, a javascript library designed for audio&nbsp;synthesis.</p><p><a href=\"http://girl-develop-it.herokuapp.com/\" target=\"_blank\">GDI Redesign</a> - The Girl Develop It team created a new site for GDI that is dynamic, responsive, and scalable. The site was rebuilt from the ground up, keeping all the original content in place and adding new features such as a database and API to manage chapter information, a map that makes it easy to find a local chapter, an administrative interface for national and chapter leaders, and a streamlined organization of the existing content.</p><p><a href=\"http://www.pett.io/\" target=\"_blank\">pett.io</a> - pett.io is a pet profile application, designed to be the destination to showcase the unique qualities of users’ pets. The app lets users create photo galleries, share information or reminisce about the pet.</p><p><a href=\"http://www.reciperocity.co/\" target=\"_blank\">Reciprocity</a>- This app allows users to share recipes, create potlucks with friends, and draw inspiration from the recipes of others to create unique dishes.</p><p>Inter-I - The goal of the project was to create a data set of ideas and the relationships between them. Founder Josh Tarkington exported 40 gigabytes of Wikipedia data and created a way to search an idea and pull up topics that relate. Eventually, the site will help people find things based on context, not keywords.</p><p>iSuccess - The purpose of iSuccess is to provide an organized interface for individuals to track their tasks and goals. The use of a intuitive UI design makes it easy for people who have trouble sticking to their plans to actually fulfill their goals. The app was deployed as both a web application and a mobile iOS application. </p><p><a href=\"http://www.festiv.it/\" target=\"_blank\">Festivit</a> - This app helps event and festival organizers manage details and tasks like mobile check-in for attendees. It will be tested at Chatham County's <a href=\"http://shakorihillsgrassroots.org/\">Shakori Hills Grassroots Festival</a> in October. </p><p>Pollish - Pollish came out of a Week 4 homework assignment to develop an application that allows users to create and answer multiple choice questions or “polls” and vote. Each&nbsp;question was required to have its own URL.</p><p style=\"text-align: center;\"><img src=\"/media/W1siZiIsIjIwMTQvMDgvMjUvMTIvMDQvMDEvMjk0L19EU0M3NzAwLmpwZyJdXQ/_DSC7700.jpg?sha=399028d2\"></p><p style=\"text-align: center;\"><img src=\"/media/W1siZiIsIjIwMTQvMDgvMjUvMTIvMDMvMTMvODcyL2FCMFRRXzVFODduTkVibmN6SXRJSlcxNWNmOUt6Qk0wSjl3VlZrbVhzZnMuanBnIl1d/aB0TQ-5E87nNEbnczItIJW15cf9KzBM0J9wVVkmXsfs.jpg?sha=da3f92db\"></p><p style=\"text-align: center;\"><img src=\"/media/W1siZiIsIjIwMTQvMDgvMjUvMTIvMDUvMDYvNTc2L0xIOWFzX19NbUVYbFg2aTNFaWNPUVNtQ0lvV1VaNXd5NF9JV0hmNHRQancuanBnIl1d/LH9as-_MmEXlX6i3EicOQSmCIoWUZ5wy4-IWHf4tPjw.jpg?sha=66b2de57\"></p><p style=\"text-align: center;\"><img src=\"/media/W1siZiIsIjIwMTQvMDgvMjUvMTIvMDUvMTYvNTAxL0E1Ym5RQndBR3VwaVVfUHRJc19KS1FvdDB5c01teXppQmxWcmJzemJmX2suanBnIl1d/A5bnQBwAGupiU-PtIs_JKQot0ysMmyziBlVrbszbf_k.jpg?sha=cbe83188\"></p><p style=\"text-align: center;\"></p><p>Interested in being a part of the next cohort beginning Sept. 15? There's never been a better time to&nbsp;<a href=\"http://academy.smashingboxes.com\">apply</a>&mdash;classes are filling up but there's still time to interview for your spot! If you'd like to talk to a recent grad about their experience, just let us know and we'll connect you.</p><p>Want to learn more about the Academy? Check out our&nbsp;<a href=\"http://smashingboxes.com/ideas/faq\" target=\"_blank\">FAQ page</a>!</p>",
  "slug": "durhams-first-code-academy-produces-first-class-work-at-demo-day",
  "slug_history": "--- []\n",
  "visits": 1572,
  "published": "2014-08-25T16:05:32+00:00",
  "authorName": "Laura Smith",
  "category_id": 1,
  "image_uid": "2014/08/25/12/01/16/468/file",
  "created_at": "2014-08-25T16:01:38+00:00",
  "updated_at": "2014-08-26T14:27:01+00:00",
  "markdown": null,
  "image_alt_text": null,
  "featured": false,
  "database_id": 344,
  "category": {
    "type": "Entry",
    "id": "category_1"
  },
  "authors": [
    {
      "type": "employee",
      "id": "employee_60"
    },
    {
      "type": "employee",
      "id": "employee_60"
    }
  ]
}