{
  "id": "post_362",
  "title": "Cenduit Levels Up Their UX With Help From Smashing Boxes",
  "summary": "Cenduit, the largest Interactive Response Technology (IRT) specialist in the world, recognized the opportunity to set a new standard for user experience (UX) in their industry. In the following podcast, Cenduit and the UX team at Smashing Boxes discuss the rising expectations of technology users, how intelligent UX can help products scale, when its not smart to go mobile, and the challenges of creating a UI for multiple user types.  ",
  "body": "",
  "slug": "cenduit-levels-up-ux-with-smashing-boxes",
  "slug_history": "--- []\n",
  "visits": 647,
  "published": "2014-12-11T02:21:33+00:00",
  "authorName": "",
  "category_id": 3,
  "image_uid": "2014/12/10/11/31/43/182/file",
  "created_at": "2014-12-09T17:39:07+00:00",
  "updated_at": "2014-12-11T20:17:47+00:00",
  "markdown": "As digital experiences are pushed forward by visionary organizations like Apple and Google - whose polished products we interact with daily - people expect more from all online experiences, including those at the office. Cenduit, the largest Interactive Response Technology (IRT) specialist in the world, recognized their user’s desire for a better system and an opportunity to set a new standard for user experience in their industry. They surveyed their users for feedback and then partnered with our experience design team to revamp their user interface, becoming the first in their industry to offer their customers a sleek and modern IRT system.\r\n\r\nWe were flattered when Cenduit invited us to join them on their [QuickCast Series](http://www.cenduit.com/quickcasts) to discuss the evolution of their IRT system and their experience partnering with us. In the following podcast, we join Cenduit in discussing the rising expectations of technology users, how intelligent UX can help products scale, when it's not smart to go mobile, and the challenges of creating a UI for multiple user types.  \r\n\r\n\r\n<iframe width=\"100%\" height=\"450\" scrolling=\"no\" frameborder=\"no\" src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/175339784&amp;auto_play=false&amp;hide_related=false&amp;show_comments=true&amp;show_user=true&amp;show_reposts=false&amp;visual=true\"></iframe>\r\n\r\n",
  "image_alt_text": null,
  "featured": false,
  "database_id": 362,
  "category": {
    "type": "Entry",
    "id": "category_3"
  },
  "tags": [
    {
      "type": "tag",
      "id": "tag_13"
    },
    {
      "type": "tag",
      "id": "tag_14"
    },
    {
      "type": "tag",
      "id": "tag_13"
    },
    {
      "type": "tag",
      "id": "tag_14"
    }
  ],
  "authors": [
    {
      "type": "employee",
      "id": "employee_16"
    },
    {
      "type": "employee",
      "id": "employee_16"
    }
  ]
}