{
  "id": "post_328",
  "title": "Three Ways to Make Code School Work for You",
  "summary": "Three tips for making the most out of a code school education. ",
  "body": "<h3>\r\n\tTINKER\r\n</h3><p>\r\n\tYou’ve read about how code schools are changing&nbsp;<a href=\"http://www.smashingboxes.com/no-computer-science-degree-no-problem/\">the face of technology education</a>, making up\r\nfor the lack of computer science majors coming out of traditional Universities.\r\nYou’re creative and love to learn, and you also know your college major has\r\nhelped you find a ‘job’ more than a ‘career.’ You’ve been told that 12 weeks of\r\ntime away from work in an intensive code school will be worth it in the long\r\nrun, but it’s still&nbsp;\r\n\t<a href=\"http://blog.theironyard.com/post/92054223243/rocket-ships\">a leap of faith</a>. How do you determine if a\r\ncode school program is right for you? In a word, tinker.</p><p>\r\n\t<img src=\"https://media.giphy.com/media/LzCNYKqMDNN3q/giphy.gif\" alt=\"\" style=\"display: block; margin: auto; width: 600px;\"></p><p>\r\n\tTinkering is the act of playing around, teaching\r\nyourself, figuring out on your own how to solve a problem, ‘Googling’ it. It’s\r\none of the most important attributes employers are looking for when they hire\r\nprogrammers. To help begin your tinkering adventure, we’ve collected some\r\ngems from the plethora of (mostly free) coding tutorials available online.\r\nThese resources, and language descriptions, are specific to the technologies\r\nthat will be taught in our<a href=\"http://academy.smashingboxes.com/\">&nbsp;Academy</a> courses and\r\nmay not apply to all code schools. Leave us a comment at the end of this\r\narticle if you find anything noteworthy along the way.</p><h5>\r\n\t<em><strong>HTML/CSS</strong></em>\r\n</h5><p>\r\n\tHTML\r\n&amp; CSS are used to define the elements (headers, paragraphs, etc.) and\r\npresentation of a website. These are front end languages and\r\ncomponents. Front end engineering is the creation of an interface that\r\nallows the user and back end to communicate, it is essentially the appearance\r\nand interactivity of a website. Try \r\n\t<a href=\"https://dash.generalassemb.ly/\">Dash</a>,\r\na slide-based text and interactive tutorials (i.e. entering code in a window or\r\nscreen). Dash lets you tinker with several small projects: a personal website,\r\na responsible blog theme, a small business website, and a CSS robot. Dash\r\nincorporates JavaScript as well as HTML &amp; CSS.</p><h5>\r\n\t<em><strong>JavaScript&nbsp;</strong></em>\r\n</h5><p>\r\n\tJavaScript,\r\nanother front end language, is used to make pages more interactive. It is used\r\nwith other languages such as HTML to make the visual components more dynamic.\r\nTry \r\n\t<a href=\"http://www.codecademy.com/tracks/javascript\">Codecademy</a> and\r\nuse interactive tutorials to create interactive websites and browser based\r\ngames.</p><h5>\r\n\t<strong><em>Ruby on Rails</em></strong>\r\n</h5><p>\r\nRuby is modular, object-oriented programming language. Rails is a full-stack\r\nopen source web application framework. This means that it allows pages and\r\napplications to pull information from the server and talk directly to the\r\ndatabase.This back end language is open source and scalable, so it is able to\r\nbe used on projects of varying sizes. Also, websites and applications built\r\nusing Rails can be deployed quickly. Try \r\n\t<a href=\"https://www.codeschool.com/paths/ruby\">Code\r\nSchool\r\n\t</a>‘s videos and interactive Ruby tutorials with challenges to\r\nlearn to build dynamic web applications.</p><h5>\r\n\t<em><strong>iOS</strong></em>\r\n</h5><p>\r\n\tObjective-C is the programming language of the iOS operating system of Apple products.\r\nTry \r\n\t<a href=\"https://www.codeschool.com/paths/ios\">Code School</a>‘s videos and interactive iOS tutorials starting\r\nwith basic iOS development in Objective-C.</p><p>\r\n\tNow, perhaps you’re thinking, “If you just gave me all of\r\nthese free coding tutorial websites, why should I enroll in a code school?” We\r\nhope you’ll check out these online sites to give you an understanding of what\r\nyou could be learning in depth at The Academy. Online code education is a great\r\nstart! However, like learning a foreign language, you need to completely\r\nimmerse yourself to become fluent. It is very difficult to fully understand\r\ndevelopment’s complex subject matter and nuances from a website tutorial or\r\nYouTube video. In real world programming there can be multiple ‘acceptable’\r\nmethods to execute a command. Learning how to navigate the subjectivity of\r\nsoftware engineering is a benefit that The Academy provides in a classroom\r\nsetting: unscripted, open ended assignments that set you up to make judgments\r\nwithin the subjectivity of the field. The&nbsp;\r\n\t<a href=\"http://academy.smashingboxes.com/curriculum\">curriculum</a>\r\n\tprovides a fundamental understanding of complex steps and explains why things\r\nwork the way they do, giving you the tools and experience needed to succeed\r\nafter classes end. A code school experience will also provide the guidance\r\nof experts and the added benefit of having access to real-time culture and\r\ncollaboration in an entrepreneurial and technical environment\r\n\t<strong style=\"background-color: initial;\">.</strong></p><h3>\r\n\t<strong>CHOOSE WISELY</strong>\r\n</h3><p>\r\n\t<img src=\"https://media.giphy.com/media/O7rTdX44j7HGM/giphy.gif\" style=\"width: 624px; display: block; margin: auto;\" alt=\"\"></p><p>\r\n\t<strong></strong>When it comes to code schools, there are\r\nseveral variations. In terms of curriculum, some programs focus intensely on\r\nlearning a specific language or highly related set of languages while other\r\nprograms provide a general, less focused, overview of many technologies.\r\nNeither is wrong or right, it simply depends on your goal. If you are hoping to\r\nleave the class with a job as a professional programmer, than you should look\r\ninto the first option. Alternatively, courses touching on numerous languages\r\nprovide an excellent technical foundation for people in non-programming roles\r\nin a technical environment, such as sales, marketing, technical writing, or\r\noperations.</p><p>\r\n\tThere is perhaps greater disparity in\r\ngraduate satisfaction between \r\n\t<a href=\"http://blog.theironyard.com/post/92054222278/no-night-classes\">part-time and full-time programs</a>.\r\nPart time programs allow for students to continue their everyday life while\r\ngetting a code school education. Students divide their time between their\r\nweekday job and code school, which is on evenings and/or weekends. This type of\r\nstudy allows for flexibility, but not for complete and undivided immersion into\r\nthe subject matter. Students of part time programs should be realistic about\r\nwhether this type of program will set them up for success as a professional\r\nprogrammer.</p><p>\r\n\tFull time programs, on the other hand, mean\r\nthat the program essentially becomes a student’s day job, and then some. These\r\nprograms allow for the curriculum to be intensive and fully immersive because\r\nstudents won’t have outside distractions or side projects demanding their\r\nconcentration and time in addition to schoolwork. Students of full-time\r\nprograms tend to have a much more positive experience – both in securing a job\r\nand possessing the abilities to do the job – post code school.</p><p>\r\n\tBefore making the (often life changing)\r\ndecision to attend a code school, ask yourself the following questions to help\r\ndetermine the right program for you:</p><ul>\r\n\t\r\n<li>What are your career goals?</li>\t\r\n<li>Which style of learning best suits your needs?</li>\t\r\n<li>What serves the best purpose for your future?</li></ul><h3>\r\n\t<strong>GET NOTICED</strong>\r\n</h3><p>\r\n\t<strong></strong>Effective code schools offer guest\r\nlectures, \r\n\t<a href=\"http://www.smashingboxes.com/who-is-durhams-first-code-academy/\" style=\"background-color: initial;\">vetted instructors</a>, networking events,\r\nfreelance work, office tours, free tutoring, and other opportunities that help\r\nyou get face time with employers and local stakeholders. Make sure your school\r\nhas solid ties with area employers – typically this comes in the form of an employer\r\nadvisory board or hiring partners – and take advantage by introducing yourself\r\nand asking questions. Collect emails from employers and ask if you can send\r\nthem samples of your work. Write a blog. Attend office tours and events held\r\noff-campus, and chat with employees to see how they like working there.\r\nEmployers are involved with code academies because they are hoping to hire you\r\nand made a difference in the community.</p><p>\r\n\tRemember, there’s a lack of qualified\r\nprogrammers across the country.&nbsp;<a href=\"http://academy.smashingboxes.com/\">Carpe diem!</a></p><p>\r\n\t<img src=\"http://sbblog.s3.amazonaws.com/wp-content/uploads/2014/05/giphy.gif\" style=\"width: 628px; display: block; margin: auto;\" alt=\"\"></p><p>\r\n\t<a href=\"https://twitter.com/smashingboxes\">Follow us on Twitter</a> for regular updates on the academy.</p><p><em>Smashing Boxes is a web and mobile app development company known for creating a lasting experience through bold design and disrupting the status quo. We are entrepreneurs and craftsmen first, and a digital creative agency second. Inspired by our visionary clients, we transform ideas into innovative web and mobile applications. </em><a href=\"http://smashingboxes.com/work\">Take a look at our work.</a></p><p><em>\r\n\tCover photo by&nbsp;</em><a href=\"https://www.flickr.com/photos/mukumbura/\" style=\"background-color: initial;\"><em>Tristan Martin</em></a></p>",
  "slug": "three-ways-to-make-code-school-work-for-you",
  "slug_history": "--- []\n",
  "visits": 905,
  "published": "2014-07-21T19:19:15+00:00",
  "authorName": "Ellen Clemons",
  "category_id": 1,
  "image_uid": "2014/07/28/17/19/46/529/file",
  "created_at": "2014-07-21T19:18:44+00:00",
  "updated_at": "2014-08-08T21:21:54+00:00",
  "markdown": null,
  "image_alt_text": null,
  "featured": false,
  "database_id": 328,
  "category": {
    "type": "Entry",
    "id": "category_1"
  },
  "authors": [
    {
      "type": "employee",
      "id": "employee_65"
    },
    {
      "type": "employee",
      "id": "employee_65"
    }
  ]
}