{
  "id": "post_388",
  "title": "The Digital Product Guide: Discovering Your Target Audience",
  "summary": "Have a great idea for a digital product, like an app or website, but not sure what to do next? Researching where your product fits into the marketplace is a vital component to achieving success early on. This is the first article in a series by Durham based agency Smashing Boxes on how to build a successful digital product.",
  "body": "<p><br>\r\n</p><p>Have a great idea for a product, but not sure what to do next? Researching where your product fits into the marketplace is a vital component to achieving success early on. In this blog post, you’ll hear from some of our seasoned researchers and strategists on best practices and tools for exploring market opportunities.<br>\r\n</p><p><br>\r\n</p><h4>Your Audience and Competitive Research</h4><p><br>\r\n</p><p>In the internet age, we are all competing for an incredibly valuable resource: time. The success of a product—new or existing—correlates directly to whether users believe the product can, has, or will add significant value to their lives through its use.\r\n</p><p>At the bare minimum, new products must accomplish something that people need or want and, in some scenarios, both. Not all people need and want the same things—your product must focus on delivering value for a specific group of people: your primary audience.\r\n</p><p>Identifying your audience does not take place after you launch your new product. Successful products hone in on their target throughout the design and development process, with the help and feedback of potential (or actual) end users.\r\n</p><p>When developing a go-to-market strategy, it is imperative that you conduct thorough market research, define and find a target audience, and involve end users in the design process.\r\n</p><p><br>\r\n</p><h4>Secondary Research: How to get started</h4><p><br>\r\n</p><p>How do you determine what people might need and want?\r\n</p><p>For your first step, conduct a thorough analysis of the existing landscape. As you conduct your research, compare a set of both primary and secondary competitors. Even if a product does not offer the exact same services and benefits as yours, there are still lessons to be learned from their failures, success, and overall business model. The more products you have to evaluate and benchmark against, the more insights you’ll stand to gain.\r\n</p><p><em>There’s a wealth of information to acquire, and you’re going to need all of it. Information is power.\r\n\t</em>\r\n</p><p>As you conduct market research, it is vital to document and track your newly acquired knowledge of your target market. If working with a team, we recommend the use of collaborative management tools such as Evernote, Google Docs, or Basecamp.\r\n</p><p><br>\r\n</p><h5><img src=\"https://lh4.googleusercontent.com/b6F19uN6ZE1Yyxug0SUnaCQcnQsYCx7nfienl5-mekjIddHnxMi8ykwQUnpfVl5E2UXZcc5BXJfyBHHVHLvjpS9QSnYyKAdjnNtRcJ5sTAB4eK4taezcz_6sypzw_X2q=s1600\"></h5><p style=\"text-align: center;\"><em>Entities analyzed for a recent fashion-specific project. These were selected for a “deep dive” discovery process after fully assessing the existing landscape at a high-level. </em>\r\n</p><p style=\"text-align: center;\"><em><br></em>\r\n</p><h4>Market Research: Tools for identifying competitors</h4><p><br>\r\n</p><p>We’ve compiled a short list of online tools that may be helpful when searching for competing products. These tools are mostly offer some free level of service, though there are additional paid tools that you and your team could leverage.\r\n</p><p><strong>Startup company databases\r\n\t</strong>\r\n</p><p>If there’s a market opportunity, chances are that someone is working on a startup to disrupt that market and take advantage of that opportunity. Startup company databases provide insight into early- and growth-stage startups that are developing new products and pivoting their businesses to take advantage of new opportunities in the marketplace. Use these databases to identify new entrants into the market, how much funding they have acquired, information about founders, relevant investors, and notable board members. Here are three places to start your research on startups:\r\n</p><ul>\r\n\t<li><a href=\"https://www.crunchbase.com/\"><u>Crunchbase</u></a></li>\r\n\t<li><a href=\"http://yclist.com/\"> <u>YC List</u></a></li>\r\n\t<li><a href=\"https://angel.co/\"> <u>AngelList</u></a></li>\r\n</ul><p><strong>Mobile app evaluation tools\r\n\t</strong>\r\n</p><p>A thorough survey of mobile applications available on the Apple Store and on the Google Play Store will help you uncover the categories your assumed competitors have listed. You can also perform keyword research to determine how competing products are found by their audience. As you conduct research, be sure to note opportunities that you identify to be featured in specific sections of the Apple or Google Play Stores such as less competitive or seasonally-relevant categories. Here are a few places to start your research on mobile applications:\r\n</p><ul>\r\n\t<li><a href=\"https://www.appannie.com/\"><u>App Annie</u></a></li>\r\n\t<li><a href=\"https://www.mobileaction.co/\"><u>Mobile Action</u></a></li>\r\n\t<li>Store Direct Reviews (<a href=\"https://itunes.apple.com/us/genre/ios/id36?mt=8\"><u>App Store</u></a>,<a href=\"https://play.google.com/store/apps?utm_source=na_Med&amp;utm_medium=hasem&amp;utm_content=May0315&amp;utm_campaign=Evergreen&amp;pcampaignid=MKT-DR-na-us-dsk-Med-hasem-ap-Evergreen-May0315-64259107948-EXA%7cONSEM_kwid_43700007229200881&amp;gclid=CPmv-YeUhscCFVdnNwoduy8BLQ&amp;gclsrc=ds\"> <u>Google Play Store</u></a>)</li>\r\n\t<li>“Customers Also Bought” (App Store) or “Similar” (Google Play Store)</li>\r\n</ul><p><strong>Website evaluation tools\r\n\t</strong>\r\n</p><p>Once you’ve identified potential competitors, you’ll want to take an additional step: determining their traffic referral sources and noting what other web properties their audience visits. By using these five tools, you may be able to determine the volume of users within a given time period, see growth trends or seasonality of use, and also get an indication of the specific referral sources from which the competitor’s website traffic derives. Here are five website evaluation tools that may help you as you conduct your research:\r\n</p><ul>\r\n\t<li><a href=\"http://www.similarweb.com/\"><u>SimilarWeb</u></a></li>\r\n\t<li><a href=\"http://www.alexa.com/\"><u>Alexa</u></a></li>\r\n\t<li><a href=\"https://www.compete.com/\"><u>Compete</u></a></li>\r\n\t<li><a href=\"https://www.quantcast.com/\"><u>Quantcast</u></a></li>\r\n\t<li><u><a href=\"https://www.consumerbarometer.com/en/\">Consumer Barometer</a></u></li>\r\n</ul><p><span style=\"line-height: 20px;\"><br></span>\r\n</p><h4>Market Research: strategies for evaluating competitors</h4><p><br>\r\n</p><p>Once you’ve completed your thorough research of competitors using the above tools, it’s time to evaluate each competitor to identify if they truly are “the competition.”\r\n</p><p>In your survey, you may seek to discover:\r\n</p><ul>\r\n\t<li>How many competitors are in the marketplace, and what are their products?</li>\r\n\t<li>Which of these competitors are successful? Which are not? If competitors are startups, have any sold their company or licensed their product—or have any folded and gone out of business?</li>\r\n\t<li>What features, designs, and experiences of competing products add distinct value to the end user, ultimately making the product successful?</li>\r\n\t<li>What features, designs, and experiences are absolutely necessary to create value for end users?</li>\r\n\t<li>What features, designs, or experiences are missing? How might you make it easier for the user to engage with your product rather than a competing product?</li>\r\n</ul><p>There are many different ways to conduct a strategic analysis of competitors—we’ve compiled a brief list of suggested tools:\r\n</p><ul>\r\n\t<li>Create a SWOT Matrix to identify strengths, weaknesses, opportunities, and threats;</li>\r\n\t<li>Conduct a CARVER Analysis with specific evaluation criteria; and/or</li>\r\n\t<li>Deploy a Strategy Canvas to compare products across companies or industries.</li>\r\n</ul><p><span style=\"line-height: 20px;\"><br></span>\r\n</p><p><img src=\"https://lh5.googleusercontent.com/beL1-RJn_J_dH3S1cta5FO4ZOj4gjCXXnLl6IX6xrjfjJCroFDgrt_cfHMR4tCPyVP1Mv9GPNyETHyAqzWHY_YJIIkmzFeDZF3fGLfNQlrl8U9G4mp5OFw29OEQ5zHNzwg=s1600\"></p><p style=\"text-align: center;\"><em>A strategy canvas graphs competing value factors and the offering levels of businesses that are directly or indirectly operating in the same marketplace. The strategy canvas helps to determine the value proposition and market position for a business. This particular strategy canvas maps a client in the social photo sharing space against potential competitors such as Snapchat and Slingshot. </em></p><p style=\"text-align: center;\"><em><br></em></p><p>It is important to keep an open mind going into your analysis--determining a strategy too early may limit or skew opportunities for your product. Selecting a strategy may depend on the direction you want to take your idea and your product. Do you want mass adoption, or will targeting a niche market be a priority? Who might be your target user group, and what is the problem that you are helping them solve?\r\n</p><h5><br></h5><h4>Your Target Audience: how to get started </h4><p><br>\r\n</p><p>You may not have a crystal clear idea of who will be using or buying your product when you start conducting market research—but you sure need a clear understanding of your target audience before you complete product design.\r\n</p><p>Many product designers do not know where to start, because they do not possess an existing set of audience insights, and sometimes they do not possess an audience at all. If you don’t have an existing set of audience insights with which to work, that’s okay. While great to have this data, it is not essential to high quality audience targeting.\r\n</p><p>By utilizing a set of hypotheses about your potential audience, you’re able to construct a framework in which to test those hypotheses and determine whether your assumptions are valid. Successful product designers test assumptions before designing the product—and many times, even before building a prototype!\r\n</p><p>In order to test your hypotheses, you may wish to consider the following tactics:\r\n</p><ul>\r\n\t<li>Formal or informal surveys, conducted online or in-person;</li>\r\n\t<li>Formal or informal focus groups, usually consisting of between 8-12 people;</li>\r\n\t<li>Analyzing social media messages using social listening tools or sentiment analysis;</li>\r\n\t<li>Competitive analysis;</li>\r\n\t<li>Studying pre-existing industry or market survey and study results; and/or</li>\r\n\t<li>Third-party research (from providers like comScore, Simmons, MRI, or others). </li>\r\n</ul><p>By utilizing these methods, or other methods of testing your product assumptions and ideas within potential audience segments, you’ll gain the insight you need to segment your audience appropriately and begin to form personas. Inevitably, the work you invest in defining your audience segments will result in an effective product-market fit and enable you to bring your product to market successfully.\r\n</p><h5><br></h5><h4>Other Methods for “Idea Vetting”</h4><p><br>\r\n</p><p>There are a multitude of ways to leverage the power of your personal and professional networks to test your product idea and your hypotheses about proper audience or audience segments.\r\n</p><p>One of the best ways to test hypotheses is to leverage personal connections—individuals that you know or individuals within a common group or community are often glad to help when properly asked. Leveraging pre-existing relationships can yield quick feedback on your product idea and hypotheses.\r\n</p><p>How do you find people that fall inside your assumed user groups to test your hypotheses? Here are a few additional tactics that you may use to identify these groups:\r\n</p><ul>\r\n\t<li>Are you a member of a community of people that have similar interests or problems that your product aims to solve?</li>\r\n\t<li>Is there a Meetup group that attracts individuals from within your target audience segment?</li>\r\n\t<li>Do you know any community organizers or leaders that would let you run a short workshop or give a short presentation at one of their events?</li>\r\n\t<li>Are you a member of a club, non-profit, church group, athletic team, or professional community? Consider formally or informally asking folks for feedback.</li>\r\n</ul><p>When you meet and interact with people who are the assumed target for you product, it’s important to work to understand their needs, their desires, and their pain points. While in conversation, embrace your empathetic side—many of the best connectors are experts in empathy, and always listen more than they speak. You’ll find that they ask a wide range and variety of questions, always aimed at finding out information like:\r\n</p><ul>\r\n\t<li>What does my target customer value? </li>\r\n\t<li>What does my target customer spend money on, and how much?</li>\r\n\t<li>What are the short- and long-term goals of my target customer? </li>\r\n\t<li>What’s one thing that would make every day life better for my target customer?</li>\r\n\t<li>Where does my customer believe they waste resources (money, time, products)?</li>\r\n</ul><p>To fully identify and uncover a target market or audience segments within a target market, you must consistently and adequately test the market. To do so requires flexibility, an investment of time and resources, and empathy.\r\n</p><p>The end result of this initial phase will never be 100% accurate, and that’s okay because much of the learning will come later when you begin to build out your product and test it with real users. In this testing you may find that your assumptions are correct, and you may find that they were incorrect and uncover a new market not previously considered.\r\n</p><p>By appropriately testing your assumptions and hypotheses, successful product designers learn valuable information that can be incorporated into the final design, ensuring better usability and happier end users. In the next article in this blog series, we’ll discuss methods for using prototyping to test the market you’ve identified and uncover value.\r\n</p>",
  "slug": "digital-product-guide-discovering-your-target-audience",
  "slug_history": "--- []\n",
  "visits": 0,
  "published": "2015-09-20T04:00:00+00:00",
  "authorName": "",
  "category_id": 2,
  "image_uid": "2015/09/16/15/22/13/741/file",
  "created_at": "2015-09-16T18:58:31+00:00",
  "updated_at": "2015-09-16T19:58:05+00:00",
  "markdown": "",
  "image_alt_text": "Digital Product Guide | Discovering Your Target Audience | ",
  "featured": true,
  "database_id": 388,
  "category": {
    "type": "Entry",
    "id": "category_2"
  },
  "tags": [
    {
      "type": "tag",
      "id": "tag_13"
    },
    {
      "type": "tag",
      "id": "tag_38"
    },
    {
      "type": "tag",
      "id": "tag_13"
    },
    {
      "type": "tag",
      "id": "tag_38"
    }
  ],
  "authors": [
    {
      "type": "employee",
      "id": "employee_65"
    },
    {
      "type": "employee",
      "id": "employee_72"
    },
    {
      "type": "employee",
      "id": "employee_85"
    },
    {
      "type": "employee",
      "id": "employee_38"
    },
    {
      "type": "employee",
      "id": "employee_75"
    },
    {
      "type": "employee",
      "id": "employee_65"
    },
    {
      "type": "employee",
      "id": "employee_72"
    },
    {
      "type": "employee",
      "id": "employee_85"
    },
    {
      "type": "employee",
      "id": "employee_38"
    },
    {
      "type": "employee",
      "id": "employee_75"
    }
  ]
}