{
  "id": "post_349",
  "title": " Watch - Relevant to Healthcare?",
  "summary": "As a hospitalist at Duke University who takes care of both children and adults, as well as the Director of Mobile Technology Strategy, I get to take care of patients both one at a time as well as a million at a time. Technology has never held so much promise for the improvement of medical care as it does right now. These are my thoughts on how we can make that happen.",
  "body": "<p style=\"text-align: center;\">\r\n\t<img src=\"/media/W1siZiIsIjIwMTQvMDkvMTYvMTIvMDEvNTYvOTc1L0FwcGxlX1dhdGNoLnBuZyJdXQ/Apple%20Watch.png?sha=64214afc\" style=\"width: 334px;\"></p><p>\r\n\tThe anticipation in advance of the Apple event this week was similar to that prior to the announcements of the original iPhone in 2007 and the iPad in 2010.  It would have been an extreme disappointment if the event ended \r\n\t<em style=\"background-color: initial;\">without</em> the announcement of a new product category.</p><p>\r\n\tOf course, everyone figured it would be a watch, but just like the previous announcements in 2007 and 2010, no one had any idea what it would look like or what it would do.  Apple is \r\n\t<em>very good</em> at secrecy when mass manufacturing for a product hasn't yet commenced, or when the product includes new software (as evidenced by the surprise announcement of the <a href=\"https://developer.apple.com/swift/\" target=\"_blank\">Swift programming language</a> in June).  Both were true in case.  Prior to the announcement, the  Watch, as it is now known, had been produced in only limited test quantities, and the new version of iOS that it runs had never before been seen publicly.</p><p>\r\n\tThe  Watch was announced in the context of the prior announcement of HealthKit in June.  Special emphasis has been placed on the health and fitness features of the watch, with Apple going as far as producing a \r\n\t<a href=\"http://www.apple.com/watch/films/#film-fitness\" target=\"_blank\">separate promotional video</a> highlighting this use.</p><p>\r\n\tThat said, the expectations for what this watch would do for health and fitness bordered on magical.  Sources as reliable as the Wall Street Journal predicted that the device would \"\r\n\t<a href=\"http://online.wsj.com/articles/apple-plans-multiple-designs-for-smartwatch-1403245062\" target=\"_blank\">include up to 10 sensors.</a>\"  With current technology, I couldn't imagine how that many high-quality sensors could be included in a 1st generation product while still maintaining a reasonable size, cost and battery life.  Sure enough, the actual product was more firmly grounded in reality, with just a single medical sensor to measure pulse, in addition to the activity tracking of the M8 chip and the new barometric functionality to measure elevation.</p><p>\r\n\tIt's quite likely that these rumors have some basis in fact, however.  The  Watch is the most intimate product ever created by Apple, and I'm not just referring to the ability to share your heartbeat with that special someone.  It's a device that is in \r\n\t<em>constant contact with your skin</em>.  Just that fact alone opens the door for many sensors beyond simple measurement of <a href=\"http://www.apple.com/watch/technology/\" target=\"_blank\">heart rate</a>.  In fact, I'd wager that the  Watch could open the floodgates to R&amp;D into transcutaneous sensors, with the potential to transform how we see ourselves.  The <a href=\"http://en.wikipedia.org/wiki/Quantified_Self\" target=\"_blank\">quantified self</a> has just gotten much closer to reality.</p><p>\r\n\tSo what can the  Watch do for healthcare right now?  At the very least, the profile of wearable electronics will get a huge boost in the consumer sector.  They will become more socially acceptable, and users will come to rely on them and even \r\n\t<em>trust them</em> to make meaningful differences in their lives.  Laying this foundation now will be critical to encourage the adoption of more advanced wearable sensors in future devices.</p><p>\r\n\tHow useful the watch ends up being for consumer health and fitness will ultimately come down to the combination of hardware \r\n\t<em>and</em> software.  The fact that all of this data will be saved to HealthKit is very attractive, because the data can then be shared with <em>any </em>other HealthKit-enabled health or fitness app the user chooses.  Giving this power to the user is a smart move, and will likely foster a more open and diverse ecosystem of useful health and fitness apps moving forward.</p><p>\r\n\tWith respect to use of the  Watch in the clinical setting, I love learning about and using new technology, but I’m also cognizant that the modern reality of electronic medical records has resulted in tension within the physician-patient relationship.  During a typical visit, physicians often find themselves staring at a computer screen rather than interacting with the patient.</p><p>\r\n\tIn medical school we were taught the Latin phrase, “primum, non nocere” or, “first, do no harm.”  When technology interferes with the relationship we have with our patients, harm is being done.  When technology enhances our work while remaining transparent to the interaction, we can make progress.  Technologies such as the  Watch have the potential to take us a step in that direction by providing another avenue for relatively unobtrusive data access.  As a developer myself, I’m looking forward to the arrival of the WatchKit SDK so I can see more fully how this functionality might be integrated into our medical environment, both from the perspective of a user as well as a physician.</p><h2>\"When technology interferes with the relationship we have with our patients, harm is being done. When technology enhances our work while remaining transparent to the interaction, we can make progress.\"</h2><p>\r\n\tHow could the watch be improved?  It'll be easier to see once the watch has been released and the limitations become more apparent.  But for starters, the watch needs to be waterproof.  While there's no official statement on this, \r\n\t<a href=\"https://www.yahoo.com/tech/apple-watch-update-more-details-and-hands-on-97091024129.html\" target=\"_blank\">David Pogue revealed</a> that it's likely just water resistant.  I'm an avid swimmer, and one of the reasons I love my <a href=\"https://getpebble.com/\" target=\"_blank\">Pebble Smartwatch</a> is because I never have to take it off (plus, it lasts up to 5-7 days per charge).  This would be critical for any users whose primary form of physical activity involves water sports.  Many of our patients who participate in cardiac rehab are often involved in water aerobics, and they would have to remove the watch to participate, thus nullifying much of the activity tracking benefit.</p><p>\r\n\tBattery life also needs to be at least several days.  I've heard some lamentations that the watch doesn't have sleep tracking functionality like some of the other popular wearables.  If the  Watch has a battery life of only 24 hours as rumored, sleep tracking would be an&nbsp;impossibility given that the watch would need to charged at night, every night.  The watch also appears a bit too bulky in its current iteration to keep on while sleeping (in my opinion).</p><p>\r\n\tI'm confident all these issues will be resolved over time in future iterations of the watch (or competing watches).  Progress will continue and app developers will surely come up with uses that Apple hasn't even considered.  Mobile health innovators should pay close attention to this new product category.  It will eventually revolutionize how we care for our patients and ourselves.</p><p>This article&nbsp;was originally posted on&nbsp;<a href=\"http://www.rickybloomfield.com/2014/09/watch-relevant-to-healthcare.html\" target=\"_blank\">Ricky Bloomfield's blog</a>.&nbsp;Dr. Bloomfield is the Director of Mobile Technology Strategy as well as Assistant Professor in Internal Medicine &amp; Pediatrics at Duke University. He is passionate about the integration of meaningful mobile technologies into healthcare to improve the health of those around us.</p><p>To read&nbsp;other insights from our own mobile developers, check out more&nbsp;<a href=\"http://smashingboxes.com/ideas?category=mobile\" target=\"_blank\"></a><a href=\"http://smashingboxes.com/ideas?category=mobile\" target=\"_blank\">mobile ideas</a> on our blog,</p>",
  "slug": "watch-relevant-to-healthcare",
  "slug_history": "--- []\n",
  "visits": 894,
  "published": "2014-09-18T13:05:22+00:00",
  "authorName": "Ricky Bloomfield, MD, Director, Mobile Technology Strategy, Duke Medicine",
  "category_id": 4,
  "image_uid": "2014/09/17/13/36/06/978/file",
  "created_at": "2014-09-16T15:57:25+00:00",
  "updated_at": "2014-09-22T15:52:38+00:00",
  "markdown": null,
  "image_alt_text": null,
  "featured": false,
  "database_id": 349,
  "category": {
    "type": "Entry",
    "id": "category_4"
  }
}