{
  "id": "post_377",
  "title": "Our Design Process: Discovery",
  "summary": "In this video of my talk at AIGA I go into detail about the Smashing Boxes design process, beginning with discovery. This is part one in a four part video series touching on the entire design process including discovery, sketching, grids and illustrations, and design inspiration. ",
  "body": "",
  "slug": "our-design-process-introduction",
  "slug_history": "---\n- our-design-process-discovery\n",
  "visits": 666,
  "published": "2015-02-24T15:00:00+00:00",
  "authorName": "",
  "category_id": 3,
  "image_uid": "2015/02/24/12/58/53/422/file",
  "created_at": "2015-02-20T20:58:18+00:00",
  "updated_at": "2015-03-02T19:30:41+00:00",
  "markdown": "In a profession that is largely subjective and inspired, such as design, adopting a process can provide a framework for creation that elevates the quality of your work. Though a process leads us through similar steps for each project, it keeps our work fresh and exciting as we never know what we will uncover and the result is different each time. \r\n\r\nEven after 15 years as a designer, my team and I begin each project wondering 'how in the world are we going to solve this client’s problem?’ That’s because starting can be the greatest challenge in the creative process. Having a defined and flexible process provides a clear beginning, and a framework for each step after. Though our clients and the problems they have may be wildly different from project to project, our flexible process keeps us focused and helps us to be more objective about our work.\r\n\r\nIn this video series capturing my talk at [AIGA Raleigh](https://raleigh.aiga.org/) I go into detail about our design process. This is part one in a four part video series. I hope you enjoy it and are able to take away some knowledge that you can apply to your own work. \r\n\r\n<iframe width=\"853\" height=\"480\" src=\"https://www.youtube.com/embed/f9zaGJRsMvc?rel=0\" frameborder=\"0\" allowfullscreen></iframe>",
  "image_alt_text": "smashing boxes design process discovery",
  "featured": false,
  "database_id": 377,
  "category": {
    "type": "Entry",
    "id": "category_3"
  },
  "tags": [
    {
      "type": "tag",
      "id": "tag_8"
    },
    {
      "type": "tag",
      "id": "tag_14"
    },
    {
      "type": "tag",
      "id": "tag_8"
    },
    {
      "type": "tag",
      "id": "tag_14"
    }
  ],
  "authors": [
    {
      "type": "employee",
      "id": "employee_46"
    },
    {
      "type": "employee",
      "id": "employee_46"
    }
  ]
}