{
  "id": "post_351",
  "title": "Growth Engineering 101: Google Analytics Essentials",
  "summary": "As a product owner, it's important to know how to utilize data you collect from your web analytics tools to grow your business and product.",
  "body": "<p>\r\n\tAs a product owner, you have probably questioned how to use the data that you collect from your web analytics tools to grow your business.</p><p>\r\n\tWeb analytics give great insights into how users interact with your site or content, but there are limitations to how much the default settings will tell you about your site. If you want to get higher level insights, you will have to go to your web developer and have them code something for you.</p><p>\r\n\tThis series of articles will give you some ideas on how to make the shift from passively analyzing to actively growing your users. This might be as simple as changing the setup of your analytics account or implementing a few additional tools. Let’s start from the beginning with web analytics.</p><p>\r\n\tThe majority of people and businesses use \r\n\t<a href=\"http://www.google.com/analytics/\" target=\"_blank\">Google Analytics</a> as their primary web analytics tool. It is a robust, free tool that has quite a lot to offer. After you have it set up on your site you can start collecting data. The data is compiled in different reports as follows:</p><ul>\r\n\t<li>Audience Reports- Reports that specify who is looking at your site and where they are viewing from\r\n\t<ul>\r\n\t\t<li>Geography</li>\t\t<li>Device Type </li>\t\t<li>Browser Type</li>\t\t<li>New or Returning</li>\t</ul></li>\t<li>Behavior Reports - Reports that indicate the frequency of views, how long the viewer stays on the page and what they look for\r\n\t<ul>\r\n\t\t<li>Behavior Flows</li>\t\t<li>Site Content </li>\t\t<li>Site Speed</li>\t</ul></li>\t<li>Acquisitions Reports - Reports that tell the product owner where site visitors are coming from and what actions they take while on the site\r\n\t<ul>\r\n\t\t<li>Channels</li>\t\t<li>All Traffic</li>\t\t<li>All Referrals </li>\t</ul></li>\t<li>Real Time Reports - Reports that allow you to monitor activity <em>as</em> it happens\r\n<ul>\r\n\t\t<li>Overview</li>\t\t<li>Locations</li>\t\t<li>Traffic Sources</li>\t\t<li>Content</li>\t\t<li>Events</li>\t\t<li>Conversions</li>\t</ul></li></ul><p>\r\n\tYou can learn a lot from just these settings, but there are more sophisticated options/reports in Google Analytics which will give you greater insights into to your site data. However, these reports will require a more advanced setup to actually gather data you need. For example, if you have an e-commerce site, you will need to collect data that is specific to your purchase funnel. For more complex steps like this you may need to talk to your web developer or an analytics service provider to assist you (we’ll have more on e-commerce later in this series).</p><p>\r\n\tHere are some analytics tips that anyone with admin access to your Google Analytics can tackle that will allow you to better understand your users. Start by performing an audit of your setup to make sure it's correctly implemented. All of these can be performed in the admin portal of your account.</p><p>\r\n\t1. Check that the tracking code is in the head tag of your website. A simple test to check this is to visit the \r\n\t<strong>Real Time</strong> tab in Google Analytics Reporting while you are on the site to see if it shows that you are active on the site.\r\n\t</p><p>\t2. Our recommended Google Analytics account structure is to have an \r\n\t<strong>All Web Site Data </strong>view, a <strong>Filtered </strong>view, and a <strong>Test </strong>view. To create a view, navigate to <strong>Admin</strong> and “Create new view” under <strong>View</strong>:\r\n\t<img src=\"https://lh4.googleusercontent.com/6bBwPnOSY-EOzxdBEm8TutUF1kr4yjXwUYix-e8yYvXyhWAu6edw5Tw1jV6zSFYkV05nyiepaXZUJ93IVMpXyBteM63abta-FsoC_hD5QSa3VuHpy1nOMi0R8Tk592ktvw\" width=\"624px;\" height=\"189px;\" style=\"border-style: none; transform: rotate(0rad); -webkit-transform: rotate(0rad);\"></p><p>\r\n\tClearly name these views so that their content will be recognizable to anyone looking at your data. For example, “Company Name Filtered View”. Your newly created views will now be visible in the \r\n\t<strong>View</strong> dropdown:</p><p>\r\n\t<img src=\"https://lh4.googleusercontent.com/hQTXfOCBQazJymiEBB_p9FUuo4At1OQbgusbB0HMCxa8lu0cwI26MG_W9ow0CLT5xWXM69VyARK7NfYeeuEqRer1QzQq6OfB4hZEHh9g1gJcsRZBC3nJ4nPCjjQo3VMtHQ\" width=\"243px;\" height=\"328px;\" style=\"border-style: none; transform: rotate(0rad); -webkit-transform: rotate(0rad);\"></p><p>\r\n\tNote: If you make a new view you won’t see any data that was collected prior to when you created the view. Don't be alarmed. Unfortunately that is how it works if you didn’t create the views when you first installed Google Analytics.</p><p>\r\n\t3. Filter out your own IP address. You don’t want your sessions skewing your site data, but make sure you \r\n\t<strong>DO NOT</strong> add a filter to your <strong>All Web Site Data</strong> view. This filter should be added to your <strong>Filtered </strong>view or <strong>Test</strong> view. To create a filter, navigate to your <strong>Filtered</strong> view in the <strong>View</strong> drop down:</p><p>\r\n\t<img src=\"https://lh5.googleusercontent.com/GwQ6sfpHe2F_M_zH76-brQpy4NGxC8yAKLST61Qsx4Xgc7D0psnjFA9oeC8XVIHtMfxr4al2xOee94pnGz7nzvyP0lf38XccTmaoAzs2AbeGUOGH3F-JrIrm-DXgRmku7w\" width=\"237px;\" height=\"301px;\" style=\"border-style: none; transform: rotate(0rad); -webkit-transform: rotate(0rad);\"></p><p>\r\n\tOnce you select your\r\n\t<strong> Filtered </strong>view, navigate to <strong>Filters</strong> and click the “+ New Filter” button:</p><p>\r\n\t<img src=\"https://lh4.googleusercontent.com/BNEIVZxij5A9WZWq3yhk5TIzrjeTIB65BN9SdH87PWGfh1uiV6gt1ctKeEhh2f5-DWWbhdQ7XCAqdKxP3eW7mOarc6D2J0sXBCmLUhKI9BB7okruAZz31EQn7Vhoh_Oh0g\" width=\"624px;\" height=\"195px;\" style=\"border-style: none; transform: rotate(0rad); -webkit-transform: rotate(0rad);\"></p><p>\r\n\tThis opens the “add filter” page where you can name your filter and select the filter parameters:</p><p>\r\n\t<img src=\"https://lh5.googleusercontent.com/7_5tMXkPpBrbCvPR5gq_PCbqXGObDfbPRxCTz_KvEqU5oPW5ic0usGbfT4e_9GddpInCM-AQSqstYnCDkl6zLaPD2yQYv06ik1Tl0ij76Hl-VIrAVUALdB5rSVmypbZAag\" width=\"624px;\" height=\"279px;\" style=\"border-style: none; transform: rotate(0rad); -webkit-transform: rotate(0rad);\"></p><p>\r\n\tFilters do not apply to historical data, but from now on you won’t be tracked on your own site and luckily, you still have your untouched \r\n\t<strong>All Website Data</strong> view. Best practice is to first add the filter to your <strong>Test</strong> view to check if it is filtering your data as expected. If so, then you can add the filter to your <strong>Filtered </strong>view.</p><p>\r\n\t4. If you have a search bar on your site, make sure you are tracking what people are searching for. This is NOT Keyword tracking, which Google has reduced the usability of with most showing up as (not provided). However if your site has a search bar on it, you can see what terms users are searching for. This gives you insights into what your users are coming to your site for and what they expect to find on your site, which can aid in what you should use in your content to improve SEO.</p><p>\r\n\tTo set up\r\n\t<strong> Site Search Tracking</strong>, we recommend navigating to <strong>View Settings </strong>in your <strong>Test</strong> view. Scroll down to find “Site Search Settings” and switch “on” site search tracking. In the<strong> Query Parameter</strong> field, you must enter the word or character that defines the internal search term. For example, <a href=\"http://smashingboxes.com/ideas/tips-for-passing-the-2014-google-analytics-exam%20\">smashingboxes.com/?s=pass+google+analytics+exam</a>, the query parameter is the “s”.</p><p>\r\n\t<img src=\"https://lh6.googleusercontent.com/l53Q5mbYrxaPFQIHS8HIlZeixZdJh23c_6ssYetNQ7KebYMf2fN3eJqexMEWo1jOxLwzAAMPwO_S-5X_kubEhuQfbIXK43bmoyyNkBEplky-fjyZjUoPc9-W7PYrg1Gi9g\" width=\"320px;\" height=\"310px;\" style=\"border-style: none; transform: rotate(0rad); -webkit-transform: rotate(0rad);\"></p><p>\r\n\tClick save and remember that this only turns on site search tracking for the selected view. Once you check that it is working for the \r\n\t<strong>Test</strong> view, feel free to add it to any view.</p><p>\r\n\tThese are simple implementations that will give you more accurate user data and information on how users navigate through your site. Growth Engineering focuses on growing and retaining users and these are great configurations to get you started.</p><p>Next up, check out <a href=\"http://smashingboxes.com/ideas/button-tracking-using-google-tag-manager\">this tutorial</a> on button tracking using Google Tag Manager. </p>",
  "slug": "growth-engineering-101-google-analytics-essentials",
  "slug_history": "--- []\n",
  "visits": 1175,
  "published": "2014-10-01T00:29:54+00:00",
  "authorName": "Alicia Midland",
  "category_id": 2,
  "image_uid": "2014/09/30/11/34/19/516/file",
  "created_at": "2014-09-30T15:36:06+00:00",
  "updated_at": "2015-06-15T19:13:33+00:00",
  "markdown": "",
  "image_alt_text": "",
  "featured": false,
  "database_id": 351,
  "category": {
    "type": "Entry",
    "id": "category_2"
  },
  "tags": [
    {
      "type": "tag",
      "id": "tag_32"
    },
    {
      "type": "tag",
      "id": "tag_32"
    }
  ],
  "authors": [
    {
      "type": "employee",
      "id": "employee_38"
    },
    {
      "type": "employee",
      "id": "employee_38"
    }
  ]
}