{
  "id": "post_298",
  "title": "Heroku vs. AWS Revisited",
  "summary": "When I wrote about Heroku and Amazon Web Services a few months ago it seemed both services were equally worthwhile in many respects. My rule of thumb was: small app–Heroku; large app–Amazon. Since then a few events have caused me to reevaluate my position. Heroku’s customer non-service Recently, Heroku revealed a new site interface. In…",
  "body": "<p>\r\n\tWhen I wrote about <a href=\"http://www.smashingboxes.com/heroku-vs-amazon-web-services/\">Heroku and Amazon Web Services</a> a few months ago it seemed both services were equally worthwhile in many respects. My rule of thumb was: small app–Heroku; large app–Amazon. Since then a few events have caused me to reevaluate my position.</p><h3>Heroku’s customer non-service</h3><p>\r\n\tRecently, Heroku revealed a new site interface. In the past if you needed something you could open up a free support ticket. Now the only options for free support are the docs or <a title=\"Stack Overflow\" href=\"http://stackoverflow.com/questions/tagged/heroku\">Stack Overflow</a>. Yes, they actually link to Stack Overflow on their <a title=\"Help page\" href=\"https://help.heroku.com/\">new help page</a>. Ticket History is still visible, but there is no way to open up a new ticket.</p><p>\r\n\tGranted, AWS doesn’t provide much more than Heroku. But AWS does have a free forum where Amazon employees reply to users’ support questions.</p><p>\r\n\tI recently had an issue related to billing with Heroku. Heroku offered a beta period for their new database stack allowing developers to try out their new databases free of charge. I added a couple for testing believing they would remain free until their general release in August. Heroku’s&nbsp;<a title=\"blog post\" href=\"https://postgres.heroku.com/blog/past/2012/5/3/crane_the_new_50_per_month_production_database_/\">blog post</a> indicated they would notify users prior to billing them.</p><p>\r\n\t<a href=\"http://sbblog.s3.amazonaws.com/wp-content/uploads/2012/10/Selection_032.png\"><img class=\"alignright size-medium wp-image-1600\" title=\"Heroku July newsletter\" src=\"http://sbblog.s3.amazonaws.com/wp-content/uploads/2012/10/Selection_032-300x169.png\" alt=\"Heroku July newsletter\" width=\"300\" height=\"169\"></a></p><p>\r\n\tI assumed there would be an additional step needed to opt-in before being billed, but this was not the case. The only notice I found was a note in one of their email newsletters (which I never read). The notice was one sentence in the middle of the email (underlined in red).</p><p>\r\n\tNearly two months later, I discovered we had accumulated several hundred dollars in charges for databases that we weren’t even using. I tried writing them back at their billing@heroku.com account, but it’s been three weeks and I have not received a response.</p><h3>How AWS would have prevented this</h3><p>\r\n\tAround the same time that I noticed the excessive Heroku charges, I logged into our AWS account. What a pleasant surprise to be greeted with a message telling me how to set up notifications for estimated cost triggers. (I already use Amazon’s <a title=\"SNS\" href=\"http://aws.amazon.com/sns/\">Simple Notification Service</a> for CPU usage alerts on our EC2 instances.) The alerts are easy to configure due to an intuitive web interface. After establishing a preferred trigger, you can review the past few days’ activity which shows when the trigger would have activated. I immediately set up cost alerts for my AWS account. AWS was nice enough to place the cost alert feature in a prominent place where everyone should see it. Heroku may have a similar feature, but I have not found it.</p><p>\r\n\tThe billing issue is a small concern, but it illustrates how mature AWS has become while Heroku’s new interface is somewhat of a regression. In the future I will explore how to get up and running on AWS, and how to leverage Ruby gems to achieve similar functionality to that offered by Heroku.</p><p><em style=\"background-color: initial;\">Smashing Boxes is a web and mobile app development company know for creating a lasting experience through bold design and disrupting the status quo. We are entrepreneurs and craftsmen first, and a digital creative agency second. Inspired by our visionary clients, we transform ideas into innovative web and mobile applications. </em><a href=\"http://smashingboxes.com/work\" style=\"background-color: initial;\">Take a look at our work.</a></p>",
  "slug": "heroku-vs-aws-revisited",
  "slug_history": "--- []\n",
  "visits": 10327,
  "published": "2012-10-11T04:00:00+00:00",
  "authorName": "Reed Law",
  "category_id": 1,
  "image_uid": "2014/08/01/13/14/19/660/file",
  "created_at": "2014-06-05T18:24:46+00:00",
  "updated_at": "2014-08-01T17:14:21+00:00",
  "markdown": null,
  "image_alt_text": null,
  "featured": false,
  "database_id": 298,
  "category": {
    "type": "Entry",
    "id": "category_1"
  },
  "authors": [
    {
      "type": "employee",
      "id": "employee_18"
    },
    {
      "type": "employee",
      "id": "employee_18"
    }
  ]
}