{
  "id": "post_260",
  "title": "The Four P’s of Entrepreneurship",
  "summary": "Marketing classrooms have long discussed the four P’s of marketing: product, promotion, position, and price. I realized it was high time that entrepreneurship got the same love in the form of P’s, through a simple, formulaic way of discussing what it takes to be an entrepreneur. The point of simple and easy…",
  "body": "<p dir=\"ltr\" style=\"text-align: left;\">\r\n\tMarketing classrooms have long discussed the \r\n\t<a href=\"http://en.wikipedia.org/wiki/Marketing_mix\">four P’s</a> of marketing: <strong>product</strong>, <strong>promotion</strong>, <strong>position</strong>, and <strong>price</strong>.</p><p dir=\"ltr\">\r\n\tI realized it was high time that entrepreneurship got the same love in the form of P’s, through a simple, formulaic way of discussing what it takes to be an entrepreneur.</p><p dir=\"ltr\">\r\n\tThe point of any simple and easy-to-remember formula isn’t to be the single most important element of a given topic, be it marketing or entrepreneurship, it’s just to instill some basic principles. The four P’s of entrepreneurship, as I see them, are \r\n\t<strong>passion</strong>, <strong>persistence</strong>, <strong>perseverance</strong>, and <strong>preparation</strong>.</p><p dir=\"ltr\" style=\"text-align: center;\">\r\n\t<a href=\"http://sbblog.s3.amazonaws.com/wp-content/uploads/2013/10/blogimage.png\"><img class=\"size-medium wp-image-4003 \" alt=\"Four P's\" src=\"http://sbblog.s3.amazonaws.com/wp-content/uploads/2013/10/blogimage-300x300.png\" width=\"300\" height=\"300\"></a></p><p style=\"text-align: center;\">\r\n\tThe four P’s of entrepreneurship.</p><p class=\"wp-caption-text\">\r\n\tAs a little bit of background: this past week, I was fortunate enough to take part in two panel discussions with college students studying the field of entrepreneurship. \r\n\t<a href=\"http://www.kenan-flagler.unc.edu/faculty/directory/strategy-and-entrepreneurship/ted-zoller\">Ted Zoller’s</a> <a href=\"http://www.kenan-flagler.unc.edu/programs/undergraduate-business/global-programs/globe\">Globe program at UNC</a> visited the American Underground campus on Wednesday, and <a href=\"http://www.nccu.edu\">NCCU </a>hosted a panel on entrepreneurship as part of their professional development day. We had the opportunity to talk about our journeys, ups and downs, lessons learned, and more. A common question that arises in any discussion about entrepreneurship in general, is “what does it take to be an entrepreneur”? I have answered this question many times over, as had my fellow panelists, and I realized there was a common thread, which I have named the Four P’s of entrepreneurship.</p><h5><strong>Passion</strong></h5><p>You have to love what you are doing. It’s not a decision based on metrics such as risk / reward. It’s not a job. It’s your life. You have to be so passionate about your startup or small business that it oozes out of you and makes people want to work with you and for you. Passion is what gives you the drive and motivation to see through the bumps in the road to the higher goal, helping you continue working toward that goal, even when it seems hopeless.</p><p dir=\"ltr\">\r\n\tTobias Rose, of \r\n\t<a href=\"http://www.komplekscreative.com\">Komplex Creative</a>, really dove deep into this P, noting that passion is also how you differentiate yourself, through your passion for the work you are producing. They are a company similar to ours, and it’s great to hear that we share the same values.</p><h5><strong>Persistence</strong></h5><p>– As a startup, people will NOT be knocking down your door to hand you money for your product or service, or invest in your startup. <a href=\"http://www.shoeboxed.com\">Tobi Walters</a> at Shoeboxed discussed the fact that he had no fewer than 70 meetings pitching investors to raise financing. What if he stopped at 69? He, like all entrepreneurs, had a goal or a task, and “no” was not an option. In my situation, I get “NO” all of the time. We do not win every project that we pursue, and I cannot let that get me down, or get in the way of ultimate dream I am pursuing. Keep following up, keep showing up, keep fighting…whether it’s for a coffee meeting with a potential mentor, raising money, or winning business, it’s hard, so be ready.</p><h5><strong>Perseverance</strong></h5><p>While persistence, in my opinion, has a more tactical and operational implication (don’t take “no” for an answer), perseverance speaks to the emotional strength that is needed to be an entrepreneur. Think about having no money in the bank and two weeks until the next set of bills are due (be it payroll if you have staff, or personal bills like rent, car payment). You can persist through yeses and noes and not let it impact your being, but when you’re faced with pending doom around every corner, that’s a much deeper issue. As an entrepreneur, your “business” issues – such as a customer going out of business and not paying an invoice, or an investor deciding to pass on your startup — are also personal issues — you are broke, you can’t make payroll, you can’t pay rent,  you’re a failure. Weathering these storms takes a strong character, a vision for the future, and the passion and persistence to see it through regardless of the ups and downs.</p><h5><strong>Preparation</strong></h5><p>There are three ways to look at preparation: personal planning, business planning, and working hard. I don’t focus much on business plans, because I think they’re a waste of time. On the personal front, be prepared emotionally and financially. This will cost more than you think, and it will take longer than you think to make money. The typical rule of thumb is that “it” (your project, your startup, etc..) will take twice as long and cost 3 times as much. That is common knowledge among entrepreneurs, and was reaffirmed by my fellow panelist Jay Bigelow of <a href=\"http://www.cednc.org\">CEDNC</a>, who’s been there and done that several times over. While it’s oversimplified, do your best to not be cutting it so close that you can’t adjust when that does inevitably arise. Working hard is the other form of preparation that is key to entrepreneurial success. You have passion, you persist, and you persevere. When you let nothing get in your way of success, and you continue to build, sell, improve, innovate, and press forward, you are preparing yourself for success. When you read a success story on <a href=\"http://www.techcrunch.com\">TechCrunch</a>, or hear about the person who was on the brink of bankruptcy only to land their biggest account and turn it all around, remember that they were working hard the entire time and this is the result that they were preparing themselves for.</p><p dir=\"ltr\">\r\n\tIn closing, I hope this message reaches all aspiring entrepreneurs. My goal is to give some baseline context for what it takes to be successful. Once you are comfortable with these four core principles, then it’s time to get to work!</p><p><em>Cover photo by </em><a href=\"https://www.flickr.com/photos/marlenek/\"><em>Daniele Marlenek</em></a><br></p>",
  "slug": "the-four-ps-of-entrepreneurship",
  "slug_history": "--- []\n",
  "visits": 2560,
  "published": "2013-10-02T08:00:00+00:00",
  "authorName": "Nick Jordan",
  "category_id": 2,
  "image_uid": "2014/07/28/17/15/53/270/file",
  "created_at": "2014-06-05T18:22:18+00:00",
  "updated_at": "2015-08-03T16:13:28+00:00",
  "markdown": "",
  "image_alt_text": "",
  "featured": false,
  "database_id": 260,
  "category": {
    "type": "Entry",
    "id": "category_2"
  },
  "authors": [
    {
      "type": "employee",
      "id": "employee_21"
    },
    {
      "type": "employee",
      "id": "employee_21"
    }
  ]
}