{
  "id": "post_290",
  "title": "Choosing Email Services",
  "summary": "Email is essential to most businesses. It must always be available, filtered from spam, and fast. Beyond those basic requirements, there are many options available. The first thing most people envision when they think of email is the client, or user-facing application for checking email. Email clients Most people have their favorite way to access…",
  "body": "<p>\r\n\tEmail is essential to most businesses. It must always be available, filtered from spam, and fast. Beyond those basic requirements, there are many options available. The first thing most people envision when they think of email is the client, or user-facing application for checking email.</p><h3>Email clients</h3><p>\r\n\tMost people have their favorite way to access email, which may dictate the client from the start. If you prefer Gmail for example, <a title=\"Google Apps\" href=\"http://www.google.com/enterprise/apps/business/\" target=\"_blank\">Google Apps for Business</a> has always been a good choice and was free for small organizations until recently. <a title=\"Google Blog\" href=\"http://googleenterprise.blogspot.com/2012/12/changes-to-google-apps-for-businesses.html\" target=\"_blank\">Google&nbsp;Apps just switched</a> to a paid-only business model which may be a good thing for those who want quality service above all. Their service is now $50 per user, per year and comes with 5GB of storage, which is not a bad deal considering the importance of email. If having the best email experience in a web interface is your concern, Google is the leader.</p><p id=\"attachment_2218\" style=\"width: 310px; text-align: center;\" class=\"wp-caption aligncenter\"><img class=\"size-medium wp-image-2218 \" alt=\"Gmail\" src=\"http://sbblog.s3.amazonaws.com/wp-content/uploads/2013/01/gmail-300x191.png\" width=\"300\" height=\"191\"></p><p class=\"wp-caption-text\" style=\"text-align: center;\">\r\n\tGoogle Apps</p><h3>Web or Desktop</h3><p>\r\n\tIf Google rules the web client arena, what other choices are worth considering? Fortunately,there are a multitude of other web clients including a few&nbsp;<a title=\"Roundcube\" href=\"http://roundcube.net/\" target=\"_blank\">open</a> source <a title=\"Zimbra\" href=\"http://www.zimbra.com/\" target=\"_blank\">choices</a>. Unfortunately, none of the alternatives have proven very competitive with Google, which provides both the email service and the web client. Additionally, Google allows plenty of integration with services such as documents, Google+, and of course the Android mobile OS.</p><p>\r\n\tIf access from a web browser is not so important, there are some excellent desktop clients. <a title=\"Thunderbird\" href=\"http://www.mozilla.org/en-US/thunderbird/\" target=\"_blank\">Thunderbird</a> is a great open source choice available on Windows, Linux and Mac OS. Windows users may be used to Outlook and Mac users may choose the built-in <a title=\"Mail app\" href=\"http://www.apple.com/support/mail/\" target=\"_blank\">Mail</a> app. All of these web and desktop clients except Gmail will require an email server.</p><p style=\"text-align: center;\"><img class=\"size-medium wp-image-2221 \" alt=\"Thunderbird\" src=\"http://sbblog.s3.amazonaws.com/wp-content/uploads/2013/01/thunderbird-300x211.png\" width=\"300\" height=\"211\" style=\"background-color: initial;\"></p><p class=\"wp-caption-text\" style=\"text-align: center;\">\r\n\tThunderbird</p><h3>Email servers</h3><p>\r\n\tDespite its humble appearance, email is a complex, decentralized Internet protocol that requires more effort than most businesses are willing to put in to maintain their own private servers. Often, the only method for small to medium-sized businesses to find an email provider is similar to how an individual would find an Internet service provider (ISP) for access to the Web. Other than Google Apps, an email service that includes a web client, what choices are there? Well, there are many free or inexpensive options, most of which are traditional email hosts such as Yahoo!, Gmail, Hotmail, or even your ISP’s included email service. These options are usually not suitable for businesses that care about reliability and premium support options. For more professional service there is <a title=\"FastMail\" href=\"https://www.fastmail.fm/\" target=\"_blank\">FastMail</a>, <a title=\"Rackspace email\" href=\"http://www.rackspace.com/apps/email_hosting/rackspace_email/\" target=\"_blank\">Rackspace Email</a>, and again, Google Apps. If you are really adventurous, you could look into hosting your own email service using <a title=\"Postfix\" href=\"http://www.postfix.org/\" target=\"_blank\">one</a> of the <a title=\"Sendmail\" href=\"http://www.sendmail.com/sm/open_source/\" target=\"_blank\">popular</a> open source <a title=\"qmail\" href=\"http://www.qmail.org/\" target=\"_blank\">servers</a>. But having an email client and server is still not the end of the story for many business.</p><h3>Email-enabled apps</h3><p>\r\n\tOk, so you set up your business email using your favorite client. But now you want your web or mobile application to send emails to users when they forget their password or to notify them about a new feature. Can’t you just use the email server you’re already paying for? Unfortunately, typical email services don’t interface well with web application frameworks such as Ruby on Rails. The reason is that Rails servers are busy serving up web pages or mobile app calls. At the very least, a Rails app would need to create a background job to handle the email delivery. But what if the job fails? Rails does not automatically resend failed messages. So you’re suddenly talking about building a lot of email-related infrastructure around your web app, just to handle email delivery. Luckily, there are great solutions out there for email delivery.</p><p>\r\n\t<a title=\"Sendgrid\" href=\"http://sendgrid.com/\" target=\"_blank\">Sendgrid</a>, <a title=\"Mailgun\" href=\"http://www.mailgun.com/\" target=\"_blank\">Mailgun</a>, <a title=\"Postmarkapp\" href=\"http://postmarkapp.com/\" target=\"_blank\">Postmarkapp</a>, and <a title=\"AWS SES\" href=\"http://aws.amazon.com/ses/\" target=\"_blank\">Amazon Simple Email Service</a> are all notable email delivery services. These services complete much of the heavy lifting involved with reliable email delivery for you. Their capabilities include things like email signing, making sure server IP addresses are <a href=\"http://en.wikipedia.org/wiki/Whitelist#Email_whitelists\" target=\"_blank\">white-listed</a> by spam filters, and monitoring deliveries.</p><h3>Sendgrid</h3><p>\r\n\tSendgrid has been around the longest of the bunch. Founded way back in 2009 it delivers email for large sites such as Quora. Currently, $80 per month with Sendgrid secures a package that includes custom DKIM signing (allowing you to send <a href=\"http://en.wikipedia.org/wiki/DomainKeys_Identified_Mail\" target=\"_blank\">verified emails</a> from your domain). It has an <a href=\"http://en.wikipedia.org/wiki/Simple_Mail_Transfer_Protocol\" target=\"_blank\">SMTP</a> interface for traditional clients as well as a Web API for modern apps. Sendgrid also has a few unique features like delivery tracking and reputation monitoring.</p><h3>Mailgun</h3><p>\r\n\tMailgun provides a similar service to Sendgrid for $59 per month. Sendgrid’s $80 package advertises multiple IP addresses while Mailgun’s $59 plan states it uses dedicated IP addresses. It’s hard to say which is better and both companies seem to have good domain experience in the field of email delivery. Smashing Boxes has used both Sendgrid and Mailgun for projects and I would say they are quite comparable, although I slightly prefer Mailgun because it seems more developer friendly. Specifically, Mailgun’s documentation has examples in multiple programming languages for all of their API.</p><h3>Amazon Simple Email Service</h3><p>\r\n\tA relative newcomer, Amazon Simple Email Service (SES) was introduced at the beginning of 2011. It is strictly a pay-as-you-go service. The prices are affordable at $0.10 per thousand messages and $0.12 per gigabyte of transfer after the first gigabyte. That means that for most business, SES will be significantly cheaper than Sendgrid or Mailgun. However, SES is as it’s name implies, simple. There are no extra features like delivery, click, or open tracking. It’s just a bare-bones delivery service and the documentation is not as stellar as Mailgun’s. But if delivery cost is your overarching concern, then SES may be the best choice.</p><h3>Receiving email</h3><p>\r\n\tWhat if your web application not only needs to send email, but also needs to be able to receive email replies and parse them? Both Sendgrid and Mailgun support this feature. Amazon SES does not. Receiving email and automatically parsing it to provide meaningful data to a web app is not trivial and will take more development time. But beware, if you think your app needs both to send and receive email, you may be succumbing to <a title=\"Zawinski's Law\" href=\"http://en.wikipedia.org/wiki/Jamie_Zawinski#Zawinski.27s_law_of_software_envelopment\" target=\"_blank\">Zawinsky’s Law</a>.</p><p>\r\n\tSometimes email should just be left out of a web application in favor of a better application design that sufficiently models workflows to the point that outside communication is largely unnecessary.</p><h3>Conclusion</h3><p>\r\n\tChoosing an email client, server, and delivery service is crucial to many businesses’ online presence. Without reliable email services you or your users may be left out of the loop when it comes to workflows that involve email notification. Which services you choose depends largely on your organization’s users and the requirements of your application. Once again Amazon Web Services is a low-cost leader and a good choice if you want to keep most of your services under one account. Pair that with Google Apps for Business and you will have a complete email solution for your organization.</p><p><em>Smashing Boxes is a web and mobile app development company know for creating a lasting experience through bold design and disrupting the status quo. We are entrepreneurs and craftsmen first, and a digital creative agency second. Inspired by our visionary clients, we transform ideas into innovative web and mobile applications. </em><a href=\"http://smashingboxes.com/work\">Take a look at our work.</a></p>",
  "slug": "choosing-email-services",
  "slug_history": "--- []\n",
  "visits": 2021,
  "published": "2013-01-21T05:00:00+00:00",
  "authorName": "Reed Law",
  "category_id": 1,
  "image_uid": "2014/07/21/12/55/58/221/file",
  "created_at": "2014-06-05T18:24:32+00:00",
  "updated_at": "2014-07-31T19:58:35+00:00",
  "markdown": null,
  "image_alt_text": null,
  "featured": false,
  "database_id": 290,
  "category": {
    "type": "Entry",
    "id": "category_1"
  },
  "authors": [
    {
      "type": "employee",
      "id": "employee_18"
    },
    {
      "type": "employee",
      "id": "employee_18"
    }
  ]
}