{
  "id": "post_246",
  "title": "Introduction to the MEAN Stack [video]",
  "summary": "At Smashing Boxes, we encourage our developers to teach the rest of our team about trending technologies, innovative concepts, and new workflows that they are interested in or testing out. Twice a month, our developers all gather together at lunch to learn about a new topic, we called them Lunch and Learns (catchy right?). We…",
  "body": "<p>\r\n\tAt Smashing Boxes, we encourage our developers to teach the rest of our team about trending technologies, innovative concepts, and new workflows that they are interested in or testing out. Twice a month, our developers all gather together at lunch to learn about a new topic, we called them Lunch and Learns (catchy right?). We wanted to show the world how awesome our developers and share their knowledge with you by making these Lunch and Learns G+ Hangouts on Air.</p><p>\r\n\tYesterday we had one of our front-end developers, Biko Tushinde, discuss a new workflow that uses JavaScript to make web applications quickly. The MEAN stack (MongoDB, ExpressJS, AngularJS and Node.js) &nbsp;has been gaining popularity with the hackathon crowd for some time now, owing to the flexibility and ease of development that an all-Javascript stack brings. In this talk Biko takes a look at one possible MEAN configuration that uses Grunt to compile static assets and manage the build process.</p><p>\r\n\tThe embedded YouTube video contains Biko’s demonstration of the MEAN stack. Watch the video to learn more about the emerging workflow and if you have any questions for Biko, feel free to leave him a comment below.</p><h3>\r\nMEAN Stack:\r\n</h3><p>\r\n\t<a href=\"http://www.mongodb.org/\">MongoDB</a> is a database that uses JSON-style documents to represent data, making it well-suited for use with Javascript.</p><p>\r\n\t<a href=\"http://expressjs.com/\">ExpressJS</a> is a web application framework that gives a lot of helpful components and modules for the common task associated with building a website.</p><p>\r\n\t<a href=\"http://angularjs.org/\">AngularJS</a> is a frontend framework by Google for architecting complex Javascript client-side applications with modular code and data-binding UI.</p><p>\r\n\t<a href=\"http://nodejs.org/\">Node.js</a> is a concurrent Javascript environment (based off of V8) for building scalable Web applications.</p><h3>\r\nTools:\r\n</h3><p>\r\n\t<a href=\"http://bower.io/\">NPM</a> – Node Package Manager, used to download and install Node modules per project or globally</p><p>\r\n\t<a href=\"http://bower.io/\">Bower</a> – front-end package manager made by Twitter. Installs and manages versions for front-end libraries like Angular, jQuery and Bootstrap.</p><p>\r\n\t<a href=\"http://gruntjs.com/\">Grunt</a> – a Javascript task runner. Extensible via a large community of Grunt plugins.</p><h3>\r\nPrecompiled Assets\r\n</h3><p>\r\n\tThese are optional depending on your development process. Node has support for various compiled assets but in this demo they are being compiled by Grunt and served statically.</p><p>\r\n\t<a href=\"http://coffeescript.org/\">Coffeescript</a> – compiles to Javascript</p><p>\r\n\t<a href=\"http://learnboost.github.io/stylus/\">Stylus</a> – compiles to CSS</p><p>\r\n\t<a href=\"http://jade-lang.com/\">Jade</a> – compiles to HTML</p><p align=\"center\"></p><iframe src=\"//www.youtube.com/embed/Bn22aK1J9PE?enablejsapi=1\" height=\"315\" width=\"560\" allowfullscreen=\"\" frameborder=\"0\">\r\n</iframe><p>\r\n\tTo download the repo visit :&nbsp;\r\n\t<a href=\"https://github.com/btushinde/mean-stack-demo\">https://github.<wbr>com/btushinde/m<wbr>ean-stack-demo</a></p><p>\r\n\t<em>Smashing Boxes is a web and mobile app development company know for creating a lasting experience through bold design and disrupting the status quo. We are entrepreneurs and craftsmen first, and a digital creative agency second. Inspired by our visionary clients, we transform ideas into innovative web and mobile applications. </em><a href=\"http://smashingboxes.com/work\">Take a look at our work.</a></p><p>\r\n\t<em>Cover photo by&nbsp;</em><a href=\"https://www.flickr.com/photos/hedvigs/\" style=\"background-color: initial;\"><em>Hedvigs</em></a></p>",
  "slug": "introduction-to-the-mean-stack-video",
  "slug_history": "--- []\n",
  "visits": 8608,
  "published": "2013-11-14T05:00:00+00:00",
  "authorName": "Biko Tushinde",
  "category_id": 1,
  "image_uid": "2014/07/29/12/01/47/526/file",
  "created_at": "2014-06-05T18:21:48+00:00",
  "updated_at": "2014-08-22T17:56:24+00:00",
  "markdown": null,
  "image_alt_text": null,
  "featured": false,
  "database_id": 246,
  "category": {
    "type": "Entry",
    "id": "category_1"
  },
  "authors": [
    {
      "type": "employee",
      "id": "employee_22"
    },
    {
      "type": "employee",
      "id": "employee_22"
    }
  ]
}