{
  "id": "post_291",
  "title": "Responsive Web Design",
  "summary": "or You Know, Just Web Design “The web is responsive on its own—by default. It’s us that’s been breaking it all these years by placing content in fixed-width containers.” — Viljami S. (@viljamis) December 1, 2012 Welcoming  a new  year is as good a time as any for reflection, and there are few things on…",
  "body": "<h3>or You Know, Just Web Design</h3><blockquote class=\"twitter-tweet\" lang=\"en\">\r\n\t\r\n<p>\r\n\t\t“The web is responsive on its own&mdash;by default. It's us that's been breaking it all these years by placing content in fixed-width containers.”\r\n\t</p><p>\r\n\t\t&mdash; Viljami S. (@viljamis) <a href=\"https://twitter.com/viljamis/statuses/274949862620004352\">December 1, 2012</a>\r\n\t</p></blockquote><p>\r\n\tWelcoming &nbsp;a new &nbsp;year is as good a time as any for reflection, and there are few things on the Web more deserving of thoughtful contemplation than Responsive Web Design (RWD). Rivaled only by HTML5 in terms of buzzword status and pedestal placement, our mysterious stranger tore down most of the walls that \r\n\t<code>width: 960px;</code> built.</p><p>\r\n\tIn the resulting excitement, some developers hailed RWD as the saviour of us all, while others tried it and swore it off as a time-sink. Still others are waiting for RWD to blow over so we can get back to making websites.&nbsp;Additionally, device makers are coming to the same realization as everyone else &mdash; we are no longer constrained to an area the size of a sheet of paper. Amidst all the fuss, I noticed plenty of confusion about it at all levels.</p><h3>What Responsive Is.</h3><p>\r\n\tRWD is the idea and methodology behind creating websites that respond to the user’s environment and behaviors. Screen size, device orientation, and resolution all factor into how the content is displayed to the user. The use of media queries, fluid grids, and flexible media all work together to provide an optimal viewing experience. Rather than multiple codebases for each target screen size, a single codebase serves all users.</p><p>\r\n\tMany have \r\n\t<a href=\"http://www.smashingmagazine.com/responsive-web-design-guidelines-tutorials/#a2\" target=\"_blank\">defined</a>, <a href=\"http://bradfrostweb.com/blog/web/responsive-web-design-missing-the-point/\" target=\"_blank\">refined</a> and <a href=\"http://www.quora.com/Responsive-Web-Design/What-is-responsive-design\" target=\"_blank\">enhanced</a> responsive’s basic definition, but the following is all we really need to understand the approach. Media queries, fluid grids, and flexible media aren’t just the trappings of a responsive website, they are the core techniques of the practice. Media queries allow the application of different CSS depending on screen dimensions and orientation. Fluid grids structure the site design around ratios rather than fixed values (i.e. 960px) and allow sites to conform to different screen sizes. Media assets adapt to device sizes allowing users a more complete experience regardless of how they access the site.</p><p>\r\n\tAnyone who built websites over the past year likely heard the above terms on a daily basis. However, responsive web design hasn’t been the topic\r\n\t<em>&nbsp;du jour</em> for all that long. To help illustrate the recency of the responsive web conversation, I’ve included Google Trends data on related terms below (embedded):</p><p>\r\n\tThe data doesn’t exactly represent any peer-reviewed research, but you can get a feel for how long the terms have been relevant. Around May 2010 queries for RWD and its constituent terms really start to lift. Ethan Marcotte published “\r\n\t<a href=\"http://www.alistapart.com/articles/responsive-web-design/\">Responsive Web Design</a>” on <em>A List Apart</em> around the same time, drawing parallels to the architectural concept of the same name.</p><p>\r\n\tWhat’s the point here? I can’t think of the last project I worked on where a responsive website wasn’t at least considered, if not actually included and launched. As a developer, responsive design is part of my day-to-day considerations, but the concept has only met wide discussion in the last few years and applied on a large scale for even less time. Yes, the Web moves fast but this isn’t just a new coding technique or browser feature &mdash; what&nbsp;we’re looking at&nbsp;is a fundamental shift in paradigms. An object’s width is one of its most basic properties, and the width of the Web is changing.</p><h3>What Responsive Isn’t.</h3><p>\r\n\tWith so many benefits to having a site that can dress for any occasion, why not just make that the norm and usher in a new, device-agnostic era on the Web? As an overly excited web developer, that was certainly my first impulse. However, responsive design isn’t “the solution” and depending on your situation it may not address any of your major problems.</p><p>\r\n\tIt really doesn’t matter what numbers you \r\n\t<a href=\"http://www.pcmag.com/article2/0,2817,2406331,00.asp\">look</a> <a href=\"http://www.thinkwithgoogle.com/insights/library/infographics/mobile-movement/\" target=\"_blank\">at</a>, mobile web use is up. Way up. All the way up. And traffic is only <a href=\"http://www.cisco.com/en/US/solutions/collateral/ns341/ns525/ns537/ns705/ns827/white_paper_c11-520862.html\">slated to increase</a>. When the majority of users were on desktop browsers we could set a page’s width to the narrowest of the target screen resolutions and be pretty safe. Now, a user might access your site not only on a smartphone, but from several different non-desktop devices <a href=\"http://services.google.com/fh/files/misc/multi-screen_infographic.pdf\">in the course of completing a single task</a>.</p><p>\r\n\tUsers’ changing usage patterns will impact any Web-bound project you start, therefore it’s increasingly important to analyze your target audience before deciding on what approach to take. If your site analytics show that most visits come from IE8 workstations, no level of responsiveness will improve those users’ experience. By the same token, if your primary demographic turns out to be tablet and mobile users, just adding a few media queries can vastly improve how your site renders on those devices.</p><p>\r\n\tThe key takeaway is that responsive design is a technique. It’s not a framework, or a toolkit, or a plugin or anything else but a method of problem solving. Similar to all problem-solving techniques, responsive isn’t suited for every problem. There are cases where having a separate mobile and desktop site is quicker, cheaper, or more effective than a responsive site that caters to every device. Smashing Magazine published an \r\n\t<a href=\"http://mobile.smashingmagazine.com/2012/08/22/separate-mobile-responsive-website-presidential-smackdown/\">in-depth comparison</a> of 2012′s presidential candidates’ mobile approaches (one responsive, one with a separate mobile site) to solving the same problem,&nbsp;that helps to underline the challenges inherent in both techniques.</p><h3>Where to now?</h3><p>\r\n\tRWD is arguably the most popular of several attempts to cope with and adapt to a changing problem space. Just think, if painters were only ever shown an 8.5×11-inch canvas, then suddenly given a nearly infinite number of width and height combinations to work with, they too would need to take stock. They would likely need to reexamine everything they thought they knew about composition. Perhaps they would develop techniques for dealing with especially large or small canvases. Whatever the outcome, once the painters learned to deal with the new variable in their workflow, they would return to task: painting.</p><p>\r\n\tThe metaphor may be a little shaky since paintings usually don’t have to “respond” to different canvas sizes, but I think the point stands. Every time the problem space changes, those who work within that space adapt their methods and continue producing. The need for responsive websites will not go away, but building a “responsive website” instead of just a website is the same as building an “good SEO website” or an “HTML5 website”. All these things are merely attributes, they are not the site itself.</p><p>\r\n\tIf web design is problem solving, every website is a solution to a specific problem. How effectively a particular site solves the problem has nothing to do with which framework or how many media queries it uses. Instead, a site’s effectiveness relies on how carefully its developer chooses its constituent components and how well those components work together to address the original problem.</p><p><em>Smashing Boxes is a web and mobile app development company know for creating a lasting experience through bold design and disrupting the status quo. We are entrepreneurs and craftsmen first, and a digital creative agency second. Inspired by our visionary clients, we transform ideas into innovative web and mobile applications. </em><a href=\"http://smashingboxes.com/work\">Take a look at our work.</a></p>",
  "slug": "responsive-web-design",
  "slug_history": "--- []\n",
  "visits": 2205,
  "published": "2013-01-03T05:00:00+00:00",
  "authorName": "Biko Tushinde",
  "category_id": 3,
  "image_uid": "2014/08/01/13/21/56/21/file",
  "created_at": "2014-06-05T18:24:34+00:00",
  "updated_at": "2014-08-01T17:21:59+00:00",
  "markdown": null,
  "image_alt_text": null,
  "featured": false,
  "database_id": 291,
  "category": {
    "type": "Entry",
    "id": "category_3"
  },
  "authors": [
    {
      "type": "employee",
      "id": "employee_22"
    },
    {
      "type": "employee",
      "id": "employee_22"
    }
  ]
}