{
  "id": "post_335",
  "title": "A Look at Julia Elman's Book: Lightweight Django",
  "summary": "Julia Elman isn't your typical front-end programmer. On top of being a designer by trade and instructor at the Iron Yard Academy powered by Smashing Boxes, she's a self-taught programmer, career go-getter and now an author. We sat down with Julia to discuss her new book, Lightweight Django, and how she got to where she is today. ",
  "body": "<p>\r\n\t<a href=\"http://sbprod.sbox.es/ideas/who-is-durhams-first-code-academy#juliaelman\">Julia Elman</a> isn't your typical front-end programmer. On top of being a designer by trade and instructor at the <a href=\"http://academy.smashingboxes.com/\" style=\"background-color: initial;\">Iron Yard Academy powered by Smashing Boxes</a>, she's a self-taught programmer, career go-getter and now an author. We sat down with Julia to discuss her new book, Lightweight Django, and how she got to where she is today. Listen to the podcast interview in its entirety below.</p><p>\r\n\t<em><br>\r\n\t</em></p><iframe src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/159632978&amp;auto_play=false&amp;hide_related=false&amp;show_comments=true&amp;show_user=true&amp;show_reposts=false&amp;visual=true\" height=\"450\" width=\"100%\" frameborder=\"no\" scrolling=\"no\">\r\n</iframe><p>\r\n\t<strong><br>\r\n\t</strong></p><p>\r\n\t<strong>Can you tell us a little about how you came down this career path?</strong></p><p>\r\n\t\tI’d like to think it was curiosity mostly&hellip;when I started over a decade ago the web was just sort of emerging, I’ve always been somebody who like problem solving as well. I think being a designer and loving problem solving is just part of your job. As a developer it’s the same thing.</p><p>\r\n\t<strong>You had a partner on this book, Mark Lavin. Tell me a little bit about how that came about.</strong></p><p>\r\n\tMark and I actually worked at Caktus Consulting Group for a few years and we just really enjoy working together and work well together. So we decided to write a book.</p><p>\r\n\t<strong>Why specifically Django?</strong></p><p>\r\n\tI’ve been doing Django since about 2008&hellip;I fell in love with the framework and Python and the whole community in general. It’s a great community to be involved with. It’s something I’ve been doing for awhile now and this book is really about de-mystifying Django. It’s just a lot of fun to be able to do that.</p><p>\r\n\t<strong>Right now your book is on early release, “raw and unedited,”&nbsp; what exactly does that mean, what’s the thought behind that and when can we expect the final product? </strong></p><p>\r\n\tThe early release is really meant to get a backing&hellip;it’s really just to create some buzz and get people excited about this awesome new thing that is going to be part of the Django community and Python community and also Javascript as well. The book really brings in this sort of client side, back end infrastructure, how those two meet, how they work together.</p><p>\r\n\t<strong>So tell us a little bit about what audience this book is designed for and what you hope they take away from it?</strong></p><p>\r\n\tThe audience is really for people who don’t have a lot of experience bringing in client-side and back-end work into a Django environment. It’s definitely not a beginner book.</p><p>\r\n\t<strong>So you started off as a designer and programmer, you still are, what was the biggest challenge in transforming form that to author?</strong></p><p>\r\n\tA decision. I’m a person who likes challenges and I don’t understand the concept of boredom so really it was like what’s the next challenge for me and my career?</p><p>\r\n\t<strong>What kind of advice would you give to other programmers who might follow down the same path of authorship?</strong></p><p>\r\n\tFind something that you love. Maybe something that you want to learn a little more about&hellip;Also find a really good editor.</p><p>\r\n\t<strong>So after completion of the e-book, is this book going to be available in print? </strong></p><p>\r\n\tYes, it will be available later on this year.</p><p>\r\n\t<strong>You are a clear example of a woman who’s been very successful in tech. What kind of advice would you have for other women who want to follow down the path of programming? </strong></p><p>\r\n\tDon’t give up. Don’t quit, if it’s something you love. Don’t let things stand in your way. The hard part is going at it alone&hellip;get that support group.</p><p>\r\n\t<em>To learn more about The Iron Yard powered by Smashing Boxes visit <a href=\"http://academy.smashingboxes.com/\" target=\"_blank\">academy.smashingboxes.com</a>. Buy Julia's book on early release <a href=\"http://shop.oreilly.com/product/0636920032502.do\" target=\"_blank\">here</a>.</em></p><p><em style=\"background-color: initial;\">Cover photo by&nbsp;</em><a href=\"http://alejandroescamilla.com/\" style=\"font-size: 14px; background-color: initial;\"><em>Alejandro Escamilla</em></a></p><p style=\"text-align: center;\"></p>",
  "slug": "lightweight-django",
  "slug_history": "---\n- lightweightdjango\n- julia-elmans-lightweight-django-on-early-release\n",
  "visits": 1774,
  "published": "2014-07-30T21:31:10+00:00",
  "authorName": "Laura Smith",
  "category_id": 1,
  "image_uid": "2014/07/30/14/29/22/742/file",
  "created_at": "2014-07-30T17:31:10+00:00",
  "updated_at": "2014-12-18T23:10:48+00:00",
  "markdown": "",
  "image_alt_text": null,
  "featured": false,
  "database_id": 335,
  "category": {
    "type": "Entry",
    "id": "category_1"
  },
  "authors": [
    {
      "type": "employee",
      "id": "employee_60"
    },
    {
      "type": "employee",
      "id": "employee_60"
    }
  ]
}