{
  "id": "post_343",
  "title": "Triangle Startup Weekend Engages Innovators to Improve Healthcare ",
  "summary": "Smashing Boxes participated in the Triangle Health Startup Weekend in North Carolina. The Triangle Startup Weekends are just one way that North Carolina is engaged in healthcare innovation. ",
  "body": "<p>The Triangle Startup Weekends are just one way that North Carolina is engaged in healthcare innovation. Brian Moynihan, head of <a href=\"https://www.linkedin.com/groups/Health-20-NC-Triangle-4964713/about\" style=\"background-color: initial;\">Triangle chapter of Health 2.0</a>, had a longstanding interest in hosting this event in North Carolina. “This was really a dream come true for me,” he said. “Ever since coming to my first Startup Weekend last year, I had wanted to put on a health-centered event. It was a great chance for people who have an innovative idea to get feedback from physicians, developers, HIPAA experts, business people and more.”</p><p>But the&nbsp;<a href=\"http://startupweekend.org\" target=\"_blank\">Startup Weekend</a> isn’t a North Carolina phenomenon. Powered by Google for Entrepreneurs, more than 1,500 events have been held around the world. Each location has the prerogative to organize around a topic of its choice, with past topics including healthcare, education, and more. </p><p>Even as the players and topics vary from event to event, the format for the weekend remains highly collaborative and intense: Friday night participants pitch their ideas and self-select to form teams. On Saturday teams are hard at work talking about their concept with help from coaches and experts as they simultaneously work on business plans, branding, and prototypes. Sunday morning everyone is back together bright and early, talking with strangers, friends, and potential users to validate their concept. Finally after a whirlwind of brainstorming and execution, the teams pitch to a panel of investors and experienced entrepreneurs to compete for the glory of having the best idea. </p><p style=\"text-align: center;\"><img src=\"/media/W1siZiIsIjIwMTQvMDgvMjEvMTAvMDkvNDgvMjIwL1RTV19UZWFtcGhvdG8uanBnIl1d/TSW_Teamphoto.jpg?sha=51df2f49\" style=\"background-color: initial;\"></p><p>Bobby Bahram, a judge from the Startup weekend and manager at <a href=\"http://www.exceleratehealth.com/\">Excelerate Health Ventures</a>, was inspired by the participants. “Seeing passionate entrepreneurs - most of them strangers prior to Friday - morph into a cohesive team to bring ambitious ideas to life is a testament to the dedication of the weekend warriors and our growing entrepreneurial community,” he said. They are fast-paced, high energy, and inspiring weekends.</p><p>A few of the ideas that formed during the weekend included an app to keep diabetes patients accountable for taking their blood sugar readings, various concepts for telemedicine, and a fresh take on intubation devices. The winning team developed natural feminine hygiene products using coconut oil. </p><p><img src=\"/media/W1siZiIsIjIwMTQvMDgvMjAvMTcvMDYvMjUvNzg4L0VNX2hlYWRzaG90LmpwZyJdXQ/EM_headshot.jpg?sha=0228e761\" alt=\"\" style=\"float: left; margin: 0px 10px 10px 0px;\"></p><p>As a coach for the weekend, I had the opportunity to sit down with a participant from the weekend, Emily Mangone, a PhD student at UNC’s School of Public Health, <a href=\"http://www.fhi360.org/\">FHI360 </a>Fellow, and member of the Connect the Docs Startup Weekend team. Here are some insights from our question and answer session:</p><p><strong>Why were you interested in participating in this event?</strong></p><p>I’ve wanted to participate more in the business aspect of innovative mhealth products. My own research has been towards developing an app related to reproductive health. I wanted to learn about all the elements to a winning team. As a student I don’t have a lot of free time and I wanted to see what that process looked like in a compact period of time. </p><p><strong>How did your team merge health with technology? </strong></p><p>Our idea started as combination of health and technology through EMRs to make them compatible across different systems, however we were informed that the government is going to mandate openness across EMR platforms. Our final idea, CareStream, was a tool for the documentation of medical information that can be used to organize information about care from different health systems to get a snapshot of someone’s health history. Our team also illustrates the perfect merge: a few doctors, a physician entrepreneur, an MBA student, myself with a public health background, and a tireless programmer. I learned that I need to have one or two programmers if I want to pitch something in such a high tech field like mHealth. Even just to build a website I’d want that level of support. </p><p><strong>How do you think events such as this one can enhance the health technology sector in the Triangle?</strong></p><p>I think it creates a lot of energy and buzz around innovative ideas. It’s an incubator for talented people who want to work on new problems with other people who have similar interests but different expertise. We want people to have great ideas in the Triangle so we can bring more technology business right to our front door. </p><p><strong>What was your biggest takeaway from the weekend?</strong></p><p>Pitching a product you love is ideal, but what I got out of the weekend was learning about the process- from finding an idea, researching, putting together a team, doing market research, and more. I got a really cool understand of the process to bring a product to market in the field that I am interested in. I wanted to do something out of my comfort zone so I worked with a diverse team--it was high tech, mobile, and complex. There was just a great group of people I could learn from. I was grateful for what I got out of the event. </p><p><strong>What do you see for the future of healthcare and tech?</strong></p><p>I think healthcare is rapidly coming down to individual engagement, whether it is online, from your phone or your own home. Through technology, people can be more involved with their care. I’m hopeful for the future of healthcare and hopeful that technology will reduce costs and improve efficiency. </p><p><em>Interested in future Startup weekends? </em><em>Follow us on <a href=\"https://twitter.com/smashingboxes\" style=\"font-size: 14px; background-color: initial;\">Twitter</a></em><em> to hear more about mHealth events and sponsorships.</em></p><p><em>Cover photo by&nbsp;</em><a href=\"https://www.flickr.com/photos/36243589@N04/\">Dr. Farouk</a></p>",
  "slug": "how-the-triangle-startup-weekend-is-engaging-innovators-to-improve-healthcare",
  "slug_history": "--- []\n",
  "visits": 1083,
  "published": "2014-08-21T18:16:36+00:00",
  "authorName": "Katie McMillan",
  "category_id": 2,
  "image_uid": "2014/08/21/11/10/47/594/file",
  "created_at": "2014-08-20T21:06:49+00:00",
  "updated_at": "2014-12-19T14:35:47+00:00",
  "markdown": "",
  "image_alt_text": null,
  "featured": false,
  "database_id": 343,
  "category": {
    "type": "Entry",
    "id": "category_2"
  },
  "authors": [
    {
      "type": "employee",
      "id": "employee_59"
    },
    {
      "type": "employee",
      "id": "employee_59"
    }
  ]
}