{
  "id": "post_345",
  "title": "Apple’s Swift: Should Beginners Still Learn Objective-C?",
  "summary": "Smashing Boxes mobile developer Jordan Clifton gives his insights on using Objective-C first over Apple's Swift.",
  "body": "<p>In my&nbsp;<a href=\"http://smashingboxes.com/ideas/apples-swift-a-developers-first-impression\" target=\"_blank\">previous article</a> right after WWDC14, I compared Swift to Objective-C. We received some very good feedback but one question in particular really caught my attention: “Would anyone recommend learning Swift or start with Objective-C first? I feel that learning C would give me a better understanding of the internal workings and will lead to better code, but it will take much more time and has a steeper learning curve.”</p><p>To answer this question and perhaps the question of many potential iOS developers, I feel that it would be better to start off learning Objective-C before Swift. Let me explain my reasoning.</p><p>Obj-C is an established language. It made its appearance in 1983 making it a little over 30 years old! While Swift may look great it is continuing to evolve and mature over time. Apple’s App Store contains over 1.2 million apps to download and most all of these apps are written in Obj-C. If someone were trying to break into the iOS development industry, hiring managers will be looking for development experience in Obj-C to help maintain their existing apps. It will take time for the majority of iOS developers to completely switch to using Swift for iOS development.</p><p>Because Obj-C has been around for so long, you will find that most of the iOS development related questions asked on sites such as StackOverflow are answered with Obj-C code. Many tutorials are also written using Obj-C. Some well-known tutorial sites like <a href=\"http://www.raywenderlich.com/\" target=\"_blank\">Ray Wenderlich.com</a> are moving to use only Swift for future content which is great, but all the past tutorials are written in Obj-C.</p><p>You will learn Obj-C a lot faster, and after gaining a good understanding of it, learning Swift will be a piece of cake. Swift contains a lot of modern features that will make it more versatile, more concise, and nicer to read and write, but it’s still in its infancy. For the next several years, it will be important for professional iOS developers to have a good grasp of both Objective-C and Swift. One could definitely understand Swift without a good grip on Obj-C but if starting out with iOS development it's better to start with Obj-C. Since Obj-C is a completely different language than Swift it's not required to know, it but if you are thinking about getting into iOS development, it is definitely recommended to learn first. Once you’re familiar with the iOS patterns used to develop apps, you can use exactly the same patterns while writing in both languages, so moving from one language to the other is just a matter of learning the syntax. With Swift, you’re developing apps using the same framework and APIs as you would with Obj-C. I have found that after getting the syntax down, it becomes very simple to write the functionality you want for your app.</p><p style=\"text-align: center;\"><strong>Initializing a UIView with size 200x200 and a blue background:</strong></p><p style=\"text-align: center;\"><img src=\"/media/W1siZiIsIjIwMTQvMDgvMjcvMDkvMjIvMzAvMzgvU2NyZWVuX1Nob3RfMjAxNF8wOF8yN19hdF85LjIxLjU1X0FNLnBuZyJdXQ/Screen%20Shot%202014-08-27%20at%209.21.55%20AM.png?sha=2f4ea16f\"></p><p style=\"text-align: center;\"></p><p style=\"text-align: center;\"></p><p>Keep in mind this is just my opinion, but it’s definitely worth researching both languages and eventually using both for better app development.</p><p>There are lots of options for learning Obj-C on your own. These are some of my favorites:</p><p><a href=\"https://developer.apple.com/library/mac/documentation/cocoa/conceptual/ProgrammingWithObjectiveC/Introduction/Introduction.html\" target=\"_blank\">Apple’s Programming with Objective-C</a></p><p><a href=\"http://tryobjectivec.codeschool.com/#\" target=\"_blank\">Code School</a></p><p><a href=\"http://www.bignerdranch.com/we-write/objective-c-programming.html\" target=\"_blank\">Big Nerd Ranch Objective-C programming book</a></p><p>Cover photo from&nbsp;<a href=\"https://www.flickr.com/photos/internetarchivebookimages/14592208589/in/photolist-oesTeg-oet4JU-oet2aX-oePCA4-od7PAk-ouBrfa-owuS2B-oeHRuW-owf1qk-osApB5-ow88FT-oeNT1m-owoSda-ouYio5-oeYptK-oumVDq-owberK-oeT6iP-owebvt-od5N5h-oeEJJg-ow828x-oeLUkN-otkaLZ-oeWUiH-oeL4VR-ocpiFy-oeNMnX-oeMitk-ovSu1o-oesR2j-ovXtdx-owirgr-owivzX-owiu6V-owcfuq-ouqwqZ-oevcKb-owe7cE-oePfHt-od8UwQ-ow3yiS-odd7NC-osAwGs-ow8Moa-ovWfNF-ovWg1p-oeFnLv-ov3H8a-otEQeo\" target=\"_blank\">\"The story of the sun, moon, and stars\" (1898)</a></p>",
  "slug": "apples-swift-should-beginners-still-learn-objective-c",
  "slug_history": "--- []\n",
  "visits": 66170,
  "published": "2014-08-27T17:20:06+00:00",
  "authorName": "Jordan Clifton",
  "category_id": 4,
  "image_uid": "2014/08/27/10/20/59/712/file",
  "created_at": "2014-08-26T17:04:47+00:00",
  "updated_at": "2014-12-18T23:21:11+00:00",
  "markdown": "",
  "image_alt_text": null,
  "featured": false,
  "database_id": 345,
  "category": {
    "type": "Entry",
    "id": "category_4"
  },
  "authors": [
    {
      "type": "employee",
      "id": "employee_2"
    },
    {
      "type": "employee",
      "id": "employee_2"
    }
  ]
}