{
  "id": "post_380",
  "title": "Changing The Way Startups Raise Capital",
  "summary": "Adopters of equity crowdfunding can spur North Carolina startups, encourage community growth, enhance entrepreneurship, and better the traditional investment climate. \r\n",
  "body": "<p>Why is securing funding for a startup so difficult? That was the question Jon Spinney and Sean Steigerwal had on their minds come graduation time from NC State's School of Business. They saw fresh-faced and wide-eyed entrepreneurs like themselves had all the tools to start a business - the education, the plan, the strategies, and sometimes the product - but no money or source of revenue.</p><h5><strong>The Challenge of Funding</strong></h5><p>\r\n\tSean and Jon’s situation isn’t an isolated predicament. Getting funding is seen as a necessary evil for startup founders; something you just have to get through. But it’s hard, especially for startups in the local area.</p><p>\r\n\tThe entrepreneurial community in the Triangle is strong. Universities, coworking spaces and young businesses like ourselves are all working to foster the growth of this community. But we still have a ways to go to compete with the country's largest tech hubs. So, how do we get there?</p><p>\r\n\tBy raising capital.</p><p>\r\n\tThe area has seen a lack of capital available for early-stage businesses, which has pushed some to seek out bigger cities a larger venture scene. In my nearly five years in the local startup scene, I have seen many great ideas stall or not grow nearly as large as they could have because of difficulty in raising funds.</p><p>\r\n\tThats a tough pill to swallow for a fellow entrepreneur. There’s nothing worse than when a company that has been founded by North Carolina natives picks up and moves to the West Coast, or cities like Boston, because that’s where the money is. We want to be a successful entrepreneurial hub, so we need to keep these people, and their companies, here.</p><h5><strong>A New Idea Based on a Common Trend</strong></h5><p>\r\n\tIn 2013, Jon and Sean dreamt up the idea for Malartu, a website that would allow investors to pick and choose the startups they fund. They came to us to design and deliver the final product. To best do this, we had casual, informal conversations with local startups and investors. Our biggest takeaway was that these investors invest in their community to grow their community.</p><p>\r\n\tWith <a href=\"https://malartufunds.us/preview\">Malartu</a>, startups can list their company on the site and certified investors can browse through and choose to invest in a limited number of infant businesses. It allows N.C. startups to raise $50,000 to $1,000,000, and accredited investors can put as little as $1,000 into a company.  Like a traditional crowdfunding initiative, Malartu allows multiple investors to invest in one company, it just doesn’t have to be at the same time or altogether.</p><p>\r\n\t<img src=\"https://lh6.googleusercontent.com/FKTanilTICbpMQTUFeBnOcxeMIWlhXuZkF8aA1AHphmOU72u5eIgO3lAjylJIHK-2P-S8-u95mXgISaI_A1GMEIUTM_69tw6_cxSQOD5TrPuZx4FX82N_yWTu-gznZ61M-CYQCw\" width=\"624px;\" height=\"357px;\" style=\"border-style: none; transform: rotate(0rad); -webkit-transform: rotate(0rad); display: block; margin: auto;\" alt=\"laptop-a16c8b4d0ee7cb0986646d6c54c67955.png\"></p><p>\r\n\tEarly adopters to this kind of equity crowdfunding have the power to enable many more startups and thus change the traditional ways capital is raised. With these types of crowdfunding initiatives, there’s a domino effect, empowering one company to empower another, and another, and so forth.</p><h5><strong>The Answer to An Ongoing Problem? Maybe.</strong></h5><p>\r\n\tSeveral weeks ago, the North Carolina Senate filed a new bill called PACES (Providing Access To Entrepreneurs/Small Business). With the passage of the bill, anyone can invest up to $5,000 into a startup company in exchange for equity.</p><p>\r\n\tAs of now, this is something investors can’t currently do unless they are “accredited,” meaning they have a net worth of $1 million or more or have earned $200,000 ($300,00 with a spouse) for the last two years or more.</p><p>\r\n\tThe only way to turn around the problem of funding is to get more capital investment, and more success stories, keeping more of the winners here to make more investments. I don’t think that N.C. PACES will turn this around all by itself, but it’s a start.</p><p>\r\n\tFor small businesses and startups, this bill and investment initiatives like Malartu support the entrepreneurial spirit that has been the backbone to both their inspiration and success. Only time will tell, but entrepreneurs like Jon and Sean are optimistic. It’s the hope that these actions will light a fire under the entrepreneurial spirit of our local community and keep it burning into the future.</p><p>\r\n\t<em>Editor’s Note:<br>\r\n\t</em></p><p>\r\n\t<em>You can have a voice in making this happen. Call your State Senator or General Assembly representative. Tell them you want to make this bill a reality and you don’t want it caught up in the politics that have killed the initiative in previous years. Let’s get this thing passed!</em></p><p>\r\n\t<em>About the Author: </em></p><p>\r\n\t<a href=\"http://smashingboxes.com/bio/josh-robertson\">Josh Robertson</a><em> is the Director of Operations for Smashing Boxes. He is a veteran of Operation Iraqi Freedom and Operation Enduring Freedom, and served as a Naval Officer for 13 years in both an Active Duty and Reserve capacity. Prior to joining Smashing Boxes he was a member of the leadership team for two technology startups. He also consulted as a subject matter expert on projects for the Defense Advanced Research Projects Agency (DARPA), United States Special Operations Command (SOCOM) and the Department of the Navy (DoN). </em><em>Follow Josh on </em><a href=\"https://www.google.com/url?q=https%3A%2F%2Ftwitter.com%2Fjrobertsonsb&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNGlNcg_gNiqyTF0liStJdOoaqxt_A\">Twitter</a><em> or connect on </em><a href=\"http://www.google.com/url?q=http%3A%2F%2Fwww.linkedin.com%2Fpub%2Fjoshua-robertson%2F3%2F1b%2Fa04%2Fen&amp;sa=D&amp;sntz=1&amp;usg=AFQjCNGqAAAL2tRO_dIAMHFFCPhIe_6Tgw\">LinkedIn</a><em>. </em></p>",
  "slug": "changing-the-way-startups-raise-capital",
  "slug_history": "--- []\n",
  "visits": 939,
  "published": "2015-04-14T00:00:00+00:00",
  "authorName": "",
  "category_id": 2,
  "image_uid": "2015/04/14/15/08/35/736/file",
  "created_at": "2015-04-14T17:53:01+00:00",
  "updated_at": "2015-07-14T19:41:09+00:00",
  "markdown": "",
  "image_alt_text": "Raleigh, North Carolina is a hub for tech startups and entrepreneurship",
  "featured": false,
  "database_id": 380,
  "category": {
    "type": "Entry",
    "id": "category_2"
  },
  "tags": [
    {
      "type": "tag",
      "id": "tag_26"
    },
    {
      "type": "tag",
      "id": "tag_35"
    },
    {
      "type": "tag",
      "id": "tag_26"
    },
    {
      "type": "tag",
      "id": "tag_35"
    }
  ],
  "authors": [
    {
      "type": "employee",
      "id": "employee_63"
    },
    {
      "type": "employee",
      "id": "employee_60"
    },
    {
      "type": "employee",
      "id": "employee_63"
    },
    {
      "type": "employee",
      "id": "employee_60"
    }
  ]
}