{
  "id": "post_221",
  "title": "Who is Durham’s First Code Academy?",
  "summary": "The Iron Yard powered by Smashing Boxes is eager to begin the first semester of classes on June 2nd at Durham’s American Tobacco Campus (and is still accepting applications for the front-end course!) It’s been a busy time of growth, learning, and lots of fun planning all of the amazing things students will encounter in their time at The…",
  "body": "<p>\r\n\t<a href=\"http://sbblog.s3.amazonaws.com/wp-content/uploads/2014/05/Durham-Academy2.jpg\"><img class=\"alignnone size-full wp-image-5259\" alt=\"Durham Academy2\" src=\"http://sbblog.s3.amazonaws.com/wp-content/uploads/2014/05/Durham-Academy2.jpg\" width=\"1000\" height=\"667\" style=\"display: block; margin: auto; width: 1038px;\"></a></p><p>\r\n\t<a href=\"http://academy.smashingboxes.com/\">The Iron Yard powered by Smashing Boxes</a> is eager to begin the first semester of classes on June 2nd at Durham’s <a href=\"http://www.americantobaccohistoricdistrict.com/\">American Tobacco Campus</a> (and is still&nbsp;<a href=\"http://theironyard.com/academy/front-end-engineering/\">accepting applications</a> for the front-end course!) It’s been a busy time of growth, learning, and lots of fun planning all of the <a href=\"http://eldonyoder.com/2014/03/looking-ahead-iron-yard/\">amazing things students will encounter</a> in their time at The Academy.</p><p>\r\n\tThe Academy is a code school that offers 12-week, intensive courses that incorporate hands-on learning experience with teaching, mentorship, collaboration, and real world skills building. The program is very fast paced and students work on assignments that build knowledge cumulatively. In the end, students graduate from the program with a portfolio of their work and are ready to seek employment as junior-level programmers. The Academy comes with an employment guarantee; get a programming job or your money back. Classes will be held in the \r\n\t<a href=\"http://americanunderground.com/\">American Underground</a>, in the heart of the Triangle area’s burgeoning tech scene.</p><p>\r\n\tTo make things a bit more personal we’d like to introduce you to the Academy‘s profoundly intelligent and inspiring instructors, Clinton and&nbsp;<a href=\"http://smashingboxes.com/ideas/lightweight-django\" target=\"_blank\">Julia</a>, and wonder-woman Campus Director, Jessica Mitsch.</p><h5>\r\n<strong>Clinton Dreisbach</strong>\r\n</h5><p style=\"text-align: center;\">\r\n\t<img class=\" wp-image-5136 aligncenter\" alt=\"_DSC3507\" src=\"http://sbblog.s3.amazonaws.com/wp-content/uploads/2014/05/DSC3507.jpg\" width=\"291\" height=\"409\"></p><p>\r\n\tHi! I’m&nbsp;\r\n\t<a href=\"https://github.com/cndreisbach/\">Clinton Dreisbach</a> and I am excited to be an instructor with The Iron Yard powered by Smashing Boxes&nbsp;in&nbsp;Durham. I’ve been a programmer since I was 10 and got my hands on an&nbsp;<a href=\"http://en.wikipedia.org/wiki/IBM_PCjr\">IBM PCJr</a>, and I’ve been writing software professionally for over 15 years, working in everything from Perl to Java to Ruby to Clojure. Of all the languages I’ve used, Ruby has consistently been one of my favorites, so I’m thrilled to be teaching our inaugural Ruby on Rails class in Durham.</p><p>\r\n\tI have always loved teaching people and have done plenty of one-on-one mentoring and conference speaking. For the past two years, I’ve been teaching outside of work in programs such as&nbsp;\r\n\t<a href=\"http://www.citizenschools.org/\">Citizen Schools</a> and&nbsp;<a href=\"http://www.clojurebridge.org/\">ClojureBridge</a>. I’m looking forward to bringing the skills I’ve learned to The Academy.</p><p>\r\n\tWhen I am not at a keyboard, I am busy being a dad to an amazing toddler and partner to an amazing spouse. In the sliver of time left after all that, I play and design tabletop games and bang out tunes on my ukulele.</p><h5>\r\n<p id=\"juliaelman\"><strong>Julia Elman</strong></p></h5><p style=\"text-align: center;\">\r\n\t<a href=\"http://sbblog.s3.amazonaws.com/wp-content/uploads/2014/05/Julia.jpg\"><img class=\" wp-image-5177 aligncenter\" alt=\"Julia\" src=\"http://sbblog.s3.amazonaws.com/wp-content/uploads/2014/05/Julia.jpg\" width=\"302\" height=\"454\"></a></p><p>\r\n\tHello! My name is&nbsp;<a href=\"http://juliaelman.com/\">Julia Elman</a> and I am a designer, developer, and tech education advocate based in North Carolina. I’ve been working my brand of web skills since 2002 and honing my skill set as a front end developer. My creative nature drove me to find work at&nbsp;<a href=\"http://www.hallmark.com/\">Hallmark Cards, Inc.</a> in Kansas City in 2007 where I worked on projects such as the Product (RED) campaign andHallmark’s site re-design. From there, I took a dive into&nbsp;<a href=\"http://djangoproject.com/\">Django</a> as a Junior Designer/Developer at World Online in Lawrence, KS.&nbsp;Currently, I am working on a book for&nbsp;<a href=\"http://www.oreilly.com/\">O’Reilly Media</a> on called “<a href=\"http://smashingboxes.com/ideas/lightweight-django\" target=\"_blank\">Light weight&nbsp;Django</a>” which focuses on advanced and light weight techniques when using Django with Javascript (TBR 2014).</p><p>\r\n\tIn my spare time, I am&nbsp;one of the local Chapter Leaders for\r\n\t<a href=\"http://www.meetup.com/Girl-Develop-It-RDU/\">&nbsp;Girl Develop It RDU</a>, a non-profit organization focused on empowering women to learn software programming. In early 2013, I helped teach the initial HTML/CSS class&nbsp;and have since helped grow the chapter to over 600 members, four instructors and multiple teaching assistants.&nbsp;Also in&nbsp;2013, I helped organize and teach the<a href=\"http://juliaelman.com/blog/2013/08/20/teen-tech-camp-recap/\">&nbsp;Teen Tech Camp</a>, a one day for teaching kids 12-18 how to program with&nbsp;<a href=\"http://python.org/\">Python</a> on a&nbsp;<a href=\"http://www.raspberrypi.org/\">Raspberry Pi.</a></p><p>\r\n\tJoining The Iron Yard powered by Smashing Boxes in Durham&nbsp;is something I am thrilled to have the opportunity to do and I am excited to show the world the talent the Triangle area has to offer!</p><h5>\r\n<strong>Jessica Mitsch<span style=\"font-size: 13px;\">&nbsp;</span></strong>\r\n</h5><p style=\"text-align: center;\">\r\n\t<img class=\" wp-image-5176 aligncenter\" alt=\"Jesssica 1\" src=\"http://sbblog.s3.amazonaws.com/wp-content/uploads/2014/05/Jesssica-1.jpg\" width=\"302\" height=\"454\"></p><p>\r\n\tHello, my name is&nbsp;\r\n\t<a href=\"https://twitter.com/JessicaMitsch\">J</a><a href=\"https://twitter.com/JessicaMitsch\">essica Mitsch</a> and I’m thrilled to be joining The Iron Yard powered by Smashing Boxes&nbsp;as Campus Director!</p><p>\r\n\tI unexpectedly stumbled into a career in tech at Red Hat, Inc. after graduating from the College of Charleston with a Religious Studies degree (yes, I was one of those liberal arts majors who thought I’d graduate and venture off to find a solution to world peace.)&nbsp;I wore several hats (pun intended) as a member of the People Team at Red Hat and my experience there led me to love the innovative and ever changing world of technology while gaining an understanding of the the extraordinary gap and need for tech talent.</p><p>\r\n\tI have always been passionate about education and believe education must be reformed to meet the challenges of the 21st century. When the incredibly talented folks at The Iron Yard approached me about joining their team to launch a code school in Durham, it just made sense to me.</p><p>\r\n\tIn my spare time I can be found moving in a studio somewhere – I enjoy dance, yoga and fitness classes. I love to travel, just about anywhere I can go and consider myself somewhat of a health nut.</p><h5>\r\n<strong>The Iron Yard &amp; Smashing Boxes Connection</strong>\r\n</h5><p dir=\"ltr\">\r\n\tThe school represents a unique partnership between The Iron Yard and Smashing Boxes, marrying credibility and experience with a strong understanding of the local technology landscape. Simply put, both companies are dedicated to the lifelong pursuit of knowledge, helping the Triangle thrive through grassroots initiatives, and giving people, especially women and other underrepresented groups, the chance to find professional success in the technology space.</p><p dir=\"ltr\">\r\n\tThe Iron Yard provides the outstanding instructors you met above, a proven curriculum, and extensive experience with job placement and professional growth. Smashing Boxes contributes through guest lectures, office hours for students to take advantage of developer knowledge, immersion into our culture and real client work, and various other professional opportunities.</p><p dir=\"ltr\">\r\n\tIn the words of our partners&nbsp;at The Iron Yard:&nbsp;\r\n\t<strong><a href=\"http://theironyard.com/about/\">To Infinity and Beyond!</a></strong></p><p dir=\"ltr\"></p><p dir=\"ltr\"></p><p>\r\n\t<em>Smashing Boxes is a web and mobile app development company known for creating a lasting experience through bold design and disrupting the status quo. We are entrepreneurs and craftsmen first, and a digital creative agency second. Inspired by our visionary clients, we transform ideas into innovative web and mobile applications. </em><a href=\"http://smashingboxes.com/work\">Take a look at our work.</a></p><p dir=\"ltr\">\r\n\t<em>Cover photo by&nbsp;</em><a href=\"https://www.flickr.com/photos/bunchofpants/\" style=\"background-color: initial;\"><em>Lisa Bunchofpants</em></a></p><p class=\"cancel-comment-reply\"></p><form action=\"http://www.smashingboxes.com/wp-comments-post.php\" method=\"post\" id=\"commentform\" >\r\n\t<p style=\"display: none;\">\r\n\t\t<input type=\"hidden\" id=\"akismet_comment_nonce\" name=\"akismet_comment_nonce\" value=\"8f3ba85dbc\">\r\n\t</p></form>",
  "slug": "who-is-durhams-first-code-academy",
  "slug_history": "--- []\n",
  "visits": 1809,
  "published": "2014-05-14T04:00:00+00:00",
  "authorName": "Ellen Clemons",
  "category_id": 1,
  "image_uid": "2014/07/28/17/27/28/138/file",
  "created_at": "2014-06-05T18:21:02+00:00",
  "updated_at": "2014-08-15T16:35:25+00:00",
  "markdown": null,
  "image_alt_text": null,
  "featured": false,
  "database_id": 221,
  "category": {
    "type": "Entry",
    "id": "category_1"
  },
  "authors": [
    {
      "type": "employee",
      "id": "employee_65"
    },
    {
      "type": "employee",
      "id": "employee_65"
    }
  ]
}