{
  "id": "post_385",
  "title": "What's Driving Twitter's App Design?",
  "summary": "What's behind the Twitter design team’s decision to hide the Follow button while scrolling through another user’s timeline on Android and iOS devices? In this article, I present three options for making the Follow button immediately accessible at the moment of decision to follow, while disrupting the current User Interface (UI) as little as possible.",
  "body": "<p>Twitter’s design team is famously open about their process and thinking. It’s fascinating to observe as they work through updating and improving their applications to make them more appealing to a large and diverse group of people engaging on different platforms contexts. The degree to which they’ve succeeded is impressive, but that’s not to say that every decision makes sense to an end user. Particularly, without the benefit of having been a part of the research, observation, and iteration that led to it.<br>\r\n</p><p>Based on my understanding of the vision driving Twitter, the ability of a user to follow and be followed by other users is second in importance only to the user’s ability to send tweets. Without the concept of following, Twitter devolves into a mob of people shouting at each other.\r\n</p><p>That’s why I was surprised by the design team’s decision to hide the Follow button while scrolling through another user’s timeline on Android and iOS devices (web maintains the button’s visibility). Depending on the height of the user’s device and the length of the most recent tweets, a mobile user will typically be able to read around three (but as few as one) tweets before scrolling the Follow button off the top of the screen.\r\n</p><iframe src=\"http://gfycat.com/ifr/TartTerribleCrocodile\" scrolling=\"no\" style=\"-webkit-backface-visibility: hidden;-webkit-transform: scale(1);padding-left:0.65rem\" frameborder=\"0\" height=\"480\" width=\"292\">\r\n</iframe><p style=\"text-align:center;font-size:0.8em;margin-top:-1rem\"><em>Current review and follow interaction with disappearing Follow button</em>\r\n</p><h3 style=\"margin-top:1.5rem\"><strong>Experience Failure?</strong></h3><p>Do one to three tweets provide enough information to make a decision on whether to follow another user? In some cases, yes. Personally, and for a handful of other users I asked during an informal research session (details below), the answer is no. During that research session, three general follow scenarios emerged:\r\n</p><ol>\r\n\t<li>“A friend recommended that I follow a particular user, so I am going to follow him or her. This includes public figures, friends of friends, etc.” </li>\r\n\t<li>“An unfollowed user has come to my attention via a single retweet or contribution to a trending hashtag.”</li>\r\n\t<li>“An unfollowed user has come to my attention via repeated retweets or contributions to trending hashtags over time.”</li>\r\n</ol><p>In scenario 1, the user is not affected by the disappearing Follow button, as the decision to follow has already been made.\r\n</p><p>In scenario 2, given the limited insight into the unfollowed user’s tweeting habits, the potential follower is interested in discovering both quality of tweets and approximate volume of tweeting.\r\n</p><p>In scenario 3, a perception of consistent quality already exists, so the potential follower is nearly committed to following (similar to scenario 1) but still may have questions about quality and volume. This desire to learn more coupled with limited viewable tweets on a mobile screen means that scrolling through the timeline is likely before a decision to follow is made. If the potential follower scrolls 10, 20, 50 tweets down before deciding to follow, he or she must subsequently remember that the follow button exists, remember where it is (after potentially trying to discover it somewhere on-screen), and then scroll back to the top of the profile before again locating and tapping the Follow button. That’s significant thinking and interaction between decision and action, and ample opportunity for an experience failure.\r\n</p><h3 style=\"margin-top:1.5rem\">Reaching out</h3><p>Given the insights gained from my personal use patterns and informal research, I assume the decision to scroll the Follow button away was explicit and arrived at after extensive research, observation, and testing, which serves only to further pique my interest. Curious, I tweeted @design, Twitter’s in-house design team’s account.\r\n</p><blockquote class=\"twitter-tweet\" lang=\"en\">Yo <a href=\"https://twitter.com/design\">@design</a> - Curious as to the thinking behind not keeping the Follow button visible when the user scrolls down the mobile timeline<br>— Dante Passera (@dantepassera) <a href=\"https://twitter.com/dantepassera/status/607942625656750080\">June 8, 2015</a>\r\n</blockquote><p>In spite of the one whole favorite that tweet earned, I never heard back from Twitter. I’m almost glad I didn’t though, because it’s given me an opportunity to conduct informal and rapid testing on potential improvements to a discrete piece of UI functionality in an existing project.\r\n</p><p>To reiterate, <em>this is not a takedown</em>. As a creative professional, I understand the competing interests that lead to the ultimate implementation of a design. There is a reason that the Follow button scrolls off the screen. Since I wasn’t a part of that initial design process, however, I can’t speculate on what it might be. Instead, I’ll present three options for making sure the Follow button is immediately accessible at the moment of decision to follow, while disrupting the current UI as little as possible.\r\n</p><h3 style=\"margin-top:1.5rem\">Validating Potential Need For Improvement</h3><p>Now that I was about to embark upon a course of prototyping and testing, I wanted to verify my assumptions about the difficulty in executing a follow action. To that end, I created a Pixate prototype based on the current Twitter Android app, presented it to a group of eight web-only Twitter users, and had them execute the following task:\r\n</p><p style=\"font-size:1.5rem\"><em>“Decide to follow and then follow this profile”</em>\r\n</p><p>Six of eight users scrolled before attempting to follow. Of those,\r\n</p><ul>\r\n\t<li>Three scrolled back to the top and tapped Follow</li>\r\n\t<li>Two scrolled down, tapped the overflow menu, closed the overflow menus, scrolled back to the top and tapped Follow\r\n\t</li>\r\n\t<li>One scrolled down, tapped the user name and exited the profile, returned to the profile, and tapped Follow\r\n\t</li>\r\n</ul><iframe src=\"http://gfycat.com/ifr/TartTerribleCrocodile\" scrolling=\"no\" style=\"-webkit-backface-visibility: hidden;-webkit-transform: scale(1);padding-left:0.65rem;margin-top:3rem;\" frameborder=\"0\" height=\"480\" width=\"292\">\r\n</iframe><p style=\"text-align:center;font-size:0.8em;margin-top:-1rem;\"><em>User exhibits desired behavior</em>\r\n</p><iframe src=\"http://gfycat.com/ifr/WigglyUnnaturalGoitered\" scrolling=\"no\" style=\"-webkit-backface-visibility: hidden;-webkit-transform: scale(1);padding-left:0.65rem;margin-top:3rem;\" frameborder=\"0\" height=\"480\" width=\"292\">\r\n</iframe><p style=\"text-align:center;font-size:0.8em;margin-top:-1rem;\"><em>User searches in overflow for follow button</em>\r\n</p><iframe src=\"http://gfycat.com/ifr/BestRevolvingHarvestmen\" scrolling=\"no\" style=\"-webkit-backface-visibility: hidden;-webkit-transform: scale(1);padding-left:0.65rem;margin-top:3rem;\" frameborder=\"0\" height=\"480\" width=\"292\">\r\n</iframe><p style=\"text-align:center;font-size:0.8em;margin-top:-1rem;\"><em>User guesses incorrectly at functionality</em>\r\n</p><p style=\"margin-top:3rem;\">While each user was able to discover how to follow, there was substantial pausing to review and consider options, as seen in the test videos, as well as one instance of a “catastrophic” action - exiting the profile.\r\n</p><h3 style=\"margin-top:1.5rem\">Creating and Testing Potential Solutions</h3><p>Based on these observations and my own instincts, I created the three following Pixate prototypes, each with the benefit of not requiring a scroll reset to follow, and each with unique perceived pros and cons:\r\n</p><p style=\"text-align: center;margin-top:2rem;\"><strong>Option 1: Display Follow/Unfollow in action bar on scroll\r\n\t</strong>\r\n</p><p style=\"text-align: center;padding-left:0.5rem;margin-top:2rem;margin-bottom:1.5rem;\">\r\n\t<iframe src=\"http://gfycat.com/ifr/UnequaledElectricGreathornedowl\" scrolling=\"no\" style=\"-webkit-backface-visibility: hidden;-webkit-transform: scale(1);\" frameborder=\"0\" height=\"480\" width=\"292\">\r\n\t</iframe>\r\n</p><p style=\"max-width: 480px; margin-left: auto; margin-right: auto; margin-top:-0.75rem\">Pro: Persistent display of Follow button and status; Spatial connection with original follow button; Highly visible; Consistent with action bar and follow button styling\r\n</p><p style=\"max-width: 480px; margin-left: auto; margin-right: auto;\">Con: Adds visual complication to action bar; Displays screen-level action adjacent to and in same style of app-level action (Twitter search)\r\n</p><p style=\"text-align: center;margin-top:4rem;\"><strong>Option 2: Replace action bar tweet count with Follow/Unfollow on scroll</strong>\r\n</p><p style=\"text-align: center;padding-left:0.5rem;margin-top:2rem;margin-bottom:1.5rem;\">\r\n\t<iframe src=\"http://gfycat.com/ifr/FirmInfamousAmericanpainthorse\" scrolling=\"no\" style=\"-webkit-backface-visibility: hidden;-webkit-transform: scale(1);\" frameborder=\"0\" height=\"480\" width=\"292\">\r\n\t</iframe>\r\n</p><p style=\"max-width: 480px; margin-left: auto; margin-right: auto; margin-top:-0.75rem\">Pro: Persistent display of Follow button and status; Clear spatial association between name and follow status; Removes confusing history back action from name interaction\r\n</p><p style=\"max-width: 480px; margin-left: auto; margin-right: auto;\">Con: Spatially disconnected from original follow button; Visually distinct from original follow button; Requires discovery of purpose\r\n</p><p style=\"text-align: center;margin-top:4rem;\"><strong>Option 3: Display Follow/Unfollow in overflow menu</strong>\r\n</p><p style=\"text-align: center;padding-left:0.5rem;margin-top:2rem;margin-bottom:1.5rem;\">\r\n\t<iframe src=\"http://gfycat.com/ifr/SophisticatedReadyCat\" scrolling=\"no\" style=\"-webkit-backface-visibility: hidden;-webkit-transform: scale(1);\" frameborder=\"0\" height=\"480\" width=\"292\">\r\n\t</iframe>\r\n</p><p style=\"max-width: 480px; margin-left: auto; margin-right: auto; margin-top:-0.75rem\">Con: Further complicates overflow menu; Requires discovery of existence\r\n</p><p style=\"margin-top:2rem;\">These prototypes, along with the original stock prototype, were tested with six of the eight original web-only users and 11 mobile-primary users. Because of the limited time available and informal nature of this test session, I again presented the users with a single, simple task to be executed on each of the four prototypes:\r\n</p><p style=\"font-size:1.5rem\"><em>“Read enough tweets to decide to follow and then follow this profile”</em>\r\n</p><p>Each user was then asked which version allowed them to most easily complete the above task, and only two indicated the current approach (scrolling up to Follow). Of the rest,\r\n</p><ul>\r\n\t<li>12 stated a preference for option 1 (Follow button in actionbar)</li>\r\n\t<li>3 preferred option 2 (Action bar tweet count replaced by Follow button)</li>\r\n\t<li>0 preferred option 3 (Follow button in overflow)</li>\r\n</ul><p>What’s more, no confusion was observed when engaging with option 1, as Follow actions immediately following cessation of scrolling. With option 2, some users still scrolled back to the original Follow button, and only one user found the overflow Follow button in option 3 before scrolling back to the original Follow button.\r\n</p><h3>Recommendation </h3><p>Based on the feedback gathered from observation, conversation, and my own experience and instincts, adding a Follow button to the action bar on scroll is the clearly preferred method of handling non-immediate following. This also appears to be the option least disruptive to the UI, especially given my lack of direct knowledge of the research, business goals, etc. that helped to determine the current design, and the easiest for the development team to implement.\r\n</p><p>I personally like some aspects of option 2 as I find the tweet count by itself lacking in useful or actionable information. Also, breaking up that history back button would reduce the number of unexpected returns to the main timeline. That option, however, has its own issues related to visibility and button consistency. Option 3 is the quickest of quick fixes and should be used only as a stop-gap measure, if at all.\r\n</p><h3 style=\"margin-top:1.5rem\">Hunting For Deeper Meaning</h3><p>I’m confident in the above recommendation as a solution to the discrete issue of the disappearing Follow button but, again, am intensely curious as to the thinking and requirements that led to the UI’s current behavior. Looked at in a vacuum, just about any design decision can be second guessed, and the maturity of a designer or design team can be measured by its ability to accept a superficial design flaw in service to a deeper design or business goal.\r\n</p><br><em>If @design or anyone else has additional insight into this aspect of the UI or would like to point out something blatantly obvious that I missed, I’d love to continue the conversation </em><a href=\"http://twitter.com/dantepassera\"><em>on Twitter</em></a><em> or in the comments below.<p><br></p><p>Cover photo by <a href=\"https://www.flickr.com/photos/mkhmarketing/\" class=\"owner-name truncate\" title=\"Go to mkhmarketing's photostream\" data-track=\"attributionNameClick\" data-rapid_p=\"35\">mkhmarketing</a>.</p></em>",
  "slug": "twitter-app-design",
  "slug_history": "---\n- new-blog-post\n",
  "visits": 1271,
  "published": "2015-07-14T08:00:00+00:00",
  "authorName": "",
  "category_id": 3,
  "image_uid": "2015/07/14/15/36/12/156/file",
  "created_at": "2015-07-08T16:26:17+00:00",
  "updated_at": "2015-07-14T19:39:57+00:00",
  "markdown": "",
  "image_alt_text": "twitter app design",
  "featured": true,
  "database_id": 385,
  "category": {
    "type": "Entry",
    "id": "category_3"
  },
  "tags": [
    {
      "type": "tag",
      "id": "tag_8"
    },
    {
      "type": "tag",
      "id": "tag_13"
    },
    {
      "type": "tag",
      "id": "tag_8"
    },
    {
      "type": "tag",
      "id": "tag_13"
    }
  ],
  "authors": [
    {
      "type": "employee",
      "id": "employee_8"
    },
    {
      "type": "employee",
      "id": "employee_8"
    }
  ]
}