{
  "id": "post_230",
  "title": "The Impact of Healthcare IT:  Entrepreneurial Vistas",
  "summary": "The third and final installment of an interview series with Dr. Mark Braunstein, Director of the Health Systems Institute at Georgia Tech, and columnist at InformationWeek. We all hate to think of our industry as being a “trailing edge industry,” but until recently that’s where the healthcare information technology sector was firmly seated – at…",
  "body": "<p>\r\n\t<em>The third and final installment of an interview series with Dr. Mark Braunstein, Director of the Health Systems Institute at Georgia Tech, and columnist at InformationWeek. </em></p><p>\r\n\tWe all hate to think of our industry as being a “trailing edge industry,” but until recently that’s where the healthcare information technology sector was firmly seated – at least, in America. Recent advances in technology, combined with the sweeping overhauls coming with the Affordable Care Act, there has been no better time for entrepreneurs to grab the horns and ride this opportunity to success. Dr. Braunstein offers some insight into where one should start when looking for these opportunities.</p><h3>\r\n\tHealth Engagement: <em>Go Mobile</em>\r\n</h3><p>\r\n\tAccording to Braunstein, an important way for entrepreneurs to get a foothold is to look at the population of patients.  “When patients need to see multiple specialists and comply with 3 or often more different doctors’ orders, following those orders can be a very difficult task,” said Braunstein. “New mobile apps make it easier to engage with your provider – and the insurance company. New apps are released regularly, but no one really owns that market yet. There’s still great opportunity for the company that finds an engagement method that really keeps people enthused.”</p><p>\r\n\tThere are a lot of mobile apps touting healthcare as their category. But a study came out in October of 2013 pointing out that, of the 43,000+ classified as mobile health apps, only 23,682 performed a legitimate health function. In other words, there is a lot of ‘junk’ and therefore a lot of opportunity. If you’re looking for insight on what apps might still have market value, the IMS Institute for Healthcare Informatics has a lot of inspiring data for you. I found <a href=\"http://www.imshealth.com/deployedfiles/imshealth/Global/Content/Corporate/IMS%20Health%20Institute/Reports/Patient_Apps/IIHI_Patient_Apps_Report.pdf\">this pdf</a> to be particularly interesting.</p><p>\r\n\tBut according to Braunstein, the Holy Grail for mobile healthcare apps remains the ability to engage. The two most popular categories at this time address changing patient behavior (diet, exercise, etc.) and improving how consumers follow their prescribed treatment regimen. The real trick for success in either of these categories is to find a way to keep the consumer engaged.<br>\r\n\t<em>(editor’s note: watch for a new white paper from Smashing Boxes on mobile health and medication non-adherence)</em></p><h3>\r\n\te-Records: <em>Go Cloud</em>\r\n</h3><p>\r\n\tNot surprisingly, Braunstein is bullish on the opportunities for entrepreneurs in the world of electronic records management, sometimes called EHR or EMR.</p><p>\r\n\t“Here’s a picture of where the growth will come from,” he says, as he leads us down through the recent history of medical records. “Right now, only 50% of primary care doctors are committed to implementing systems that require health care records be posted to EMR systems.  Only 75% of hospitals have thoroughly implemented a system. These doctors will soon have to get on board or part ways with their networks, because it will all be electronic in the near future.”</p><p>\r\n\tEvery organization that undertakes patient care across the country is moving or has moved to an electronic healthcare records management system.  Opportunities continue to abound, however. Many aspects of the care system have yet to be ‘plugged in.’ The incentive to change habits and expenditures is now in place.</p><p>\r\n\tSome estimate that healthcare technology is a $30 Billion industry – with room to grow. Those funding new companies understand this and are looking for better ways to use data and to engage patients&hellip; especially as doctors are now required to share data with patients. The cost of providing healthcare will drop significantly when the financial incentive is put into place, because not only does technology positively impact lower cost for care, but also more superior results.</p><h3>\r\n\tWhere to look for ideas\r\n</h3><p>\r\n\tThe best way to find a real market need is to clearly understand the needs of the market!  Braunstein suggested that some upstarts might begin with where the money is today: Medicare/Medicaid. Opportunities become clear once you get to know the concerns of the more than 300 <a href=\"http://www.cms.gov/Medicare/Medicare-Fee-for-Service-Payment/ACO/index.html?redirect=/ACO/\">Accountable Care Organizations</a> that are within the United States today. These groups of doctors, hospitals and other patient care organizations have come together voluntarily in order to give high quality, highly coordinated patient care. They are changing the way care is given today – and it’s the technology behind their work that’s allowing for that change.</p><p>\r\n\tIt might help for aspiring entrepreneurs to look into the field of Healthcare IT before thinking about the business they might start. In fact – it pays pretty well, as burgeoning fields often do. According to a <a href=\"http://www.ihealthbeat.org/picture-of-health/2014/what-is-the-average-health-it-salary-throughout-the-us\">January 14<sup>th</sup>, 2014 report</a> from the Healthcare Information and Management Systems Society, the average salary for Healthcare IT pros is $113,000 per year. That’s not executives – that’s the average across all levels.</p><h5>\r\n\t<strong>Want more?</strong>\r\n</h5><p>\r\n\tThis industry is vast, complex and growing. We can’t realistically cover, in just three short blog posts, half of what we learned from Braunstein during this interview because each point he made led us down yet another path of research.</p><p>\r\n\tIf you’re interested in knowing more, here are two suggestions:</p><ol>\r\n\t\r\n<li>Take Braunstein’s course: Georgia Tech has set up a MOOC (Massive Open Online Course) on Health Informatics in the Cloud. <a href=\"https://www.coursera.org/instructor/braunstein\">Contact Braunstein</a> to learn more about when the next course starts. Information on his most recent course is available <a href=\"https://www.coursera.org/course/healthinformatics\">here</a>.</li>\t\r\n<li>\r\n\t<strong></strong>Attend the <a href=\"http://www.cednc.org/lifescience\">CED Life Science Conference 2014</a>. CED, NCBio and North Carolina Biotechnology Association have put together an amazing conference to offer ideas for how to navigate and prepare for “Healthcare in 2020.” You’ll hear from the Commissioner of the FDA, from the former Commissioner of Social Security, many of the leading CEOs in pharma and healthcare technology, and more. A great investment for those considering a future in Healthcare IT.<strong></strong>\r\n\t</li></ol><p>\r\n\tTo learn more about the landscape of Healthcare IT read <a href=\"/ideas/the-impact-of-healthcare-it/\">The Impact of Healthcare IT Part 1: The Lay of the Land</a> and <a href=\"/ideas/the-impact-of-healthcare-it-part-2/\">The Impact of Healthcare IT Part 2: Big Data, Big Cloud, Big Finance</a>.</p><p><em>Smashing Boxes is a web and mobile app development company know for creating a lasting experience through bold design and disrupting the status quo. We are entrepreneurs and craftsmen first, and a digital creative agency second. Inspired by our visionary clients, we transform ideas into innovative web and mobile applications. </em><a href=\"http://smashingboxes.com/work\">Take a look at our work.</a></p><p><em>\r\n\tCover image by&nbsp;</em><a href=\"http://www.avelamedia.com/\" style=\"background-color: initial;\"><em>Chris Brignola</em></a></p>",
  "slug": "the-impact-of-healthcare-it-part-3",
  "slug_history": "--- []\n",
  "visits": 1132,
  "published": "2014-01-29T05:00:00+00:00",
  "authorName": "Katie McMillan",
  "category_id": 4,
  "image_uid": "2014/07/28/17/26/35/523/file",
  "created_at": "2014-06-05T18:21:20+00:00",
  "updated_at": "2014-07-31T20:03:15+00:00",
  "markdown": null,
  "image_alt_text": null,
  "featured": false,
  "database_id": 230,
  "category": {
    "type": "Entry",
    "id": "category_4"
  },
  "authors": [
    {
      "type": "employee",
      "id": "employee_59"
    },
    {
      "type": "employee",
      "id": "employee_59"
    }
  ]
}