{
  "id": "post_229",
  "title": "Porsche By Design",
  "summary": "Earlier this month, our Experience Design department took a field trip to the Porsche by Design exhibit at the North Carolina Museum of Art. Exploring the history and development of the Porsche lineage from the 1930s to today, the exhibit featured dozens of cars, accompanied by videos and photographs, that helped the team to reflect…",
  "body": "<p>\r\n\tEarlier this month, our Experience Design department took a field trip to the \r\n\t<a href=\"http://ncartmuseum.org/exhibition/porsche-by-design-seducing-speed\">Porsche by Design</a> exhibit at the <a href=\"http://ncartmuseum.org/\">North Carolina Museum of Art</a>. Exploring the history and development of the Porsche lineage from the 1930s to today, the exhibit featured dozens of cars, accompanied by videos and photographs, that helped the team to reflect on the experience engendered by their singular design and engineering. The following are our design team’s thoughts and reactions upon visiting the exhibit</p><p dir=\"ltr\" style=\"text-align: center;\">\r\n\t<a href=\"http://sbblog.s3.amazonaws.com/wp-content/uploads/2014/02/porsche_1.jpg\"><img class=\"size-full wp-image-4711 aligncenter\" alt=\"porsche_1\" src=\"http://sbblog.s3.amazonaws.com/wp-content/uploads/2014/02/porsche_1.jpg\" width=\"623\" height=\"470\"></a></p><h5 dir=\"ltr\">\r\n<strong>Dante (Director of User Experience)</strong>\r\n</h5><p dir=\"ltr\">\r\n\tOn the surface, there are two obvious themes running through the Porsche by Design exhibit: 1) precision design and engineering and 2) the emotional connection between machine and operator. The vehicles were, of course, striking, but the part of the exhibit that most resonated with me were the accompanying photographs of engineers, factory workers, and the Porsche family, themselves. It’s interesting how we glorify beautiful objects, while somehow forgetting that flesh and blood human beings actually conceived of, designed, and built the objects. Their humanity and vision drove their craft and set their creations apart. Just as important to me were the people to whom these cars belonged. Again, these were real, live people with a passion (sometimes an obsession) for a particular feeling that only a Porsche could give them. I, personally, am a \r\n\t<a href=\"http://en.wikipedia.org/wiki/Mopar\">Mopar</a> man, but those cars weren’t built for me. They weren’t built for my grandma and they weren’t built based on a persona created by a research department. They were built for Porsche drivers, a market that didn’t exist until the first Porsches started rolling out of the workshop.</p><p dir=\"ltr\">\r\n\tSo why did that move me? Why is it important at all? It’s simple – if a group of men created enduring beauty that speaks to something in the hearts of other men, then so could I. That’s maybe the most trite, cliche thing I’ve ever written, but it’s a desire that I’ve felt is sometimes lacking in the user experience field. There’s a tendency to design based solely on convention, frameworks, and the insights of a select few “thought leaders”. That’s a great way to deliver something that won’t fail, but should avoiding failure be your goal as a UX professional? Or should it be to innovate and inspire wherever possible? Should you make important decisions based on research that’s been abstracted and extrapolated to the point of losing all basis in reality, or should you rely on your instinct, your gut? I know that there’s a place for plug-n-chug, and I’m not one to reinvent the wheel, but it’s incumbent on us to take every opportunity to inject our humanity into the products that we build. If your average UX team is comfortable building Honda Civics for a wide swath of people to be completely stupefied by, that’s great. There’s a place for that. Me, I want to build Porsches.</p><p style=\"text-align: center;\">\r\n\t<a href=\"http://sbblog.s3.amazonaws.com/wp-content/uploads/2014/02/porsche_2.jpg\"><img class=\"size-full wp-image-4712 aligncenter\" alt=\"porsche_2\" src=\"http://sbblog.s3.amazonaws.com/wp-content/uploads/2014/02/porsche_2.jpg\" width=\"623\" height=\"470\"></a></p><h5 dir=\"ltr\">\r\n<strong>Lucas (User Experience)</strong>\r\n</h5><p dir=\"ltr\">\r\n\tEach model, from the \r\n\t<a href=\"http://en.wikipedia.org/wiki/Porsche_356\">356</a> (first produced in 1948) all the way up to more recent <a href=\"http://www.porsche.com/usa/models/911/\">911</a> models, was both unique and also connected to the overall evolution of Porsche design. Frame and body design, headlight housing, interior cabins, exhaust systems, paint jobs, etc., varied greatly between models, but you always knew you were looking at a Porsche. It seemed each design achieved a high level of style and character primarily through the exceptional care taken to exceed functional requirements. By artfully meeting functional needs and working with strong overall design foundations of the Porsche brand, designers were able to go in bold new directions. The evolution of design within the Porsche line seemed to serve as a foundation for the transition to new and innovative designs. In the following <a href=\"http://vimeo.com/78937043\">video</a>, Daniel Weil does a great job of articulating&nbsp;the thought process that&nbsp;designers go through as a product design is developed and refined over time. Although the product is extremely different (in Weil’s case it is a baby bottle), the overall care taken to address functional requirements is not unlike Porsche design.</p><h5 dir=\"ltr\">\r\n<strong>Doug (Design)</strong>\r\n</h5><p dir=\"ltr\">\r\n\tThe thing that stuck out to me the most when our team visited the NC Art Museum’s Porsche By Design exhibit was the elegant simplicity of some of the earlier models of Porsches. The colors were classic, the curves were refined, the details were subtle, and the racing liveries were bold. In my opinion, the older models felt like they were a lot more in line with the designers’ initial visions even keeping in mind the fact that times have changed, technology has changed, and that design trends have come and gone.</p><p dir=\"ltr\">\r\n\tI think it was Da Vinci who said, “Simplicity is the ultimate sophistication.” Porsche has always created amazing cars, but those earlier models were really amazing. Stripped of, or altogether void of, the amenities and nice-to-haves that are commonplace on today’s cars (I don’t think I saw a single cup holder in the exhibit). They had a unified and balanced feel to them. Getting to see all of these cars was really inspirational and it got me thinking about the work that I do. It seems all too common today to jam-pack cars, web pages, logos, songs, you name it, with far too much unnecessary&hellip;stuff. So whether we’re talking about features, content, colors, elements, or shiny distractions, the most memorable solutions are often the most simple. /rant</p><p dir=\"ltr\">\r\n\tAll in all though, this exhibit was awesome. It was really cool to see all of these cars and some of the concept cars that never made it to production.</p><p dir=\"ltr\" style=\"text-align: center;\">\r\n\t<a href=\"http://sbblog.s3.amazonaws.com/wp-content/uploads/2014/02/photo-6.jpg\"><img class=\" wp-image-4720 aligncenter\" alt=\"photo (6)\" src=\"http://sbblog.s3.amazonaws.com/wp-content/uploads/2014/02/photo-6.jpg\" width=\"564\" height=\"423\"></a></p><h5 dir=\"ltr\">\r\n<strong>Raleigh (Director of Design)</strong>\r\n</h5><p dir=\"ltr\">\r\n\tWhen thinking about “design” at Smashing Boxes we do not just think about how something looks. We approach design as the overall experience of the users exploring our sites or applications we have built.</p><p dir=\"ltr\">\r\n\tThe design department loves and lives by this R. Buckminster Fuller quote: “When I am working on a problem, I never think about beauty but when I have finished, if the solution is not beautiful, I know it is wrong.”</p><p dir=\"ltr\">\r\n\tThe Porsche exhibit was a great display of beautifully designed machinery. When I say “designed,” I am not referencing just the outer body of the car, which is by the way, very pleasing to the eye. I am talking about the overall car itself. Everything on a Porsche is designed intentionally, there is little to no fluff. For everything that makes up the vehicle, there is a reason. Porsche cars perform at the highest level all the while looking beautiful.</p><p dir=\"ltr\">\r\n\tAt Smashing Boxes, we approach every project by asking the question, “How can we build something that performs well and looks great?” We try and look at design the same way Porsche does &mdash; if an application looks nice, but doesn’t perform well, then it is not designed. Similarly, the app is not well designed if it has optimal performance, but is not appealing to the eye. We care about how it functions, how it performs, and how it looks.</p><p dir=\"ltr\" style=\"text-align: center;\">\r\n\t<a href=\"http://sbblog.s3.amazonaws.com/wp-content/uploads/2014/02/porsche_3.jpg\"><img class=\"size-full wp-image-4713 aligncenter\" alt=\"porsche_3\" src=\"http://sbblog.s3.amazonaws.com/wp-content/uploads/2014/02/porsche_3.jpg\" width=\"623\" height=\"470\"></a></p><p dir=\"ltr\">\r\n\tA quote beside the Porsche 356 that said, “People who own Porsche’s may be anything from industrial tycoon to freelance artist, but they all have two things in common: 1) When they want to go, they want to go; they don’t want temperament, delay, or fussiness in their automobiles; 2) They don’t live in ugly houses, they don’t wear ugly clothes, and they don’t drive ugly automobiles.” “You almost never see a Porsche driver who looks bored.</p><p dir=\"ltr\">\r\n\tWe want the same thing to be said about the products we build. We make sure users are not temperamental, delayed, or frustrated in the experiences we “design.” We also want people to look at our visual design and understand the confidence it brings to the user. In the end we want every user to have nice, well-crafted experiences with everything we build.</p><p dir=\"ltr\">\r\n\tWe’d love to hear your thoughts about the Porsche by Design exhibit, Porsche, or design. Let us know if you visited the exhibit and have any design-related thoughts to share by commenting below.</p><p dir=\"ltr\"></p><p><a href=\"http://smashingboxes.com/work\"></a></p><p><em>Check out our latest design work and experimentation on </em><a href=\"http://dribbble.com/smashingboxes\">Dribbble</a><em>.&nbsp;</em></p>",
  "slug": "porsche-by-design",
  "slug_history": "--- []\n",
  "visits": 993,
  "published": "2014-02-04T10:00:00+00:00",
  "authorName": "Raleigh Felton",
  "category_id": 3,
  "image_uid": "2014/07/29/12/05/27/185/file",
  "created_at": "2014-06-05T18:21:18+00:00",
  "updated_at": "2014-12-18T23:09:32+00:00",
  "markdown": "",
  "image_alt_text": null,
  "featured": false,
  "database_id": 229,
  "category": {
    "type": "Entry",
    "id": "category_3"
  },
  "authors": [
    {
      "type": "employee",
      "id": "employee_46"
    },
    {
      "type": "employee",
      "id": "employee_46"
    }
  ]
}