{
  "id": "emloyee_62",
  "Name": "Brian Fischer",
  "Title": "President",
  "mugshot_uid": "2014/08/01/13/11/42/641/file",
  "About": "<p>As the founder of Smashing Boxes, I have consulted with and developed innovative technology solutions for numerous large companies around the country including: Cisco, Sony, Red Hat, Duke, UNC, Malaria No More, Quintiles and many others. I have years of experience in software and product solutions, particularly in the analysis, planning, design, and implementation of large-scale solutions. My current focus is working with clients to identify opportunities within their organizations for high ROI technology solutions.</p><p>I'm a North Carolina native, growing up in Apex. After high school I stayed close by and attended NC State University, but left after a semester to attend an art school where I studied Graphic Design and Multimedia. After two years diving into the graphic design world I left to pursue another passion and went on staff with Young Life in Raleigh, NC.After four amazing years on the Young Life staff, I felt the creative industry pulling me back, and took a position as the Creative Director at a large corporation in Charlotte, NC. Still possessing that entrepreneurial bug and seeing opportunity everywhere, I started my own company in 2008 as a design and web consultant for small businesses. After collaborating with SB cofounder Nick Jordan on a few projects, we started Smashing Boxes in 2010.<br></p><p>My other passion is my family. I have a beautiful wife Krista who is my best friend; I can’t imagine life without her. We have two amazing kids, my six-year-old son named Oak and three-year-old daughter Lawson. When I'm not building Lego sets or singing \"Let it Go\" you can find me enjoying time with my friends, brewing beer, serving at Hope Community Church with the three through five year olds, watching The Walking Dead, or playing golf.</p>",
  "image_uid": "2014/08/01/13/11/34/895/file",
  "Slug": "brian-fischer",
  "Email": "brian@smashingboxes.com",
  "encrypted_password": "$2a$10$7XHFFknZfgybf693AUPiKeND7CALtAjuVfeUDuGy6rKEPRSo2QDGe",
  "reset_password_token": null,
  "reset_password_sent_at": null,
  "remember_created_at": null,
  "sign_in_count": 0,
  "current_sign_in_at": null,
  "last_sign_in_at": null,
  "current_sign_in_ip": null,
  "last_sign_in_ip": null,
  "failed_attempts": 0,
  "unlock_token": null,
  "locked_at": null,
  "created_at": "2014-07-24T17:27:43+00:00",
  "updated_at": "2015-08-11T19:57:40+00:00",
  "Seniority": -8388602,
  "Published": true,
  "Imagealttext": "",
  "Mugshotalttext": "",
  "database_id": 62
}