{
  "id": "emloyee_73",
  "Name": "Ben Mickey",
  "Title": "Project Manager",
  "mugshot_uid": "2014/11/24/11/52/38/468/file",
  "About": "<p>Above all, I am a team player and enjoy working with other passionate people who share a desire to create great work together and have fun doing it. I’m a project manager by trade here at Smashing Boxes and enjoy collaborating with teams to build unique applications that creatively impact people's lives.</p><p>Beyond project management, I'm definitely a hybrid of sorts and enjoy working in a variety of areas. I enjoy attending hackathons on weekends and coding with friends on side projects when time allows. I am from North Carolina originally and love it here, but just recently relocated with my wife to Durham from an enriching and extended jaunt in New York City.  I studied business at UNC-Chapel Hill but read books in between late night excel sessions to finish an English minor. &nbsp;</p><p>Over the past several years I've been fortunate to gain some unique and rewarding experiences that I’m truly grateful for.  I completed a post-baccalaureate program in Computer Science at Columbia University in New York, where I learned, among other things, Java and C.   This also led to a rewarding summer program in New York with a Y Combinator company, MakeGamesWith.Us.  During this program I learned a lot about the YC process and also Objective-C as I designed, developed, and shipped an original iOS game called&nbsp;Settle The Tab.&nbsp;</p><p>I believe in transparency, humility, and hard work.  I’m constantly striving to learn and grow in my craft and realize it's a lifelong pursuit.  I love spending time with my wife, reading books, cooking, fishing, hunting birds with our dog Poet, and playing sports of almost any kind (even if I’m terrible).  I’m also interested in music and am hopelessly trying to learn how to play the banjo or break it trying...&nbsp;</p>",
  "image_uid": "2014/11/24/12/01/04/419/file",
  "Slug": "ben-mickey",
  "Email": "ben@smashingboxes.com",
  "encrypted_password": "$2a$10$U1r7eS2jRGLWAxfTx8cIeetIn.9c5vfFLCFJzN6bS/5pui6KG5pJa",
  "reset_password_token": null,
  "reset_password_sent_at": null,
  "remember_created_at": null,
  "sign_in_count": 0,
  "current_sign_in_at": null,
  "last_sign_in_at": null,
  "current_sign_in_ip": null,
  "last_sign_in_ip": null,
  "failed_attempts": 0,
  "unlock_token": null,
  "locked_at": null,
  "created_at": "2014-11-24T17:01:09+00:00",
  "updated_at": "2015-02-17T16:04:44+00:00",
  "Seniority": -8388570,
  "Published": true,
  "Imagealttext": "",
  "Mugshotalttext": "",
  "database_id": 73
}