{
  "id": "emloyee_78",
  "Name": "Spencer Horn",
  "Title": "Senior QA Specialist",
  "mugshot_uid": "2015/04/06/11/23/09/251/file",
  "About": "<p>I grew up in Southern California just&nbsp;two&nbsp;miles from the ocean where I spent any&nbsp;free time I had at the beach; mostly in the water. My first love was the ocean but as I grew a bit older a new passion emerged -&nbsp;technology. In my early teens I had a dedicated phone line installed in my room to run a BBS and practice ANSI art. Later I discovered HTML and began developing web pages for small companies in the area. I had a strong appetite for&nbsp;information that was only temporarily satiated&nbsp;by learning something new.</p><p>Now as an adult,&nbsp;that curiosity and hunger is still very much alive. At Smashing Boxes, I am able to indulge my passion by ensuring the products we create are both beautiful and functional, exceeding the highest standards for software quality.&nbsp;</p><p>My broad-based skill set extends beyond technology as well. In my personal time I enjoy woodworking, crocheting, smoking fine meats and brewing delicious libations. You wouldn't be surprised to find me at a Bulls game or hiking the Eno river with my family.</p>",
  "image_uid": "2015/04/06/11/56/30/868/file",
  "Slug": "spencer-horn",
  "Email": "spencer.horn@smashingboxes.com",
  "encrypted_password": "$2a$10$n85JLte2e9KTC7WGEQh3puKE7Qz/eR88IzOvFV88FI7GSFbkPdwOu",
  "reset_password_token": "gpifyDNxerGGT5hKts1q",
  "reset_password_sent_at": null,
  "remember_created_at": null,
  "sign_in_count": 2,
  "current_sign_in_at": "2015-08-07T12:55:52+00:00",
  "last_sign_in_at": "2015-06-11T15:44:29+00:00",
  "current_sign_in_ip": "104.240.253.17",
  "last_sign_in_ip": "104.240.253.17",
  "failed_attempts": 0,
  "unlock_token": null,
  "locked_at": null,
  "created_at": "2015-04-06T15:23:19+00:00",
  "updated_at": "2015-08-07T12:55:52+00:00",
  "Seniority": -8388464,
  "Published": true,
  "Imagealttext": "",
  "Mugshotalttext": "",
  "database_id": 78
}