{
  "id": "emloyee_80",
  "Name": "Meredith Schomburg",
  "Title": "Designer",
  "mugshot_uid": "2015/08/14/16/12/34/626/file",
  "About": "<p>As a designer I am an advocate for human-centered research, clever visual solutions and witty storytelling. I am constantly looking for ways to use design as an opportunity to serve others and solve problems.</p><p>A native to Raleigh and recent graduate of the College of Design at NC State, I am passionate about contributing to and helping grow the creative community of Raleigh and Durham - it’s one of the many reasons I chose to stick around the area a bit longer. Prior to joining Smashing Boxes I interned as a communications designer at IDEO Boston, where I fell even more in love with the process of complex design thinking and creative problem solving. While finishing up school I also jumped around as a freelancer for a variety of clients where I focused on helping establish better brand identities. </p><p>I constantly seek out opportunities to learn new things, be it design related or not. I am continually intrigued by the world of fashion, and my side passion projects often involve some sort of collaboration with a designer or maker in that field. When I’m not working away on some sort of design endeavor, I’m with people - I’m your classic extrovert. Sure, I have hobbies, but I really just enjoy doing life with others, whatever activity that entails. Exploring and trying new things are immensely more exciting to me when it involves fellow humans. </p>",
  "image_uid": "2015/06/08/10/06/06/704/file",
  "Slug": "meredith-schomburg",
  "Email": "meredith@smashingboxes.com",
  "encrypted_password": "$2a$10$ZWKXF0KaZyfazk1rZUwQVuMwe5UYL0/EQfS7am1iiJCpAu61KYw66",
  "reset_password_token": null,
  "reset_password_sent_at": null,
  "remember_created_at": null,
  "sign_in_count": 0,
  "current_sign_in_at": null,
  "last_sign_in_at": null,
  "current_sign_in_ip": null,
  "last_sign_in_ip": null,
  "failed_attempts": 0,
  "unlock_token": null,
  "locked_at": null,
  "created_at": "2015-06-08T14:07:00+00:00",
  "updated_at": "2015-08-14T20:12:38+00:00",
  "Seniority": -8388507,
  "Published": true,
  "Imagealttext": "",
  "Mugshotalttext": "",
  "database_id": 80
}