{
  "id": "post_372",
  "Title": "A New UI For Santa's Sleigh!",
  "Summary": "Santa’s  Sleigh System was in need of some serious upgrades. So when he approached about creating a new User Interface for his sleigh, we were delighted to help out.",
  "Body": "<p>Each Christmas Eve, Santa Claus straps on his boots, harnesses his reindeer, and kisses Mrs. Claus goodbye before racing West across the globe to deliver presents to millions of children. The scientific community understands this feat to be the product of magic. Yet, Santa’s magic isn't foolproof, and it only works when kids believe in the spirit of Christmas. Santa’s previous Sleigh System was built in the 90's and was in need of serious upgrades. So when Santa approached us with the opportunity to build a new User Interface for his sleigh, we were delighted to help out.</p><p><img src=\"/media/W1siZiIsIjIwMTQvMTIvMjMvMTAvMTUvMzcvMTUzL19EU0MyMTAwX3dlYi5qcGciXV0/_DSC2100_web.jpg?sha=a07fa5a1\"></p><p>Time was of the essence! So, we assembled a top notch team of UI designers and Android developers and invited Santa to visit our office.&nbsp;</p><p><img src=\"http://smashingboxes.com/media/W1siZiIsIjIwMTQvMTIvMjMvMTAvMTcvNDAvMzYyL19EU0MyMTY3X3dlYi5qcGciXV0/_DSC2167_web.jpg?sha=c795ca9e\" style=\"font-family: Roboto,sans-serif;\"></p><p>After some collaborative sketch sessions and usability testing, we set to work creating an interface that would provide Santa with critical performance stats and hands-free navigation.</p><p><img src=\"http://smashingboxes.com/media/W1siZiIsIjIwMTQvMTIvMjMvMTAvMTYvMTQvNjU4L19EU0MyMDc5X3dlYi5qcGciXV0/_DSC2079_web.jpg?sha=f4bb7424\" style=\"font-family: Roboto,sans-serif;\"></p><p>We employed some technological magic of our own. Our solution automatically selects Santa’s best flight path based on weather conditions, commercial flight paths, and bird migration patterns. At a glance, Santa can view upcoming deliveries, time remaining until sunrise, and if a child has been naughty or nice. Santa and his reindeer’s safety is of utmost importance so we built in functionality that allows him to see energy reserves of his reindeer, turn on Rudolf’s nose in poor conditions, and enjoy hands free communication with Mrs. Claus and the elves.&nbsp;To create the UI, our designers used icons created by&nbsp;<a href=\"http://iconsmind.com/\">Iconsmind</a>,&nbsp;<a href=\"http://thenounproject.com/paulstevens\" style=\"background-color: initial;\" target=\"_blank\">Paul Stevens</a>, and&nbsp;<a href=\"http://thenounproject.com/Mattebrooks/\" target=\"_blank\" style=\"background-color: initial;\">Matt Brooks</a>. Want to take a closer look? You can download the&nbsp;<a href=\"https://dribbble.com/shots/1857931-Santa-s-UI\" target=\"_blank\">source file on Dribbble</a>. &nbsp;</p><p><img src=\"/media/W1siZiIsIjIwMTQvMTIvMjMvMTIvMzQvNTMvMjQvc2FudGFfdWkuanBnIl1d/santa-ui.jpg?sha=37f1bf05\"></p><p>Of course, after all the hard&nbsp;work was done,&nbsp;there was still time for some fun!</p><p><img src=\"/media/W1siZiIsIjIwMTQvMTIvMjMvMTAvMTkvMzkvODIyL19EU0MyMTMzX3dlYi5qcGciXV0/_DSC2133_web.jpg?sha=c44f5fa8\"></p><p>If you've been good this year, our robust and powerful app will seamlessly guide Santa to your house. If you've been bad, well&hellip;that’s on you.&nbsp;</p>",
  "Slug": "a-new-ui-for-santas-sleigh",
  "slug_history": "--- []\n",
  "visits": 1267,
  "Published": "2014-12-23T10:00:00+00:00",
  "Authorname": "",
  "category_id": 3,
  "image_uid": "2014/12/23/10/36/21/320/file",
  "created_at": "2014-12-22T17:31:24+00:00",
  "updated_at": "2014-12-23T23:45:19+00:00",
  "markdown": "",
  "image_alt_text": null,
  "featured": false,
  "database_id": 372,
  "category": {
    "type": "Entry",
    "id": "category_3"
  }
}