{
  "id": "post_293",
  "Title": "The Benefit of Feedback Loops",
  "Summary": "As an agency who provides work for hire services to build web and mobile applications, we often encounter a tug-of-war between ourselves and our clients concerning feedback loops. Feedback can take many forms, but in our world it comes as a result of getting apps into users’ hands.",
  "Body": "<p>As an agency who provides work for hire services to build web and mobile applications, we often encounter a tug-of-war between ourselves and our clients concerning feedback loops. Feedback can take many forms, but in our world it comes as a result of getting apps into users’ hands. Project stakeholders, fellow employees, and even customers are part of the feedback ecosystem. They are all capable of giving quality, measurable feedback on an application during its design and development. Feedback allows our team and clients insight into our products that are otherwise unavailable when a project is merely a concept. Armed with insights, the path to deploying a successful application becomes clearer and the client’s investment generates a higher return. Both are possible because the development teams work on what matters most to the project. The result is delivering end users the features that matter most to them.</p><p><a href=\"http://sbblog.s3.amazonaws.com/wp-content/uploads/2012/12/Print.jpg\"><img class=\"aligncenter size-full wp-image-2036\" title=\"The Ideal Feedback Loop\" src=\"http://sbblog.s3.amazonaws.com/wp-content/uploads/2012/12/Print.jpg\" alt=\"Fisch's sketch of the ideal feedback loop\" width=\"371\" height=\"210\"></a></p><p>If feedback loops are so great, then why the antagonism? Typically the answer is budget. Most often startups, non-profits, and Fortune 1000s source their products to us because they don’t have the internal expertise or bandwidth to compete the project. Our clients don’t just want hours of development time, they want a finished product which serves the needs of their organization. Usually, project funding is dependent on deliverables that funding will obtain. While our project leaders and stakeholders understand that dollars equal deliverables, the powers behind the purse strings sometimes do not.</p><p>The issue at hand is not that feedback will destroy a budget. Rather, it is that feedback whether positive or negative may shift the deliverables given the constraints of time and budget. The shift in deliverables is where our clients run into problems with their financiers. Of course feedback does not only impact our clients. Certain types of feedback may slow our development process or disrupt our project calendar. Any source of unpredictability for our weekly or bi-monthly sprints is not exactly desirable.</p><p>The easiest solution as a dev shop is to discourage feedback from an audience outside of our team and our client’s project team. That way, we deliver clean, tested code which meets every requirement defined during our discovery and planning phases. We fulfill the timeline and budget objectives, and can sleep easy knowing the client is satisfied. In the above case, the client and SB simply hope end users will be equally thrilled with how we executed the project. However, our best work is not produced in a vacuum. Rather, SB creates software using a combination of inputs: our insight as development and design experts; our client’s recommendations as SMEs on their product, organization, and business goals; and end users’ suggestions as experts in how they want to use mobile and web devices, and what they want to use them to accomplish.</p><p>At Smashing Boxes we circumvent any feedback related issues through communication and planning. We negotiate willfully for the flexibility to obtain feedback and implement changes as identified by various stakeholders. While introducing a feedback loop to a project seemingly adds time and cost, it’s a necessary step for iterative development. As a result, the end product becomes a truer reflection of the goals our clients initially hired us to attain.</p><p><em>Cover image by </em><a href=\"https://www.flickr.com/photos/coofdy/\"><em>Martin Kenny</em></a><br></p>",
  "Slug": "the-benefit-of-feedback-loops",
  "slug_history": "--- []\n",
  "visits": 1094,
  "Published": "2012-12-04T10:00:00+00:00",
  "Authorname": "Nick Jordan",
  "category_id": 2,
  "image_uid": "2014/07/28/17/23/57/490/file",
  "created_at": "2014-06-05T18:24:37+00:00",
  "updated_at": "2015-06-15T19:24:31+00:00",
  "markdown": "",
  "image_alt_text": "",
  "featured": false,
  "database_id": 293,
  "category": {
    "type": "Entry",
    "id": "category_2"
  }
}