{
  "id": "post_353",
  "Title": "Rails Girls Workshop Gives Women a Taste for Code in the Triangle",
  "Summary": "Smashing Boxes will be hosting the next Rails Girls RDU coding workshop Oct.17-18. Anyone interested in learning basic Ruby on Rails programming is welcome to join. Both women and men can participate.",
  "Body": "<p>“It’s about role models. You can’t be what you cannot see.” - Reshma Saujani</p><p>Girls Who Code founder and chief executive Reshma Saujani believes that so few female developers exist because few have come before them. “If women had been more prominently talked about in computing, both in the history books and schools, we literally would not have the lack of women programmers that we do today,” she told the New York Times in a <a href=\"http://www.nytimes.com/2014/10/02/fashion/the-innovators-by-walter-isaacson-how-women-shaped-technology.html?smid=tw-share&amp;_r=0\" target=\"_blank\">recent article</a>. </p><p>Today, only 0.4 percent of all female college freshmen say they plan to major in computer science, and women make up only about 20 percent of developers at the top three major tech companies (Google, Apple and Facebook).</p><p>To Rails Girls, an international nonprofit that teaches women how to code, those stats are unacceptable. The organization is working to change the current climate by offering free, weekend-long coding workshops across the globe. This year marks the second year the event comes to Durham, to be held Oct.17-18 at Smashing Boxes and the American Underground. </p><p>Last year the event welcomed 22 participants and Rails Girls RDU is hoping to double that this year with about 40 aspiring coders.</p><p>“This event is an amazing opportunity for women,” Smashing Boxes Ruby developer and event coach Lindsay Nauman said. “With such a thriving tech scene in the area, it’s such a hot field to go into, and it’s cool to have all these talented women be a part of it.”</p><p>The event is not limited to women, but they do have priority over men. The weekend is hosted by Smashing Boxes and several coaches including Smashing Boxes and Thoughtbot developers will be part of it. Thoughtbot will also be offering childcare services for those participants with children.</p><p>Participants will learn the basics of Ruby on Rails, build and publish a small Ruby app, and learn about the types of job opportunities available with Rails training. From there, attendees can enhance their skills by attending local Ruby meetups, or applying to a code school for an extensive program. </p><p>If you’re interested in participating in the workshop, apply at <a href=\"http://railsgirls.com/rdu\" target=\"_blank\">railsgirls.com/rdu</a>. Those wanting to coach can email railsgirlsrdu@gmail.com.</p><p>Curious to learn more about learning Ruby on Rails? Consider applying for our next cohort of <a href=\"http://academy.smashingboxes.com/\">Code Academy</a> in January 2015.&nbsp;</p>",
  "Slug": "rails-girls-workshop-gives-women-a-taste-for-code-in-the-triangle",
  "slug_history": "--- []\n",
  "visits": 1158,
  "Published": "2014-10-08T14:07:37+00:00",
  "Authorname": "Laura Smith",
  "category_id": 1,
  "image_uid": "2014/10/08/10/06/45/11/file",
  "created_at": "2014-10-08T13:55:16+00:00",
  "updated_at": "2014-10-09T15:36:47+00:00",
  "markdown": null,
  "image_alt_text": null,
  "featured": false,
  "database_id": 353,
  "category": {
    "type": "Entry",
    "id": "category_1"
  },
  "tags": [
    {
      "type": "tag",
      "id": "tag_2"
    }
  ]
}