{
  "id": "post_223",
  "Title": "No Computer Science Degree? No Problem",
  "Summary": "Like the majority of college graduates, Alison Miller and Lindsay Nauman didn’t major in computer science. In 2009, graduates of their major, communications and journalism, outnumbered computer science majors two to one. As technology continues to grow exponentially worldwide, and demand for developers and engineers hastens, employers are finding themselves in a bind. Computer and…",
  "Body": "<p dir=\"ltr\">\r\n\tLike the majority of college graduates, Alison Miller and Lindsay Nauman didn’t major in computer science. In 2009, graduates of their major, communications and journalism, outnumbered computer science majors \r\n\t<a href=\"http://marginalrevolution.com/marginalrevolution/2011/11/college-has-been-oversold.html\" target=\"_blank\">two to one</a>. As technology continues to grow exponentially worldwide, and demand for developers and engineers hastens, employers are finding themselves in a bind. Computer and mathematical occupations in the U.S. are expected to grow by almost <a href=\"http://www.bls.gov/opub/mlr/2009/11/art5full.pdf\" target=\"_blank\">800,000 jobs by 2018</a>, and it doesn’t take an engineer to tell you that universities are not keeping up with demand.\r\n</p><p dir=\"ltr\" style=\"text-align: center;\">\r\n\t<a href=\"http://sbblog.s3.amazonaws.com/wp-content/uploads/2014/03/alison-miller-Greenville-JS-Q3-2014.jpg\"><img class=\"size-full wp-image-4876 \" alt=\"Alison Miller, a graduate of The Iron Yard Academy in Greenville, SC\" src=\"http://sbblog.s3.amazonaws.com/wp-content/uploads/2014/03/alison-miller-Greenville-JS-Q3-2014.jpg\" width=\"300\" height=\"300\" style=\"display: block; margin: auto;\"></a>\r\n</p><p dir=\"ltr\" style=\"text-align: center;\">\r\n\tAlison Miller, a graduate of The Iron Yard Academy in Greenville, SC\r\n</p><p dir=\"ltr\">\r\n\tMiller, a 2009 graduate of Arizona State University, had only dabbled with HTML and CSS in her job as a digital content editor. “I’d have to say my coding skills were pretty limited,” she recalls.\r\n</p><p dir=\"ltr\">\r\n\tNauman also had \r\n\t<a href=\"http://www.smashingboxes.com/want-to-learn-how-to-code/\">limited coding experience</a>. After graduating from Temple University in 2009, she sent out demo reels to news stations across the country with no luck. While continuing to look for jobs in her field, she made money by bartending and taking on side jobs such as selling real estate, none of which made use of her degree. “A lot of the jobs I was applying for required skills I didn’t have so I took a web design certification program to acquire them. I fell head over heels in love with technology,” says Nauman. She thought she might be able to teach herself to code, but knew it would take considerable time and would be hard to learn that way. “I wanted to be immersed.”\r\n</p><p id=\"attachment_4877\" style=\"margin-left: 8px; text-align: center;\" class=\"wp-caption aligncenter\">\r\n\t<a href=\"http://sbblog.s3.amazonaws.com/wp-content/uploads/2014/03/lindsay.jpg\"><img class=\"size-full wp-image-4877 \" alt=\"Lindsay Nauman\" src=\"http://sbblog.s3.amazonaws.com/wp-content/uploads/2014/03/lindsay.jpg\" width=\"300\" height=\"300\" style=\"display: block; margin: auto; text-align: center;\"></a>Lindsay Nauman, a graduate of Launch Academy in Boston\r\n</p><p dir=\"ltr\">\r\n\tEnter code school; one solution to help close the employment gap and bring motivated individuals an opportunity for career growth. Offering crash courses in high-demand software languages, code schools give non-developers an opportunity to secure a better job with their new programming skills. Typically three months in length, they combine teaching and mentorship with real world development work. “Successful schools center their curriculum around practical application” says Eric Dodds of \r\n\t<a href=\"http://theironyard.com/academy/\" target=\"_blank\">The Iron Yard Academy</a> , a nationally respected code academy based out of Greenville, S.C. “By the end, students emerge as professional, junior-level programmers.” Nauman and Miller are both graduates of a code school, and they’ve found their lives transformed by it.\r\n</p><p dir=\"ltr\">\r\n\tCode academies, when done right, are profoundly challenging. “The information I read about the code school described the academy as boot camp style and super intense,” recalls Nauman who attended \r\n\t<a href=\"http://www.launchacademy.com/\" target=\"_blank\">Launch Academy</a> in Boston. “I completely underestimated what that meant. I have always been able to pick things up quickly so I was like, I’ve got this! It was the hardest, but most rewarding thing I’ve ever done. I spent easily 10-14 hours a day, 7 days a week in school or studying; basically eating, sleeping, and breathing code. It was much harder than I expected.”\r\n</p><p dir=\"ltr\">\r\n\tMiller, who attended The Iron Yard Academy, agrees, “It was overwhelming at first. There were lots of long and stressful nights of coding, and I definitely questioned my ability at times. But, as the program progressed, all of the pieces started falling together.”\r\n</p><p dir=\"ltr\">\r\n\tAfter completing intensive three month courses, neither graduate had trouble finding a programming job. “There were a lot of opportunities for junior software developers,” says Nauman. “I had a ton of interviews, and second interviews. Once you have the skills, the hard part isn’t getting the interviews, it’s making sure you find a company that is a good cultural fit for you. One that encourages continual learning.” She now works as a back-end developer for Smashing Boxes.\r\n</p><p dir=\"ltr\">\r\n\tMiller was able to secure a job as an Interaction Engineer at \r\n\t<a href=\"https://www.benefitfocus.com/\" target=\"_blank\">Benefitfocus</a> by showcasing <a href=\"http://alisonelizabeth.github.io/\" target=\"_blank\">her portfolio </a>on GitHub. “I landed about ten interviews and received three job offers within the first month after completing the program,” says Miller.\r\n</p><p dir=\"ltr\">\r\n\tBoth Miller and Nauman have seen their salaries double since graduating from the program and accredit their success to code school. “I really didn’t know what to expect when I decided to enroll in The Iron Yard Academy,” says Miller, “I was taking a leap, both personally and financially. It definitely paid off. I feel like I have a great career path ahead of me.”\r\n</p><p>\r\n\tNauman couldn’t agree more, “I sometimes stand back and can’t believe this is my life right now. I was bartending and now I’m a software developer at one of the coolest companies ever, working with and learning from such smart people, doing something that excites and challenges me on a daily, no, an hourly basis. I’m literally living my dream.”\r\n</p><p>\r\n\tLearn more about Durham’s first code school, \r\n\t<a href=\"http://academy.smashingboxes.com/\" target=\"_blank\">The Iron Yard Academy powered by Smashing Boxes</a>, at the <a href=\"http://www.americanunderground.com\">American Underground</a>.\r\n</p><p><em>Cover photo by </em><a href=\"https://www.flickr.com/photos/sergiorivas/\"><em>Sergio Rivas</em></a><br></p>",
  "Slug": "no-computer-science-degree-no-problem",
  "slug_history": "--- []\n",
  "visits": 3357,
  "Published": "2014-03-26T08:00:00+00:00",
  "Authorname": "Ellen Clemons",
  "category_id": 1,
  "image_uid": "2014/07/28/17/29/03/565/file",
  "created_at": "2014-06-05T18:21:06+00:00",
  "updated_at": "2015-06-15T19:14:16+00:00",
  "markdown": "",
  "image_alt_text": "",
  "featured": false,
  "database_id": 223,
  "category": {
    "type": "Entry",
    "id": "category_1"
  },
  "tags": [
    {
      "type": "tag",
      "id": "tag_26"
    }
  ]
}