{
  "id": "post_336",
  "Title": "Growth Engineering: Growth Hacking Grown Up",
  "Summary": "You may have heard the terms “Growth Specialist” or “Growth Hacker” before but never quite understood what they were. Maybe you thought they were just buzzwords, or you didn’t even realize they played a role in the marketing world. Well, you’re in the right place to find out the mysteries of “growth.” We’ll give you insight into the next generation of user advocates, Growth Engineers, and why Growth Engineering (GE) is important for you and your business.",
  "Body": "<p>\r\n\tYou may have heard the terms “Growth Specialist” or “Growth Hacker” before but never quite understood what they were. Maybe you thought they were just buzzwords, or you didn’t even realize they played a role in the marketing world. Well, you’re in the right place to find out the mysteries of “growth.” We’ll give you insight into the next generation of user advocates, Growth Engineers, and why Growth Engineering (GE) is important for you and your business.</p><h3>The History of Growth Hacking</h3><p>\r\n\tGrowth Engineering stems from Growth Hacking. Growth Hacking combines marketing with technology and is a technique used primarily by startups that don’t have money or experience to implement a big marketing campaign. Ryan Holliday of <a href=\"http://www.fastcompany.com/3003888/everything-marketing-how-growth-hackers-redefine-game\" target=\"_blank\">Fast Company</a> said, “Because [startups] didn't have access to the \"luxuries\" of an ad budget or the burden of proper training, they were able to be creative enough to broaden the definition of marketing to immense advantage.” The term “<a href=\"http://www.startup-marketing.com/where-are-all-the-growth-hackers/\" target=\"_blank\">growth hacker</a>” was first seen in a blog post by Sean Ellis in 2010. He had meant it to be for the scrappy startups who didn’t have the resources for a traditional approach to market their product. He said, “A growth hacker is a person whose true North is growth,\" meaning every action is done to promote growth.</p><h3>Enter Growth Engineering</h3><p>\r\n\tGrowth Engineering builds on the core principle of Growth Hacking: growing the user base! Accruing users is the sole purpose of anything with “growth” in front of it. Obviously you can’t increase users without using some more traditional marketing strategies and techniques, like social media, email, and content marketing, but the difference is the end goal and the methods used to achieve that goal. The traditional methods focus on brand awareness and thought leadership, drawing people to the site or app in the first place. Growth Engineering focuses on keeping them there, and turning the casual user into a brand advocate. In the great words of <a href=\"https://www.youtube.com/watch?v=DkTb7Pe2MtY\" target=\"_blank\">Tron</a>, “I fight for the users” - that’s what we growth engineers do.</p><p>\r\n\tBut there is more to Growth Engineering than a more grown up name. This brings us to the second great love of growth engineers: data. A large component of Growth Engineering is testing, data mining, and trend analyzing that gives the holistic view of user’s interactions and leads to user retention. Growth engineers want to measure and increase user conversion at every step of the way to truly understand why and which users convert.</p><p style=\"text-align: center;\">\r\n\t<a href=\"http://sbblog.s3.amazonaws.com/wp-content/uploads/2014/07/growth_engineering-3.png\"><img class=\"alignleft size-full wp-image-5487\" alt=\"growth_engineering (3)\" src=\"http://sbblog.s3.amazonaws.com/wp-content/uploads/2014/07/growth_engineering-3.png\" width=\"612\" height=\"1340\"></a></p><h3>Who Benefits from Growth Engineering</h3><p>\r\n\tGrowth services are applicable to businesses with a web or mobile product. For example, a company trying to drive traffic to an ecommerce site and then increase conversions would benefit greatly from Growth services. Their Growth team would be able to test sale funnels, set up heat-maps, analyze retention and referrals, and so on.</p><p>\r\n\tOf course, Growth Engineering is not for everyone. For instance, if a product startup is trying to get brand recognition with a guerrilla marketing campaign, as opposed to a digital marketing initiative, Growth Engineering is not for them.</p><h3>Using Growth Engineering to Compound Your Marketing Efforts</h3><p>\r\n\tTo build upon your current marketing efforts, Growth Engineers can also employ Search Engine Optimization (SEO), Pay Per Click (PPC) ads, and other Search Engine Marketing (SEM) tactics that increase site traffic. The key differentiator between traditional marketing efforts and Growth Engineering is the focus on getting users to stay, convert, and return time after time to use your product. Growth Engineers focus on testable aspects of a site where the data will tell them what is or is not working so they can optimize the user experience.</p><h3>Where Can I Find Growth Engineering Services?</h3><p>\r\n\tWe are excited to announce that Smashing Boxes is now available to assist companies with Growth Engineering. Our team will work with you to develop and implement data-driven, sustainable user growth techniques. Stay tuned to our blog to learn more about the rollout of this new service and how it can impact your bottom line.</p>",
  "Slug": "growth-engineering-growth-hacking-grown-up",
  "slug_history": "---\n- GrowthEngineeringGrowthHackingGrownUp\n- growthengineeringgrowthhackinggrownup\n",
  "visits": 3456,
  "Published": "2014-07-30T21:37:11+00:00",
  "Authorname": "Alicia Midland",
  "category_id": 2,
  "image_uid": "2014/08/01/13/13/57/586/file",
  "created_at": "2014-07-30T17:37:11+00:00",
  "updated_at": "2015-09-14T13:59:17+00:00",
  "markdown": "",
  "image_alt_text": "Smashing Boxes | Growth Engineering ",
  "featured": false,
  "database_id": 336,
  "category": {
    "type": "Entry",
    "id": "category_2"
  },
  "tags": [
    {
      "type": "tag",
      "id": "tag_32"
    }
  ]
}