{
  "id": "post_317",
  "Title": "Tool Review: Typecast",
  "Summary": "Typography geeks and nerds unite! Gone are the days of screenshotting Typekit font samples to snag headlines to place in a Photoshop document to see if all the type could work together. A month or so ago I stumbled across a crazy new web app that fills a need web designers have yearned for since…",
  "Body": "<p>\r\n\tTypography geeks and nerds unite! Gone are the days of screenshotting Typekit font samples to snag headlines to place in a Photoshop document to see if all the type could work together. A month or so ago I stumbled across a crazy new web app that fills a need web designers have yearned for since the web type revolution, \r\n\t<a href=\"http://typecastapp.com/\">Typecast App.</a></p><p>\r\n\tI set my first real type on a \r\n\t<a href=\"https://www.google.com/search?q=Vandercook+letterpress&amp;um=1&amp;ie=UTF-8&amp;hl=en&amp;tbm=isch&amp;source=og&amp;sa=N&amp;tab=wi&amp;authuser=0&amp;ei=-h9yT6zmIMXdtge3oIDiDw&amp;biw=1062&amp;bih=679&amp;sei=_B9yT4b1CMuztwe3z9i1Dw\">Vandercook letterpress</a>. I was able to pick out the small pieces of lead, place them reversed on a slab of metal, then roll some paper over inked type and make a print. That was pretty cool. Then I learned how to set type in InDesign – using proper grids, baselines, columns and such – and create a well-set book. I felt like I was rockin’ it. With all this control in other mediums, the web was frustrating. I couldn’t set anything easily without a sort of workaround. I had to find a typeface on another service, take screenshots, and put them all together, just to see how something paired. I was one of the lucky ones to get a [requested] invitation to dive into Typecast and get my hands dirty.  After a few minutes of using Typecast, I had that feeling again: “Tthis is pretty cool.”</p><p>\r\n\tThe team at \r\n\t<a href=\"http://designbyfront.com/\">Front</a> saw a real need within the design community and has made something that fills it  wholeheartedly. One of the first, and easily best, features is the integration of all the major players in the webfont services field, i.e. <a href=\"http://typekit.com/\">Typekit</a>, <a href=\"http://fontdeck.com/\">Fontdeck</a>, <a href=\"http://www.google.com/webfonts\">Google Webfonts</a>. This ability alone easily quartered the time I’ve spent trying to find the right typeface pairings for a project. I was sold.</p><p>\r\n\tTypecast is one of the first “new tools” I’ve used. It brought me joy to design something on the web again. I believe it’s the first in a slew that are about to be released that change how web designers work. \r\n\t<a href=\"http://itunes.apple.com/us/app/aptus/id510487565?ls=1&amp;mt=12\">Aptus</a>, a web browser released by <a href=\"https://twitter.com/#!/aexmo\">Alex Morris</a>, was released this week. It’s designed to be a web browser that helps Responsive Web Design and development. <a href=\"http://www.gridsetapp.com/\">Gridset</a>, by <a href=\"http://markboultondesign.com/\">Mark Boulton Design</a>, is going to be another player in my upcoming arsenal. I see each of these becoming formidable companions that will proliferate well–structured and some of the strongest web–type that has yet to be seen.</p><center><iframe src=\"http://player.vimeo.com/video/35188340?portrait=0&amp;color=ffffff\" frameborder=\"0\" width=\"500\" height=\"281\">\r\n&amp;amp;amp;amp;amp;amp;amp;amp;amp;lt;/center&amp;amp;amp;amp;amp;amp;amp;amp;amp;gt;\r\n</iframe></center><p><em>Check out our latest design work and experimentation on </em><a href=\"http://dribbble.com/smashingboxes\">Dribbble</a><em>. </em></p><p><em><a href=\"http://smashingboxes.com/work\" style=\"background-color: initial;\"></a>Cover photo by </em><a href=\"https://www.flickr.com/photos/halfbisqued/\" style=\"background-color: initial;\"><em>Beck Gusler</em></a></p>",
  "Slug": "tool-review-typecast",
  "slug_history": "---\n- typecast-a-review\n",
  "visits": 862,
  "Published": "2012-03-28T16:00:00+00:00",
  "Authorname": "Jonathan Stephens",
  "category_id": 3,
  "image_uid": "2014/07/29/18/15/54/247/file",
  "created_at": "2014-06-05T18:25:25+00:00",
  "updated_at": "2015-06-15T19:20:10+00:00",
  "markdown": "",
  "image_alt_text": "",
  "featured": false,
  "database_id": 317,
  "category": {
    "type": "Entry",
    "id": "category_3"
  },
  "tags": [
    {
      "type": "tag",
      "id": "tag_8"
    }
  ]
}