{
  "id": "post_378",
  "Title": "​Passion and Curiosity - A Speech To Code School Attendees",
  "Summary": "Last year, our company formed a partnership with a national code school called The Iron Yard and together we launched the first code school in Durham, North Carolina. I was asked to give a talk on the opening day to the 45 students attending the academy this semester. This is most of my speech to them, and I believe it also holds value for anyone who is taking on a major challenge or next step in their career:.",
  "Body": "<p>Last year, our company formed a partnership with a national code school called&nbsp;<a href=\"http://www.theironyard.com/\" style=\"background-color: initial;\">The Iron Yard</a> and together we launched the first code school in Durham, North Carolina.&nbsp;I was asked to give a talk on the opening day to the 45&nbsp;students attending the academy this&nbsp;semester. This is most&nbsp;of my speech to them,&nbsp;and I believe it also holds value for anyone who is taking on a major challenge or next step in their career:</p><p>As a new CTO, I think a lot about how we grow not only our internal teams, but our community at large. I don’t just want rock stars who can sit in a cubicle and crank out code. I want engaged, passionate people who seek out opportunities to learn.</p><p>When I look across this group, and after meeting many of you last night, I see that passion for learning. After all, each of you have dedicated your own time and money for the privilege of getting your butt kicked for the next three months. There’s a lot to be said for that! But, as you can imagine, the journey doesn’t end there. Several years ago, I was part of a group that crafted something called the <a href=\"http://manifesto.softwarecraftsmanship.org/\">Software Craftsmanship Manifesto</a>. The central tenant of that manifesto was the notion that we need to treat what we do as a craft - and the learning for a craft never stops. We need to always be curious about not only our discipline, but those around us.</p><p>In fact, when you finish here and are ready to head out to the 'real world,' that ideal of curiosity is one of the four key things you’ll want to hone here. Technology is changing - when I first started out, we used Basic, C++, Visual Basic, Classic ASP, Foxpro, Cold Fusion and Javascript - many which are still around today. But engineers who don’t stay curious - who aren’t questioning the why of things, and the what’s next - may find the world, and language, they know is quite different. But for you - your curiosity is evident already - it’s why you are here! Don’t let that go away from you.</p><p>The other thing that struck me as so wonderful meeting you all is the passion you have. Each of you have different paths of how you got here, but in no case did I meet someone (so far!) who said, “Well, I really had nothing better to do, so I figured I’d just show up here and hope something happens.” Instead I saw people who want to make a change, who see the power that something different can bring. People who have worked hard to rearrange things to be here, or have&nbsp;been patient waiting to get to a&nbsp;place in their lives where&nbsp;they could commit to this. <strong>And I can promise you that while there will be long hours - and hard work as your brains configure to a new way of communicating - if you remember that passion, that focus, that drive that got you here, it will see you through, and become even brighter when you make it to the end.</strong></p><p>And what about the end? I know it’s hard to think about 3 months from now on your first day. But you are going to have a lot of wonderful opportunities here to build two of your most important elements - your network, and your mentors. See, I’m not a “classically trained” developer. I was going to become a nurse, and spent 8 years with the fire department. But my passion for technology never left. You could say that I am “self-taught” - but none of us actually are. The difference is that our teachers aren’t giving us knowledge in classrooms in front of chalkboards. Instead they are the colleagues who tell us our code is great, and suggest improvements to make it greater. The managers who push us to go to a conference. The conference speakers who do the talk, and then chat with us in the hallway for two hours afterwards as we pester them with questions. The forum poster who guides us to cleaner code. And, for you all - your instructors, TAs, and the staff of Smashing Boxes who will work along side of you. I’ve already set an internal goal for myself of spending two hours a week here, and I expect our team will be passionate about working with you all as well. Hold on to those mentors. Always see yourself as an apprentice, learning, growing. But also know that you can easily be that mentor to others - fellow students who don’t understand a problem. Posters on forums you read for answers but whose question you know the answer to. Being a great mentor means being able to be a great apprentice - and you’ll get the chance to do both. Just don’t let Imposter Syndrome get in your way - each of you is super awesome - it’s why you are here! You’ll always have something to teach someone else - and don’t be afraid to try!</p><p>The last thing you’ll begin building here is your network. This is point I can’t emphasize enough. Over the years, I’ve built a network of friends and colleagues that have opened so many doors. As I mentioned earlier, I started last week as the CTO at Smashing Boxes, but it came about through a nearly seven month process that started by me reaching out to someone at Smashing Boxes for coffee to see how I could help find people for them. Starting today, you have a network of 45 people you’ve immediately gained, plus your instructors, your TAs, and our staff. We can help you - in fact, we’re here <em>to</em>&nbsp;help you - but you can make that even more powerful by purposefully building new connections, having new conversations, and putting yourself&nbsp;in new situations. You may know a general contractor who is looking for web site help. Or an admin assistant who could use a better expense app. Or have friends in the political science space looking for better tools to communicate to the public.</p><p>Because <strong>over the next three months, you will gain a magic power - the power to create.</strong> It’s a wonderful power, and an addicting power. But the best part is the way it can be used to help others be more awesome at what they do by building things to get stuff that's in their way, out of their way. It will be a lot of work to get there, and sometimes may feel completely overwhelming. When it does, reach out to us. We’ve been there. We understand. We can help you&nbsp;find ways through it. We ultimately want to see all of you succeed because while the world may not need “just more devs” - it can use a group of smart, talented, curious, passionate people who have the power to create things that solve problems for the rest of us.</p>",
  "Slug": "passion-and-curiosity-a-speech-to-code-school-attendees",
  "slug_history": "--- []\n",
  "visits": 916,
  "Published": "2015-02-27T15:00:00+00:00",
  "Authorname": "",
  "category_id": 1,
  "image_uid": "2015/02/27/10/12/55/668/file",
  "created_at": "2015-02-27T14:05:01+00:00",
  "updated_at": "2015-03-02T19:31:31+00:00",
  "markdown": "",
  "image_alt_text": "passion and curiosity a speech to code school attendees",
  "featured": false,
  "database_id": 378,
  "category": {
    "type": "Entry",
    "id": "category_1"
  },
  "tags": [
    {
      "type": "tag",
      "id": "tag_23"
    },
    {
      "type": "tag",
      "id": "tag_26"
    }
  ]
}