{
  "id": "post_348",
  "Title": "Why a Start-Up CEO went to Code School",
  "Summary": "\"I didn't enter code school for the same reason many others do. My ambition was not to become a full time developer or programmer. I wanted to gain enough expertise to prototype basic applications and communicate more effectively with developers. The goal was to improve my ability to help design simple but elegant products that solve big problems.\"",
  "Body": "<p>In the early 90s we experienced a revolution in desktop publishing and were on the cusp of changing the way people shared information and communicated. I was a sophomore in high school and was a member of our newspaper. At the time, I was learning Adobe PageMaker and thought, “wouldn’t it be cool to move from cut and paste on a light table to running our design and production from my Mac?” I convinced our teacher to get us a few Macintosh SEs to help innovate our process. Switching to desktop publishing helped us grow from a bi-monthly newspaper to a monthly newsmagazine and reduced costs significantly. It was my first foray into understanding how software and technology could help drive innovation.</p><p>Fast forward twenty years…as the cofounder of two software start-ups I learned quickly that you could end up running on fumes if you don’t pace your development resources well. As a domain expert in the health and exercise sciences, I didn’t always have enough programming acumen to communicate my vision and users’ needs to our developers. I was also handicapped when meeting with potential customers who had a technical team with questions regarding integration and additional features. It required me to bring a developer to the conversation to field questions and help us understand the potential knots and opportunities.</p><p><strong>Enter Code School</strong></p><p>When I shared with friends and family that I was considering immersing myself in code for 12-weeks I received some pretty interesting looks…mostly confused. The underlying theme was, “why the heck do you need to learn to write code…can’t you just hire developers?”</p><p>This is a good question. I would argue that the landscape of entrepreneurship and product development for startups and early stage software companies is changing. Those that lack the technical acumen to communicate with their development team and potential clients and the ability to prototype ideas before even hiring talent are at a disadvantage.</p><p>This isn’t to say that you have to be able to develop robust, fully functioning, bug-free applications using test-driven development. You should, however, be able to understand what your developers are talking about when creating your MVP or adding additional features. This can help bring your product to market more quickly and your development team will probably respect the fact that you understand the product and constraints from their lens and not expect the world in the first release.</p><p>I didn't enter code school for the same reason many others do. My ambition was not to become a full time developer or programmer. I wanted to gain enough expertise to prototype basic applications and communicate more effectively with developers. The goal was to improve my ability to help design simple but elegant products that solve big problems.</p><p style=\"text-align: center;\"><img src=\"/media/W1siZiIsIjIwMTQvMDkvMTIvMTIvMzYvMjYvNTMzL0FuZHJldy5qcGciXV0/Andrew.jpg?sha=3b61bc1f\"></p><p style=\"text-align: center;\"><img src=\"/media/W1siZiIsIjIwMTQvMDkvMTIvMTIvMzcvMDAvMzE1L0FuZHJldzIuanBnIl1d/Andrew2.jpg?sha=4201afee\"></p><p><strong>My Experience</strong></p><p>A little over twelve weeks ago I started <a href=\"http://academy.smashingboxes.com/\" target=\"_blank\">code school</a> in Durham, NC. It was not unlike the first few months of getting a start up off the ground, intense and exhausting, but with some key differences.</p><p>Building a technology “startup” is like being the head coach of a football team. You are constantly leading, designing, managing, strategizing and selling. You’re supported but alone at the same time.</p><p>Code school, is more like trying to set a personal record in a 10k…you start out setting a fast pace making up as much ground as you can. Then you back off a bit, knowing if you maintain that pace you may crack. Finally, you try to pick it up at the end when the finish line is in sight. All the while there are people supporting you (family, classmates and community).</p><p>The first month was by far the most challenging. Eighty to one hundred hour weeks were expected if you wanted to keep up. At the end of 10 weeks of learning and hammering out code, we were given two weeks to produce a final product. I was lucky enough to be partnered with two talented developers and we designed a fully functioning app named <a href=\"http://pladel.io/\" target=\"_blank\">Pladel</a> (a mobile application that provides one simple score to measure your health and takes the guesswork out of what to eat). We all agreed that if we had it to do over we would have ripped out most of the ruby code and served an API from a Rails framework and built the front end using either Angular or Ember (two front-end frameworks) to give us more flexibility. I mention this because that is one of the things you learn in code school…how to understand what to build more efficiently to create better customer experiences and ultimately a more scalable business.</p><p>Just like learning to use Adobe PageMaker to rough out our layout for my high school newspaper helped me better communicate with my designer, my ability to code is now allowing me to prototype apps and communicate more effectively with developers. This has been a significant asset in my new role helping start ups to Fortune 100 companies innovate great products and services at <a href=\"http://smashingboxes.com/\" target=\"_blank\">Smashing Boxes</a>.</p><p>If you have any questions or are thinking about going to code school, don’t hesitate to connect with me. I’m happy to share more about my experience…it was exhausting but very rewarding and all the training paid off.</p><p><em>Get the FAQs on code school <a href=\"http://smashingboxes.com/ideas/faq\">here</a>.</em></p>",
  "Slug": "why-a-start-up-ceo-went-to-code-school",
  "slug_history": "--- []\n",
  "visits": 954,
  "Published": "2014-09-16T05:20:24+00:00",
  "Authorname": "Andrew Hooge",
  "category_id": 2,
  "image_uid": "2014/09/12/10/48/55/201/file",
  "created_at": "2014-09-12T14:09:46+00:00",
  "updated_at": "2015-06-15T19:14:38+00:00",
  "markdown": "",
  "image_alt_text": "",
  "featured": false,
  "database_id": 348,
  "category": {
    "type": "Entry",
    "id": "category_2"
  },
  "tags": [
    {
      "type": "tag",
      "id": "tag_26"
    }
  ]
}