{
  "id": "post_276",
  "Title": "Social (Media) Science",
  "Summary": "Hutto, Yardi, and Gilbert (2013) recently released a study containing data social media nerds have wanted for years. Not just any data mind you but Twitter data, the social media holy grail. The study A Longitudinal Study of Follow Predictors on Twitter examines how social behavior, message content, and network structure influence follower growth. The…",
  "Body": "<p style=\"text-align: justify;\"></p><p style=\"text-align: justify;\">\r\n\tHutto, Yardi, and Gilbert (2013) recently released a study containing data social media nerds have wanted for years. Not just any data mind you but Twitter data, the social media holy grail. The study \r\n\t<u><a title=\"A Longitudinal Study of Follow Predictors on Twitter\" href=\"http://misc.si.umich.edu/media/papers/Yardi_FollowPredictors13.pdf\" target=\"_blank\">A Longitudinal Study of Follow Predictors on Twitter</a></u> examines how <em>social behavior</em>, <em>message content</em>, and <em>network structure</em> influence follower growth. The Georgia Institute of Technology and University of Michigan researchers’ greatest analytical tool is the longitudinal nature of their study. The ability to measure follower growth over 15 months allows the data to suggest a <a title=\"causal relationship\" href=\"http://www.stats.org/faq_vs.htm\" target=\"_blank\">causal relationship</a> between the predictor variables and follower growth.<br>\r\n\t<img class=\"aligncenter size-full wp-image-3368\" title=\"Engage directly with other users\" alt=\"Engage directly with other users\" src=\"http://sbblog.s3.amazonaws.com/wp-content/uploads/2013/04/11.png\" width=\"1024\" height=\"320\"><br>\r\nOf the behavioral and social variables found in Hutto et al. (2013)&nbsp;one notable finding involves the negative effect of \r\n\t<em>broadcast communications </em>on follower growth. Broadcast communications are messages not directed at a specific user or group of users. That is, using Twitter as a bulletin board as opposed to a mode of dyadic (two-way) communication will constrain your number of followers. In turn, <em>directed communications</em> (e.g. replies, ‘@’ mentions, and favorites directed at someone else) have a positive effect on follower growth. Even so, the positive influence of directed communications is not as strong as the negative effect of broadcast communications. Twitter is a conversation platform, evidenced by the marked differences in the effects of communication types on follower growth. Engagement on a one-to-one level between users is the great benefit of social media, why wouldn’t you harness that?</p><p style=\"text-align: justify;\">\r\n\t<a href=\"http://sbblog.s3.amazonaws.com/wp-content/uploads/2013/04/2.png\"><img class=\"aligncenter size-full wp-image-3399\" alt=\"2\" src=\"http://sbblog.s3.amazonaws.com/wp-content/uploads/2013/04/2.png\" width=\"1024\" height=\"320\"></a><br>\r\n\tResearchers also found that expressing negativity is the second most important factor in stunting follower growth. While talking smack may be a treasured pasttime for close friend groups, the relatively weak relationships found on Twitter makes spewing virtual venom a big no-no. Want to further alienate potential new-followers? Use too many hashtags. The median ratio of hashtags per Tweet during the recorded periods was .13. Respect the power of the tag,&nbsp;if you’re using more than one-two hashtags per 10 Tweets, you’re&nbsp;\r\n\t<a href=\"http://www.youtube.com/watch?v=PKIpCPS-oZc\">doing too much</a>.</p><p style=\"text-align: justify;\">\r\n\tRest assured that \r\n\t<em style=\"background-color: initial;\">message content</em> variables were not all doom and gloom. Both spreading informational content and writing Tweets worth retweeting were significant predictors of growth. Hutto et al. (2013) define informational content as Tweets containing a URL, “RT”, “MT”, “HT”, or “via” (MT meaning modified Tweet and HT meaning heard through). Unfortunately, the researchers do not provide a formula for creating top Tweets, though being re-elected President <a title=\"apparently helps\" href=\"https://2012.twitter.com/en/golden-tweets.html\" target=\"_blank\" style=\"background-color: initial;\">apparently helps</a>.</p><p style=\"text-align: justify;\">\r\n\tWhile the follower counts of Twitter’s informer class are likely to grow, the platform’s more self obsessed users, or “meformers” are not as lucky. Although users were found to Tweet about themselves more often (41% “meformer” compared to 26% “informer”), informational content is 30 times more effective in attracting new followers. Yes, 30 times. So try and avoid the “humblebrag”. Also, start dropping knowledge or RTing, because new potential followers won’t care about your self-referential blathering.</p><blockquote class=\"twitter-tweet\" lang=\"en\">\r\n\t<p>\r\n\t\t<a href=\"https://twitter.com/JoeMande\">@JoeMande</a> I'm gonna go ahead and call <a href=\"https://twitter.com/search?q=%23tthb&amp;src=hash\">#tthb</a>(triple threat humble brag)\r\n\t</p><p>\r\n\t\t&mdash; Chelsea Peretti (@ChelseaVPeretti) \r\n\t\t<a href=\"https://twitter.com/ChelseaVPeretti/statuses/26582494892\">October 6, 2010</a>\r\n\t</p></blockquote><p style=\"text-align: center;\">\r\n\t\tThanks to Joe Mande and Chelsea Peretti respectively, for demonstrating a proper #humblebrag and an appropriate public shaming for doing so.</p><p style=\"text-align: center;\">\r\n\t<img class=\"aligncenter size-full wp-image-3370\" title=\"The follower of my follower is my friend\" alt=\"The follower of my follower is my friend\" src=\"http://sbblog.s3.amazonaws.com/wp-content/uploads/2013/04/31.png\" width=\"1024\" height=\"320\"></p><p>\r\n\tWhile Hutto el al. (2013) spent relatively less ink discussing the effect of \r\n\t<em>network structure </em>on follower growth, the researchers did communicate that greater network overlap between a user and their current followers increases the likelihood of a user attracting new followers. Part of the influence of network overlap (i.e. the number of neighbors users have in common) on follower growth may be associated with the idea of <em>triadic closure</em>. If my follower (B) RTs me (A), and my follower’s follower (X) views and likes the content of that RT, my follower’s follower (X) is more likely to follow me (A). The potential for X to follow A grows the more X is exposed to positive or informational content by A. If multiple users which A and X have in common spread content produced by A, the potential for X to follow A increases. According to Hutto et al. the relationship between A, B, and X achieves “cognitive balance” when all three are connected.</p><p>\r\n\tThe relatively simple calculations of users’ \r\n\t<em>in-link reciprocity</em> and <em>attention status</em> can alert users whether they need to adjust aspects of their social media strategy. In-link reciprocity is a ratio of a user’s followers, specifically which of their followers a user follows in return. The attention-status ratio is the proportion of a user’s followers to the accounts a user is following. So, in-link reciprocity [User's Followers: User Follows/Follows User] and attention status [Follows User /User Follows] were significant predictors of follower growth with medians of .25 and 1.19 respectively.</p><p style=\"text-align: justify;\">\r\n\t<img class=\"aligncenter size-full wp-image-3371\" title=\"Popular is as popular does\" alt=\"Popular is as popular does\" src=\"http://sbblog.s3.amazonaws.com/wp-content/uploads/2013/04/41.png\" width=\"1024\" height=\"320\"><br>\r\nWithout unpacking the statistical explanation for why higher attention status and in-link reciprocity ratios predict follower growth, I’ll offer my understanding as a relative layperson. Both ratios signal the symmetry, or asymmetry of the relationships between Twitter users. As noted in Golder and Yardi (2010) attention is a limited resource. The very notion of popularity is that more people are aware of the popular individual than he or she can attend to on a regular basis. When applied to Twitter, the higher the ratio of followers a user has compared to accounts they follow (attention-status ratio), the more popular the individual. Based on the research of Hutto et al., the higher a user’s attention-status ratio the greater the likelihood a user will attract new followers. The lesson: popular kids will continue to grow in popularity by virtue of being popular, it’s like high school never ended. However, if a user follows their new followers, the potential for attracting new followers increases as well.</p><p style=\"text-align: justify;\">\r\n\tGolder and Yardi compare the reciprocal nature of following one’s followers as akin to repaying a favor. Through repaying follows, users can solidify social media’s relatively weak bonds and protect themselves against the dreaded unfollowing. Be mindful however, that increases in attention status ratio have a greater effect on attracting new followers than increasing in-link reciprocity. In other terms, have more followers than friends.</p><p style=\"text-align: justify;\">\r\n\tTwitter’s influence can hardly be confined to data sets. Fortunately, how we interact with each other on the platform is more quantifiable as evidenced in the research of Hutto et al. If you want a quick list of tips for increasing your Twitter followers, look at \r\n\t<a title=\"this article\" href=\"http://www.forbes.com/sites/stevecooper/2013/02/27/grow-your-twitter-followers-by-being-nice-and-informative/\" target=\"_blank\">this article</a> or maybe <a title=\"this one\" href=\"http://www.poynter.org/latest-news/mediawire/205411/science-reveals-what-really-increases-twitter-followers/\" target=\"_blank\">this one</a>. But instead of taking the path of numbered lists, read the <a title=\"original research\" href=\"http://comp.social.gatech.edu/papers/follow_chi13_final.pdf\" target=\"_blank\">original research</a> elaborating on the network structure variables. The well worn trope about being an informed consumer, well, it’s more than a figure of speech especially as&nbsp;Twitter is concerned. In a relatively short amount of time, mastery of 140 characters or less became an influential manner of gaining social capital. Individuals unknown before 2006 have the opportunity to become “micro-celebrities”, and both&nbsp;established and up-and-coming brands have access to a less expensive marketing channel.</p><p style=\"text-align: justify;\">\r\n\tIf you’re not Tweeting, review the research and start. If you’re already thousands of Tweets deep into the platform, use the research to refine your technique. Also, follow Smashing Boxes on Twitter \r\n\t<a title=\"@Smashing Boxes\" href=\"https://twitter.com/smashingboxes\" target=\"_blank\">@SmashingBoxes</a> and continue the discussion on how to best increase follower growth.</p><p><em>Smashing Boxes is a web and mobile app development company know for creating a lasting experience through bold design and disrupting the status quo. We are entrepreneurs and craftsmen first, and a digital creative agency second. Inspired by our visionary clients, we transform ideas into innovative web and mobile applications. </em><a href=\"http://smashingboxes.com/work\">Take a look at our work.</a></p><p><strong style=\"background-color: initial;\">References and Credits</strong></p><p>Many thanks to C.J., Sarita, Eric, &amp; Scott for their work.</p><p>Golder, S. A., &amp; Yardi, S. (2010). Structural predictors of tie formation in twitter: Transitivity and mutuality. \r\n\t<em>2010 IEEE Second International Conference on Social Computing (SocialCom)</em> (pp. 88-95). IEEE.</p><p>\r\n\tHutto, C. J., Yardi, S., &amp; Gilbert, E. (2013). A Longitudinal Study of Follow Predictors on Twitter.</p><p>Cover photo by&nbsp;<a href=\"https://www.flickr.com/photos/thebarrowboy/\" style=\"background-color: initial;\">thebarrowboy</a></p>",
  "Slug": "social-media-science-1",
  "slug_history": "--- []\n",
  "visits": 1015,
  "Published": "2013-04-08T04:00:00+00:00",
  "Authorname": "Chike Lawrence ",
  "category_id": 2,
  "image_uid": "2014/07/29/12/10/09/772/file",
  "created_at": "2014-06-05T18:24:07+00:00",
  "updated_at": "2014-08-12T20:18:39+00:00",
  "markdown": null,
  "image_alt_text": null,
  "featured": false,
  "database_id": 276,
  "category": {
    "type": "Entry",
    "id": "category_2"
  }
}