{
  "id": "post_373",
  "Title": "​Smashing Boxes Partners With ASSIST To Drive Wearable Health Innovation",
  "Summary": "​Smashing Boxes Partners With ASSIST To Drive Wearable Health Innovation\r\n",
  "Body": "",
  "Slug": "smashing-boxes-partners-with-assist",
  "slug_history": "--- []\n",
  "visits": 463,
  "Published": "2015-01-23T15:00:00+00:00",
  "Authorname": "",
  "category_id": 2,
  "image_uid": "2015/01/23/11/09/04/750/file",
  "created_at": "2015-01-21T19:02:26+00:00",
  "updated_at": "2015-01-23T16:15:22+00:00",
  "markdown": "Smashing Boxes and the [Advanced Self-Powered Systems of Integrated Sensors and Technologies (ASSIST)](http://assist.ncsu.edu/), are proud to announce a partnership to help drive innovation around wearable technology and the [Internet of Everything](http://internetofeverything.cisco.com/).\r\n\r\nSmashing Boxes and ASSIST are both committed to building innovative solutions through creative uses of technology. In line with this commitment, the partnership will further efforts to build the next generation of wearable technology and the software that supports it.\r\n\r\nAccording to Smashing Boxes CEO Nick Jordan, “This partnership will further our commitment to supporting technology innovation in North Carolina.  We believe the research and development that ASSIST is producing will help companies build the next generation of wearable technology and make the data they collect more valuable and actionable.\"\r\n\r\nThe challenge at present: removing the battery, or the need to charge a battery, from wearable devices. Think nano-enabled energy harvesting, energy storage, nano devices, and sensors to create battery-free, body-powered, and wearable health monitoring systems.\r\n\r\n<iframe width=\"853\" height=\"480\" src=\"//www.youtube.com/embed/6OjLmqRxFHY?rel=0\" frameborder=\"0\" allowfullscreen></iframe>\r\n\r\n\r\nAbout ASSIST\r\n\r\nThe NSF Nanosystems Engineering Research Center (NERC) for Advanced Self-Powered Systems of Integrated Sensors and Technologies (ASSIST) develops and employs nano-enabled energy harvesting, energy storage, nanodevices, and sensors to create innovative, battery-free and body-powered wearable health monitoring systems. This center of excellence received funding from the National Science Foundation (NSF) in 2012 for five years of research, and this funding will be renewable for another five years in 2017.",
  "image_alt_text": "",
  "featured": false,
  "database_id": 373,
  "category": {
    "type": "Entry",
    "id": "category_2"
  }
}