{
  "id": "post_233",
  "Title": "The Impact of Healthcare IT: Big Data, Big Cloud, Big Finance.",
  "Summary": "Part two of an interview series with Mark Braunstein, Director of the Health Systems Institute at Georgia Tech, and columnist at InformationWeek. A decade or so ago only a very few professionals used the term Logistics, yet it very quickly moved from an IT and Operations handle into the boardroom.  Dr. Braunstein explains how data…",
  "Body": "<p style=\"text-align: left;\">\r\n\t<em>Part two of an interview series with Mark Braunstein, Director of the Health Systems Institute at Georgia Tech, and columnist at InformationWeek. A decade or so ago only a very few professionals used the term Logistics, yet it very quickly moved from an IT and Operations handle into the boardroom.  Dr. Braunstein explains how data logistics impacts the health care system…</em></p><h3>\r\n\tBig Data/Big Cloud\r\n</h3><p>\r\n\tTo manage healthcare beyond the one doctor/one patient scenario, digital records are required. I noticed about three years ago that my primary care physician seemed to apologize a lot for not spending as much time “looking me in the eye” as he wanted to. Instead, he spent more time looking at his screen to be sure he was capturing the data appropriately. He was frustrated by it but knew it was important. Today’s health care ecosystem requires that your data be shared among many entities: specialists, insurance companies, hospitals, rehab centers, etc.</p><p>\r\n\tBig Data certainly is impacting the current state of Healthcare IT (HIT).  While many definitions have arisen, at its essence big data is the term for the collection, storage and analysis of data sets so large and complex that processing the information requires advanced computing power and systems. This data is indeed being gathered, and it allows for new technologies to be developed that continually improve the industry. Indeed, it is spurring new entrepreneurial opportunities throughout all industries that touch the medical field – including government.</p><p>\r\n\tIt could well be that it is a combination of “the cloud” and advent of big data analysis that has established the opportunity for the success of Healthcare IT. Dr. Braunstein suggested that, in IT, we make more of the Cloud than need be. Yet, it is the very fact that we can move data to the cloud and access it anywhere that opens up so many opportunities for healthcare IT.</p><p>\r\n\tCertainly the ability to access highly intimate and personal information on everyone in America has put some ill-at-ease. Data security becomes more critical than ever – and yet, we cannot possibly go back. There are <a href=\"http://www.hhs.gov/ocr/privacy/\">HIPAA regulations</a> to help address these concerns, but new and better security systems and applications are yet another opportunity for healthcare IT innovation.</p><h3>\r\n\tFinancing and the Affordable Care Act\r\n</h3><p>\r\n\tIf there is one industry in our country that needs reformation, healthcare is it. Other industries invested heavily in, and benefitted from, the streamlining of operations when they began utilizing IT for a more efficient and effective workplace. With the <a href=\"http://www.hhs.gov/healthcare/rights/\">Affordable Care Act</a> applying regular pressure to the systems behind the care, new technologies and strategies are being developed and deployed that ostensibly make it easier for consumers to control their own healthcare.</p><p>\r\n\tAccording to Braunstein, healthcare in America remains a trailing edge industry. We’ve been bypassed by numerous nations throughout Europe, and many African countries have found ways to take better advantage of technology than we have… not only for tracking information and insurance, but for providing pharmaceutical data and apps that help with preventative care.</p><p>\r\n\tNot surprisingly, the reasons for this can be traced back to money. The reduction in healthcare spending, Dr. Braunstein points out, has fallen below inflation for the first time in U.S. history. In November, 2013, the White House published a paper entitled <em><a href=\"http://www.whitehouse.gov/sites/default/files/docs/healthcostreport_final_noembargo_v2.pdf\">Trends in Health Care Cost Growth and the Role of the Affordable Care Act</a> </em>in which it made these key points:</p><ul>\r\n\t\r\n<li><em>Health care spending growth is the lowest on record. According to the most recent projections, real per capita health care spending has grown at an estimated average annual rate of just 1.3 percent since 2010. This is the lowest rate on record for any three-year period and less than one-third the long-term historical average stretching back to 1965.</em></li>\t\r\n<li><em>The North American health IT market will grow at a compound annual growth rate of 7.4% to reach a total value of $31.3 billion in 2017, compared to $21.9 billion in 2012, the research firm Markets and Markets predicted in a new report.</em></li>\t\r\n<li><em>The value of the US market, which accounts for nearly three quarters of North American HIT revenue, will rise to $22.6 billion in 2017.</em></li></ul><p>\r\n\tWith both ample room for growth and the estimated $22.6 billion in growth in the next three years, opportunity appears to be extensive.</p><p>\r\n\tBe sure to read the <a title=\"The Impact of Healthcare IT Part 3: Entrepreneurial Vistas\" href=\"/ideas/the-impact-of-healthcare-it-part-3/\">Impact of Health Care IT Part 3</a>, we address opportunities for innovation, and where entrepreneurs are having the most impact.</p><p>Cover photo by <a href=\"https://www.flickr.com/photos/rh2ox/\">R2Hox</a><br></p>",
  "Slug": "the-impact-of-healthcare-it-part-2",
  "slug_history": "--- []\n",
  "visits": 1225,
  "Published": "2014-01-06T20:00:00+00:00",
  "Authorname": "",
  "category_id": 4,
  "image_uid": "2014/07/30/14/25/41/171/file",
  "created_at": "2014-06-05T18:21:25+00:00",
  "updated_at": "2015-06-15T19:12:48+00:00",
  "markdown": "",
  "image_alt_text": "",
  "featured": false,
  "database_id": 233,
  "category": {
    "type": "Entry",
    "id": "category_4"
  },
  "tags": [
    {
      "type": "tag",
      "id": "tag_33"
    }
  ]
}