{
  "id": "post_375",
  "Title": "The Experience Smashcast: Designing Play at Marbles Kids Museum",
  "Summary": "The Smashing Boxes 'Experience Smashcast' is exploration of experience design - both digital and physical - through conversation with trendsetters and visionaries in the field. In this inaugural episode, we explore what goes into creating the play and guest experience at Marbles Kids Museum.",
  "Body": "<p>When we think about experiences in a digital context we generally consider what a person thinks and feels as they navigate through a website or app. A person’s experience with a service or product takes shape during moments of engagement - or touch points - that trigger emotional reactions. In turn, these experiences sculpt the way they think and feel about a brand. It is the task of experience designers to identify and improve - or altogether create - these touch points that lead to a positive experience for the user.</p><p>\r\n\tOutside of the digital realm, designed experiences are pervasive; we just don't always notice them. Museums, theatre, music, architecture, amusement parks, and even<a href=\"http://Close tie between Amsterdam and Prague but I think Prague takes the cake.\"> entire cities</a> are designed with some degree of intention. The goal may be to connect with people, add greater meaning to their lives, or to foster a sense of affinity for a brand or institution. But do people forging experiences outside of the digital realm go about it in the same way? Or is there a thing or two that we, in the digital world, could learn from them?</p><p>\r\n\tThis is what Dante and I were pondering when we came up with the idea of the Experience Smashcast. As a company, our approach embraces technology as a part of the broader customer experience - customer relationships, support, marketing, design - these things all contribute to the larger ecosystem of the user experience. With this in mind, we wanted to see how, why, and with what, others are crafting powerful, human experiences beyond digital. And, from a selfish point of view, we knew we would benefit from understanding different perspectives on experience design, with the hope that those benefits would carry over to our own clients.</p><p>\r\n\tI can't remember who thought of it first, but Marbles Kids Museum resonated with both of us. Even if you're simply meandering around downtown Raleigh, the architecture of the building is an experience in itself. There's an odd, pointy glass structure where people can walk out over the sidewalk and look out onto the park next door. On the adjacent side stands a tall, purple iron gate with a fountain behind it. And rising high from the roof, a large half sphere of glass windows. Indoors, the architecture is whimsical and inspiring, making you feel like you're a kid again.</p><p>\r\n\tSo we reached out. And to our surprise and delight (we weren't sure how seriously people would take our off-the-cuff idea) members of the leadership team&nbsp;were thrilled to talk with us about what goes into creating \"the Marbles experience” and what they’re all about.</p><p>\r\n\tWe had so many questions for them. We wanted to know about their philosophy and vision, their process, how their process informs their culture. Do they do 'user' research? Do they test prototypes? Where do they draw inspiration and how do they keep themselves fresh? This episode of the Smashcast holds the answers to those questions, but more importantly, it's an inspiration. And not just for experience designers, but for anyone who is a human.</p><iframe width=\"100%\" height=\"450\" scrolling=\"no\" frameborder=\"no\" src=\"https://w.soundcloud.com/player/?url=https%3A//api.soundcloud.com/tracks/189319575&amp;auto_play=false&amp;hide_related=false&amp;show_comments=true&amp;show_user=true&amp;show_reposts=false&amp;visual=true\"></iframe><p>\r\n\tWhat did you think? Have any suggestions for future Smashcast episodes? Want to nominate us for a local Emmy? Comment below, and thanks for listening!</p>",
  "Slug": "experience-smashcast-marbles-kids-museum",
  "slug_history": "---\n- title-to-be-decided\n",
  "visits": 673,
  "Published": "2015-02-12T15:00:00+00:00",
  "Authorname": "",
  "category_id": 3,
  "image_uid": "2015/02/12/11/22/46/239/file",
  "created_at": "2015-02-12T16:26:43+00:00",
  "updated_at": "2015-03-02T19:30:53+00:00",
  "markdown": "",
  "image_alt_text": "Smashing Boxes hosts Experience Smashcast at Marbles Kids Museum",
  "featured": false,
  "database_id": 375,
  "category": {
    "type": "Entry",
    "id": "category_3"
  },
  "tags": [
    {
      "type": "tag",
      "id": "tag_10"
    },
    {
      "type": "tag",
      "id": "tag_13"
    },
    {
      "type": "tag",
      "id": "tag_26"
    }
  ]
}