{
  "id": "post_339",
  "Title": "The New Smashing Boxes Website",
  "Summary": "At the beginning of the year we sat down and made a decision that we needed to show off what we have been up to. After a lot of back and forth, debating, concepting, designing, and developing we are excited to launch the new smashingboxes.com.",
  "Body": "<p>There’s a saying that goes something like “the plumber has the worst plumbing on the block.” Well, we wouldn’t say we have the worst website by any means, but we’ll admit we’ve  been busy growing and working with our great clients the past few years without giving as much dedication to our own site. At the end of last&nbsp;year we sat down and made a decision:&nbsp;we needed a new site that would show off what we've been up to.&nbsp;After a lot of back and forth, debating, concepting, designing, and developing we are excited to launch the new&nbsp;<a href=\"http://www.smashingboxes.com/\">smashingboxes.com.</a></p><p>First, we thought about how we could give potential clients and employees a glimpse into Smashing Boxes sans fluff. The key was  showing our work, our people, and our ideas instead of just talking about them. So that’s what we did.</p><p><img src=\"/media/W1siZiIsIjIwMTQvMDgvMTIvMTEvMDgvMzcvOS9zYl9za2V0Y2hlcy5qcGciXV0/sb-sketches.jpg?sha=000e4bd6\" alt=\"\" style=\"display: block; margin: auto;\"> </p><p>The site is designed at a 16-column grid and is responsive for all devices. We designed the structure of each page to display (what we are calling) “the billboard” at the top. This has an image along with a quote or phrase that adds context to the information that follows.&nbsp;Then we broke up the various sections of the page for a simple and smooth brochure look.&nbsp;We had our incredibly talented, in-house designer/photographer, <a href=\"http://www.smashingboxes.com/bio/jakop-nazaretyan\" style=\"background-color: initial;\">Jakop Nazaretyan</a>, take and style all our photos.</p><p><img src=\"http://smashingboxes.com/media/W1siZiIsIjIwMTQvMDgvMTIvMTEvMTAvMTAvNzMxL25hdi5naWYiXV0/nav.gif?sha=1d511784\" alt=\"\" style=\"display: block; margin: auto;\"></p><p>Our&nbsp;<a href=\"http://www.smashingboxes.com/culture/\">Culture page</a> focuses on our people and the diverse, fun day-to-day life that we have here. We have an amazing amount of talented people with different personalities who collectively want to innovate technology and disrupt industries.</p><p>Our&nbsp;<a href=\"http://www.smashingboxes.com/work/\">Work page</a> showcases the products we have built&nbsp;\"in the wild,\"&nbsp;with shots of each product in a real world scenario. It is the&nbsp;place where we can show off our inspiring clients and and the work that we have done.&nbsp;We are very proud that we have great clients that partner with us, and it gives us the opportunity to disrupt not only their business but their industry as a whole.&nbsp;The top slide show of the work page displays the product in the hand of a user while the&nbsp;second slideshow contains an up close look at the product we created.&nbsp;</p><p>Our work is diverse, we’ve partnered with a number of startups and established companies that are trying to get a MVP (minimum viable product) along with projects that have yet to launch. Since we are proud of that work as well we have added our work in progress, which links to our team&nbsp;<a href=\"https://dribbble.com/SmashingBoxes\">Dribbble</a> account.&nbsp;</p><p>Our&nbsp;<a href=\"http://www.smashingboxes.com/ideas/\">Ideas page</a> is where we can flex our brain power and our thoughts about the digital world around us. We have become thought leaders within our industry and want to share these thoughts to people beyond the walls of Smashing Boxes. We believe that to do this, we need to consolidate the expertise and inspiration of each one of our talented people, ranging from designers and developers to project managers and team leaders.</p><p><img src=\"http://smashingboxes.com/media/W1siZiIsIjIwMTQvMDgvMTIvMTEvMDkvNDgvMjgxL2JpbGxib2FyZC5qcGciXV0/billboard.jpg?sha=30f0c3d4\" alt=\"\" style=\"display: block; margin: auto;\"></p><p>This is just the beginning. We are committed to evolving the site, showing off new client work, and sharing our ideas to the world. We hope you enjoy the new site and if you are so inclined, share it or join in on the discussion.  If you want to partner with us, just&nbsp;<a href=\"http://www.smashingboxes.com/contact/\">reach out</a> and we will be glad to work together. You can also check out our latest design work and experimentation on <a href=\"http://dribbble.com/smashingboxes\" style=\"font-size: 14px; background-color: initial;\">Dribbble</a>.</p><p><em>&nbsp;<br></em></p><p>...</p><p>As a final note,&nbsp;I am very proud of our team and our company. Thanks guys for all the hard work that went into it!&nbsp;<a href=\"http://www.smashingboxes.com/bio/josh-christensen\">Josh</a>,&nbsp;<a href=\"http://www.smashingboxes.com/bio/dante-passera\">Dante</a>,&nbsp;<a href=\"http://www.smashingboxes.com/bio/ellen-clemons\">Ellen</a>,&nbsp;<a href=\"http://www.smashingboxes.com/bio/vimal-patel\">Vimal</a>,&nbsp;<a href=\"http://www.smashingboxes.com/bio/doug-ransdell\">Doug</a>,&nbsp;<a href=\"http://www.smashingboxes.com/bio/michael-elfassy\">Michael</a>,&nbsp;<a href=\"http://www.smashingboxes.com/bio/kenneth-nicholson\">Kenneth</a>,&nbsp;<a href=\"http://www.smashingboxes.com/bio/jakop-nazaretyan\">Jakop</a>,&nbsp;and&nbsp;<a href=\"http://www.smashingboxes.com/bio/andrew-fowler\">Andrew</a>.</p>",
  "Slug": "the-new-smashing-boxes-website",
  "slug_history": "--- []\n",
  "visits": 1059,
  "Published": "2014-08-12T19:31:54+00:00",
  "Authorname": "Raleigh Felton",
  "category_id": 3,
  "image_uid": "2014/08/11/10/20/47/96/file",
  "created_at": "2014-08-07T18:25:17+00:00",
  "updated_at": "2014-12-18T23:14:30+00:00",
  "markdown": "",
  "image_alt_text": null,
  "featured": false,
  "database_id": 339,
  "category": {
    "type": "Entry",
    "id": "category_3"
  }
}