{
  "id": "post_356",
  "Title": "Leveraging the Lean Startup Methodology to Build Software",
  "Summary": "The discovery phase of the product development process is critical for uncovering the “real” problems that need to be solved. It’s also important in helping define the initial target audience or user base. ",
  "Body": "<p>I’m not a programmer...more of a product developer who understands just enough code to be dangerous. About a month ago I graduated from <a href=\"http://smashingboxes.com/ideas/why-a-start-up-ceo-went-to-code-school\" style=\"background-color: initial;\" target=\"_blank\">code school</a> and after twelve weeks of intense training, my <a href=\"http://pladel.io/\" style=\"background-color: initial;\" target=\"_blank\">two teammates</a> and I put ourselves through the challenge of designing a <a href=\"http://pladel.io/\" style=\"background-color: initial;\" target=\"_blank\">health app</a> in under two and half weeks. What we learned is something that all developers and UX designers know - to create a successful product, the discovery phase has to be thought out, well-planned and well implemented. Here I’ll talk about leveraging lean startup methodology to build software and show exactly how we delivered it in the form of a mobile health app.</p><h4>Phase One: Discovery (3 days)</h4><p><em>Step One: Defining the Problem</em></p><p>The <a href=\"http://smashingboxes.com/ideas/you-cant-really-innovate-without-discovery\" target=\"_blank\">discovery phase</a> of the product development process is critical for uncovering the “real” problems that need to be solved. It’s also important in helping define the initial target audience or user base. The initial product, or minimum viable product (MVP), will need to be tested with that audience or user base to learn as much as possible about them with as little effort as possible. More on this in a minute. Failing to select the correct audience and “jobs” they need to accomplish can kill the product's success. </p><p>The first step is to identify the problem. In our case Josh, our lead backend developer, explained that he was having trouble staying motivated and accountable to a health plan called the Primal Blueprint. It was a plan focused more on improving health than bench pressing 300 lbs. or running a three-hour marathon. It focused on improving sleep quality, eating well and moving enough.</p><p>After a couple months, he would get bored with his meal plan and return to eating poorly.  Josh also lacked awareness in regards to how he was performing on the plan...he was losing weight and feeling better...but was he sleeping enough? Was he moving enough during the day?  There was no definition of success. So we concluded that the best product to test (the MVP) was a health app.</p><p>As an exercise physiologist I try to keep up with the most recent research. Based upon some recent studies, the current thinking is that maintaining and improving one’s health is not defined only by working out intensely for 30-60 minutes per day (although that is important) it’s also defined by not being sedentary (i.e. resting your backside eight hours per day).  It’s also key, especially when designing a health application, that you have someone on your team that understands the domain.  The more familiar you are with the subject matter the more depth and value you can typically add to a product.  With this in mind we decided to test our assumption that other people had these problems as well. MVP hypothesizing at work.</p><p style=\"text-align: center;\"><img src=\"/media/W1siZiIsIjIwMTQvMTAvMjAvMTIvMzMvNTAvODY5L1NjcmVlbl9TaG90XzIwMTRfMTBfMjBfYXRfMTIuMTguMzFfUE0ucG5nIl1d/Screen%20Shot%202014-10-20%20at%2012.18.31%20PM.png?sha=45c7afe6\"></p><p><em>Step Two: Understand Your Audience</em></p><p>Ideation can take on many forms, but when testing a minimum viable product, assumptions have to be made quickly and with a gut feeling. When Zappos founder Nick Swinmurn wanted to test the hypothesis that customers were willing to buy shoes online, he got right down to it. He didn’t build a brand new website or ship in an entire stockroom of shoes, but instead took pictures of a local shoe store’s inventory, posted the pictures online, bought the shoes from the store at full price, and sold them directly to customers. Like Swinburn, we assumed customer demand was present, and in this case it was the demand for a more involved health app they could use.</p><p>We had limited time (literally a day) to complete the hypothesis testing process. I did some basic research on Primal Blueprint, performed some basic audience research by viewing their forums and Facebook page, and had a short storyboarding session with the team.</p><p>Following the lean methodology process, we made a number of assumptions: </p><ul> \r\n<li>There were enough people on the Primal Blueprint plan that had problems similar to those Josh was experiencing</li></ul><ul> \r\n<li>The initial audience that had the most pain and was most likely to adopt the product early were age 22-30, male leaning, recent college graduates living in metropolitan areas and were Achiever Intellectual archetype (send me a message if you want to know more about this).</li><li>The audience was time constrained but would be willing to self report whether they ate healthy or not if it was simple</li><li>They had a wearable device or would be willing to purchase one so we could passively aggregate  their data and “score” their progress</li></ul><p><em>Step Three: Market Assumptions</em></p><p>Potential customers must get involved to make sure there’s interest and need in the product. Avoiding customers’ input would lead to more work, more cost and...well...fat methodology. And no one wants that.</p><p>So after some general assumptions were made, we set off to test their validity.  We posted a simple five-question survey to all the forum members and Facebook followers of the Primal Blueprint. We received 19 completed surveys. Of those, 14 said they were either enthusiastic or very enthusiastic about the product and 12 said they either had a wearable device or would be willing to purchase one.  </p><p>Based on our limited time, we made the assumption that a larger sample would prove the same results (normally one would perform a much more extensive set of market research to improve confidence).  We also knew that over 250k copies of the Primal Blueprint had been sold and they had over 50k subscribers on their forum.  There was a large enough audience that had the problem to make it worthwhile to solve.  Three of our assumptions had passed enough to take the next steps but one did not. Out of the 14 respondents, 70% were age 30-45, female-leaning parents who lived in metropolitan areas.  Our initial assumption was age 22-30, male-leaning, recent college graduates living in metropolitan areas.  We stuck with the assumption that they were Achiever Intellectual archetype.</p><p>Redefining our assumptions about our audience based on what we learned from our product discovery phase affected our branding and some functionality of the final prototype. Had we not performed the discovery process and implemented lean methodology, we may have focused on a less engaged audience and wouldn’t know what they needed or wanted. Ultimately, this would have decreased our likelihood for success.</p><p><strong>Key Takeaways:</strong></p><ul> \r\n<li>Start by figuring out the problem that needs to be solved and then develop a minimum viable product (MVP) to begin the process of learning as quickly as possible. </li><li>Make assumptions about what your customers’ wants and needs are.</li><li>Get their feedback.</li></ul><p>Next month, I’ll be expanding on the lean startup method and the next steps in designing and developing with this in mind. The real test is after the initial prototype is built, will people actually engage with it and how much? More on this to come...</p><p><a href=\"http://smashingboxes.com/ideas/what-makes-a-mobile-health-mhealth-app-effective\" target=\"_blank\">Read more</a> about what makes a mobile health app effective.</p>",
  "Slug": "leveraging-the-lean-startup-methodology-to-build-software",
  "slug_history": "--- []\n",
  "visits": 0,
  "Published": null,
  "Authorname": "Andrew Hooge",
  "category_id": 2,
  "image_uid": "2014/10/20/12/40/19/935/file",
  "created_at": "2014-10-20T16:15:48+00:00",
  "updated_at": "2014-10-20T16:40:23+00:00",
  "markdown": null,
  "image_alt_text": null,
  "featured": false,
  "database_id": 356,
  "category": {
    "type": "Entry",
    "id": "category_2"
  }
}