{
  "id": "post_352",
  "Title": "Spread the Love: Thought Leadership",
  "Summary": "Thought leadership is a strategic process. Here are some tips on doing it right.",
  "Body": "<p>\r\n\tOne of the first things your mother probably taught you was to cover your mouth when you cough. Spreading your germs to the other kids on the playground was a surefire bet to get them sick and result in an angry parent cursing under their breath at your mother for not raising you properly. In today’s world of content marketing, things work a little differently. You want those germs to spread.</p><p>\r\n\tBy disseminating your knowledge to one person through social networking and digital relationship building, it can be passed on to lots of other people. When you’re a thought leader, this recognition could be tripled, thanks to your expertise, personal experiences and unique perspective. The best thought leaders in the marketing industry build their brands through stories, and subsequently tell them to the world.</p><h3>It Comes in All Forms</h3><p>\r\n\tThe first thing you might be wondering is how will you be perceived as a thought leader if writing isn’t your go-to talent. Here’s a tip: you don’t have to write. If you’re a designer, post sketches of your latest logo or infographic and explain where they idea came from. UX designer? Push out your wireframes and discuss your usability testing (if you can make it public). Film a short video. Record a podcast. No matter where your talents lie, you can do more than put them into words.</p><h3>How to</h3><p>\r\n\tBecoming a thought leader, like anything else, involves dedication. So here are a few steps to get you there:</p><p>\r\n\t<strong>1.   Own your topic. </strong>On an individual level, this may mean owning your own personal talent. What are you uniquely good at? What area do you want to be seen as an expert in? Whether it’s design, front-end development, UX, whatever, be vocal within those communities and see what personal or unique spin you can offer. Be disruptive. On a company level, this means finding the blank space. What are the needs your customers have but can’t get fulfilled by a competitor?</p><p>\r\n\t<a href=\"https://www.uber.com/\" target=\"_blank\">Uber</a> did this in the public transportation sector. People were tired of waiting 20 minutes for a taxi and then scrounging around in their wallet for loose dollar bills or change. The Uber service broke through this wall of frustration by offering a service that involved the swipe of an app, the convenience of just a few minutes’ wait time, no cash needed, and no tipping. Discover where your prowess lies and where it intersects with the betterment of your customers’ lives.</p><p style=\"text-align: center;\">\r\n\t<img src=\"/media/W1siZiIsIjIwMTQvMTAvMDIvMTAvMzIvNTUvNjIyLzE0NjU2MzE0MzQ4X2YzYWE4YWNiNzhfei5qcGciXV0/14656314348_f3aa8acb78_z.jpg?sha=d7fdcee8\"></p><p>\r\n\t<strong>2. Who cares. </strong>But really, who cares? Every good marketer knows the importance of appealing to their target audience. But you’re going to want to look past the standard “men, women, ages 25-35, black, white, dual income etc.” obligatoriness. Ask yourself, “are we putting this content out for a startup of 10 people? Or a massive company with 10,000 people that has money to work with?” Don’t just talk to your audience to try and grab their attention, speak to them directly and find their pain points.</p><p>\r\n\t<a href=\"http://pizzaturnaround.com/\" target=\"_blank\">Domino’s Pizza did this</a> in 2011 when they started seeing complaints on social media regarding their product. Unhappy customers unashamedly remarked that the chain’s pizza tasted like “cardboard” and they would be more satisfied heating up a frozen pizza in their oven at home. Instead of re-targeting its brand message, Domino’s spoke to their customers directly and literally, apologizing for the dissatisfaction and reconfigured its entire recipe book to make better-tasting pies. Caring about what your customers want and what they care about will show them that their happiness and success is important to you.</p><p>\r\n\t<strong>3. Share the love. </strong>You can tweet out your thoughts a million times over or even strike up a conversation on Google+, but if you’re not spreading your ideas with similar and influential networks, you might as well be eating chicken noodle soup by yourself. Take the time to find those key influencers who have klout in the same arena you do. Check out who they follow, who they’re engaging with, and make sure they have a respectable network worth diving into.</p><p>\r\n\tNot naming names, but last year a BIG TIME developer at a BIG TIME company shared&nbsp;<a href=\"http://smashingboxes.com/ideas/introduction-to-the-mean-stack-video\" target=\"_blank\">one of our blog posts</a> on his website. To this day, that shared post drives 15 percent of all traffic to our website. So once you find someone worth engaging with, do just that. Strike up a conversation on Twitter with him or her, comment on their blog post with your personal perspective (and don’t be afraid to disagree!), and get a conversation started. Once you’re in the circle, you’re there to stay. Take advantage.</p><p>\r\n\tSo get out there. Say what you need to say (cue John Mayer), put a new spin on an existing idea, or challenge an influencer in your space. Check out the \r\n\t<a href=\"http://smashingboxes.com/ideas/the-four-ps-of-entrepreneurship\">thought leadership</a> of our CEO, Nick Jordan, and see how personal perspective and expertise can create knowledge.</p>",
  "Slug": "spread-the-love-thought-leadership",
  "slug_history": "--- []\n",
  "visits": 758,
  "Published": "2014-10-02T14:33:17+00:00",
  "Authorname": "Laura Smith",
  "category_id": 2,
  "image_uid": "2014/10/01/13/16/30/841/file",
  "created_at": "2014-10-01T16:32:27+00:00",
  "updated_at": "2014-10-03T14:02:52+00:00",
  "markdown": null,
  "image_alt_text": null,
  "featured": false,
  "database_id": 352,
  "category": {
    "type": "Entry",
    "id": "category_2"
  }
}