{
  "id": "post_354",
  "Title": "You Can’t (Really) Innovate Without Discovery\t",
  "Summary": "The discovery phase of product development is crucial. Exploring new ideas, asking questions, and challenge existing assumptions will narrow the divide between what you think people will use and what they actually use. \r\n",
  "Body": "<p>\r\n\tInnovation begins with an idea. A spark of intuition based on an assumption - that there is a problem or that something could be better, and that we can solve it. But an idea, even a great one, isn’t enough to create a product that is both usable and desired. To reach that sweet spot and create a better, more useful product, we need to begin with discovery.</p><h3>Discovery? But I already know everything.</h3><p>\r\n\tLet’s just settle this right now. Discovery is not iterating on the features of your product. The purpose of discovery is to dig into your users’ desires and needs, challenge your assumptions, and then reject your “good enough” solutions.</p><p><em>\r\n\tTip # 1: Do not let your ego hold you back from innovating.</em></p><p>\r\n\tEntrepreneurs and product owners are enthusiastic! As they should be - they have a great idea and they’re ready to build an awesome product. This is needed because it’s what drives us to move on our ideas and to create something out of nothing. But there’s a downside to this passion - product owners often approach the development process thinking they fully understand the problem, user, or vision, and are unwilling to challenge their assumptions. Their ego is holding them back from innovating.</p><p>\r\n\tAssumption challenging requires confidence and humility - we must be able to acknowledge that we may not have all the answers, or the right ones.</p><h3>Create the opportunity for success.</h3><p>\r\n\tWhile there is no blanket solution for discovery, the most direct route to building the right product is to identify what people really want and would actually use. This is done by putting yourself in a position to make observations that lead to moments of clarity, the value of which cannot be understated.</p><p>\r\n\tThere are many ways to approach observation, and they don’t have to be expensive or time consuming. A great way to start is to have a person who fits your user profile play around with a competitor’s product, or on your existing product if you’re doing a redesign.</p><p><em>\r\n\tTip # 2: Don’t expect people to tell you exactly what they need or desire.</em></p><p>\r\n\tIt’s your job to read between the lines. Observe your users and listen to them. Where are they hitting road blocks? What are they excited by? What problem is this product solving for them? These observations are the first step in determining what gaps exist and the best way to move forward with a design. Ultimately, this is what leads to groundbreaking discoveries. This process of observation is so simple it’s almost unnerving, but it is the perfect recipe for doing something that has never been done before.</p><h3>Work smarter and not harder.</h3><p>\r\n\tThere are numerous misconceptions about discovery and experience design in general. Some being that discovery is too expensive, a nice to have, or just isn’t practical for a first release. We’re going to crush this right now.</p><p>\r\n\tFirst off, discovery does not have to break the bank. Cue discount usability (coined by \r\n\t<a href=\"http://www.affinitylab.com/news/usability-testing-made-easy/\" target=\"_blank\">Steve Kreg</a>) in which you test a limited number of people (usually three) to quickly get initial feedback. Three users! This is all you need to observe behavior and begin to challenge your assumptions.</p><p><em>\r\n\tTip # 3: Start testing early and often.</em></p><p>\r\n\tDumb it down. You do need something to test but there is no need to have a final design. All you need to start getting valuable feedback are low fidelity designs and text. A great example of this is \r\n\t<a href=\"http://www.lynda.com/Web-Prototyping-tutorials/UX-Design-Techniques-Paper-Prototyping/161093-2.html\" target=\"_blank\">paper prototyping</a>, where you essentially have users navigate a website or digital tool by “clicking” on paper. Evaluate where they “click”, how they navigate the interface, and even gauge their facial expressions when using the tool. How do they navigate through it? Is it frustrating to figure out what to do next? Keep your questions open ended and ask the user what problem it is solving for them.</p><h3>Don’t gamble on your product.</h3><p>\r\n\tSure, there is a chance that all of your initial assumptions are correct and you won’t get anything out of discovery, but it is very unlikely, and not worth the risk. The probability of creating a better product by investing even a small amount of resources in testing is extraordinarily high. Simply, you cannot come up with a method of learning that replaces watching someone actually engage with your product.</p><p>\r\n\tThe eventual outcome of this learning and discovery is that throughout the product development process, you’ll have the confidence to reject “good enough” solutions. Continuing to explore new ideas and challenge existing assumptions will narrow the divide between what you think people will use and what they actually use. Then, you will have built a truly great product.&nbsp;</p><p><em>Glen Raven had the right attitude about discovery. Check out their case study&nbsp;</em><a href=\"http://smashingboxes.com/work/glenraven\" target=\"_blank\">here</a><em>.&nbsp;</em></p><p><em><br></em></p><p>Cover photo by the&nbsp;<a href=\"https://www.flickr.com/photos/usnavy/\" target=\"_blank\">U.S. Navy</a>.</p>",
  "Slug": "you-cant-really-innovate-without-discovery",
  "slug_history": "--- []\n",
  "visits": 1306,
  "Published": "2014-10-14T14:42:27+00:00",
  "Authorname": "Ellen Clemons",
  "category_id": 2,
  "image_uid": "2014/10/14/10/14/51/951/file",
  "created_at": "2014-10-14T14:10:18+00:00",
  "updated_at": "2014-10-14T14:58:10+00:00",
  "markdown": null,
  "image_alt_text": null,
  "featured": false,
  "database_id": 354,
  "category": {
    "type": "Entry",
    "id": "category_2"
  }
}