{
  "id": "post_374",
  "Title": "The Smartphone’s Impact on Social Change ",
  "Summary": "Nonprofits, global organizations, and NGO’s, it’s time to pay attention to global smartphone trends. Global smartphone adoption is increasing dramatically, and with it the ability to create social change.",
  "Body": "<p><em>\"Public health is a form of applied social justice. It's about making sure the benefits that modern times have brought us -&nbsp;wealth, knowledge, and technology -&nbsp;are translated into better health status not just for the few, the rich, and the powerful, but for everybody.\" -&nbsp;Anthony Schlaff, Director of Tuft's Public Health program</em></p><p>I love this quote, and would go further to say that technology can be used to promote social justice. Think about what Twitter accomplished during the Arab Spring. Consider how technology has helped health workers in West Africa stay safe and receive accurate information during the Ebola outbreak. The mobile phone is being used as&nbsp;a change agent around the globe. </p><p>An old military adage states that you can get two things anywhere in the world - Coca-Cola and cigarettes. Today, add talk time to that list (pay as you go minutes.) I have traveled to remote parts of the world and have seen that even in rural villages of Africa, people have cell phones. Your standard Nokia phone is everywhere - almost <a href=\"http://www.itu.int/en/ITU-D/Statistics/Pages/stat/default.aspx\">95% </a>of households globally&nbsp;have access to a cell phone. While western countries took almost a century to convert from landlines to mobile, other nations&nbsp;skipped house phones as a commodity. Cellular towers provided simpler and cheaper infrastructure for connectivity, which gave the average person the ability to call for a doctor in a crisis, pay bills through mobile money systems, and stay up on the latest gossip with family members. This was big. Really big. </p><p>Now the cellular revolution is entering a second phase and the playing field is leveling more than ever. You can’t tweet about the #ArabSpring with your standard feature phone. You need the Twitter app. You need a smartphone. </p><p>Once a luxury reserved for the rich, smartphones have started to become ubiquitous. By 2018,&nbsp;15% of people in Africa and the Middle East will have a smartphone. Usage in India will double to 22%. China will see an increase from 35% to more than half of their population - over 700 million people in one country. That’s twice the population of the United States. And western countries will see almost their entire adult populations adopt smartphones.*</p><p><img src=\"/media/W1siZiIsIjIwMTUvMDIvMDIvMTMvNTgvNTIvNTUvU01BUlRfUEhPTkVfVVNBR0VfMV8ucG5nIl1d/SMART%20PHONE%20USAGE%20%281%29.png?sha=0f6d6efa\"></p><p style=\"text-align: center;\"></p><p>Global companies like <a href=\"http://www.forbes.com/sites/parmyolson/2013/11/13/motorola-unveils-low-cost-moto-g-for-emerging-markets/\">Motorola</a> and <a href=\"http://www.cnet.com/news/mozilla-launches-low-cost-firefox-os-phone-in-india/\">Mozilla</a> have helped to usher in this change. But while Facebook and email may continue to be the most popular applications for the next few years, the opportunity is wide open for apps that aid in communicating and sharing information. Social justice just got a whole new tool to play ball. Instead of hauling stacks of paper, community health workers can now use apps with robust images to identify danger signs during the birth of a baby. Farmers can follow the stock market and consider the best time to sell their coffee for a profit. Warnings of major weather events can be quickly communicated to those in danger and crisis areas can be triangulated via cellular signals to ensure help arrives to those who need it most. </p><p>Smashing Boxes knows first hand that this isn’t a dream of the future. We’re working with a global organization to develop a mobile-friendly database for pharmaceutical researchers and manufacturers. Access to this information lowers the barrier to entry for developing new contraceptives from any corner of the globe, not just in big pharma labs located in western countries. This means greater economic opportunity, lower distribution costs, and creating socially acceptable products by the people who will use the them. </p><p>The benefits of modern technology - wealth, knowledge, and health - will soon be available not just for the few, but for the masses. </p><p><em>Comment below - is your organization helping to create social change with technology? </em></p><p>*<a href=\"http://www.statista.com/statistics/218532/global-smartphone-penetration-since-2008/\">http://www.statista.com/statistics/218532/global-smartphone-penetration-since-2008/</a></p>",
  "Slug": "the-smartphones-impact-on-social-change",
  "slug_history": "--- []\n",
  "visits": 1259,
  "Published": "2015-01-31T01:00:00+00:00",
  "Authorname": "",
  "category_id": 4,
  "image_uid": "2015/01/30/10/21/48/974/file",
  "created_at": "2015-01-29T21:18:11+00:00",
  "updated_at": "2015-03-02T19:31:05+00:00",
  "markdown": "",
  "image_alt_text": "Nonprofits, global organizations, and NGOs are taking advantage of the increase in global smartphone use to affect social change.",
  "featured": false,
  "database_id": 374,
  "category": {
    "type": "Entry",
    "id": "category_4"
  },
  "tags": [
    {
      "type": "tag",
      "id": "tag_33"
    }
  ]
}