{
  "id": "post_240",
  "Title": "Four Tips for Effective Project Management",
  "Summary": "A few weeks ago, Smashing Boxes hosted a Refresh the Triangle event – ‘More Fun, Less Stress: What You Need to Know About Project Management.’ While many project managers attended, plenty of audience members were designers or developers looking for tips to improve their projects or find a new appreciation for their own managers. While…",
  "Body": "<p dir=\"ltr\">\r\n\tA few weeks ago, Smashing Boxes hosted a \r\n\t<a href=\"http://www.meetup.com/refreshthetriangle/\">Refresh the Triangle event</a> – ‘<a href=\"http://www.meetup.com/refreshthetriangle/events/149857822/\">More Fun, Less Stress: What You Need to Know About Project Management.</a>’ While many project managers attended, plenty of audience members were designers or developers looking for tips to improve their projects or find a new appreciation for their own managers. While management isn’t always the sexiest position in a creative agency – it’s often one of the most critical roles in delivering successful projects in both the eyes of the client and the agency.</p><p dir=\"ltr\" style=\"text-align: center;\">\r\n\t<a href=\"http://www.meetup.com/refreshthetriangle/\"><img class=\" wp-image-4522 \" alt=\"Refresh the Triangle Meetup\" src=\"http://sbblog.s3.amazonaws.com/wp-content/uploads/2013/12/Meetup.jpg\" width=\"387\" height=\"216\"></a></p><h3>\r\nSo what should you know about project management?\r\n</h3><p dir=\"ltr\">\r\n\tTo be a project manager is to walk a tightrope everyday – balancing the needs of many clients against the needs of the business, and individuals within the business. Managing timelines, budgets, and scope creep are obvious aspects of the job, but the difference between good and great project managers can be seen in these skills:</p><h5>\r\n<strong>1. The gift of foresight</strong>\r\n</h5><p dir=\"ltr\">\r\n\tWhat are the risk factors for a project? How can we mitigate them now? How can we communicate them now to set different expectations? These are the questions that every manager should ask at the beginning of the project, and then continuously pose throughout the project process. Accounting for \r\n\t<a href=\"http://en.wikipedia.org/wiki/Murphy's_law\">Murphy’s Law</a> is a fundamental responsibility of the PM.</p><h5>\r\n<strong>2. The ability to have difficult conversations</strong>\r\n</h5><p dir=\"ltr\">\r\n\tDelivering bad news clients can be incredibly intimidating, but the ability to identify problems and openly discuss them with stakeholders is a key skill of any project manager. Clients may not be happy about a project item, but they will appreciate knowing the reality of the situation sooner rather than later. Don’t let issues remain undiscussed – bring them up as soon as possible, but offer solid reasoning and alternatives if possible.</p><h5>\r\n<strong>3. Empathy &amp; understanding</strong>\r\n</h5><p dir=\"ltr\">\r\n\tAside from managing client expectations, project managers are also managing internal teams. Managing people is an inherently difficult task; people have emotional and physical needs – and everyone is motivated in different ways. Getting to know team members personally will help managers understand what makes each person tick. This puts PM’s in a better position to create cohesive teams with knowledge of everyone’s strengths and weaknesses, and better yet create camaraderie that will get the team through difficult situations that arise from difficult conversations – see item #2!</p><h5>\r\n<strong>4. Knowing when to step back</strong>\r\n</h5><p dir=\"ltr\">\r\n\tGetting to know a team’s strengths will help in situations where it’s necessary to admit that the team knows better.  It’s not a manager’s job to know how to program or design (although basic skills are a plus) – but it is necessary to know when to listen to the expertise of the team to guide decision making. In those instances – get out of the way; let the team do what they do best.</p><p dir=\"ltr\">\r\n\tNot in a project management role, and wondering how you can get your current manager to build these skills and traits? Talk to them; project managers thrive on communication! Try to phrase the conversation in terms of how you can improve as a team to avoid personal attacks. If you’re noticing build ups to catastrophic project moments that are preventable – start taking the foresight lead in bringing them to your manager’s attention.</p><p dir=\"ltr\">\r\n\tIf you’re a junior PM, you can start building these skills at any point during current projects. These habits often come only through learning by mistake or projects gone awry. Check in with yourself periodically to ask what you could have done differently and don’t be afraid to ask your team members for advice on how you can improve.</p><p>\r\n\tThanks to our wonderful panelists who inspired and informed:</p><ul><li><a href=\"http://www.linkedin.com/profile/view?id=1087102&amp;authType=OUT_OF_NETWORK&amp;authToken=HoHm&amp;trk=extra_biz_connect_hb_upphoto\">Jeffrey Donahoe</a><a href=\"http://www.linkedin.com/profile/view?id=1087102&amp;authType=OUT_OF_NETWORK&amp;authToken=HoHm&amp;trk=extra_biz_connect_hb_upphoto\"><br></a></li><li><a href=\"http://agencyfirebox.com/\">Karl Sakas</a></li><li><a href=\"http://www.linkedin.com/profile/view?id=6462683&amp;authType=OPENLINK&amp;authToken=atBI&amp;locale=en_US&amp;srchid=958191911386717318746&amp;srchindex=1&amp;srchtotal=4&amp;trk=vsrp_people_res_name&amp;trkInfo=VSRPsearchId%3A958191911386717318746%2CVSRPtargetId%3A6462683%2CVSRPcmpt%3Aprimary\">Marc Minor</a></li><li><a href=\"http://www.linkedin.com/profile/view?id=4796934&amp;authType=NAME_SEARCH&amp;authToken=RGeQ&amp;locale=en_US&amp;srchid=958191911386717329649&amp;srchindex=1&amp;srchtotal=4&amp;trk=vsrp_people_res_name&amp;trkInfo=VSRPsearchId%3A958191911386717329649%2CVSRPtargetId%3A4796934%2CVSRPcmpt%3Aprimary\">Tera Simon</a></li></ul><p><br></p>",
  "Slug": "four-tips-for-effective-project-management",
  "slug_history": "---\n- more-fun-less-stress-what-you-need-to-know-about-project-management\n- what-you-need-to-know-about-project-management\n",
  "visits": 1930,
  "Published": "2013-12-11T10:00:00+00:00",
  "Authorname": "Carolyn Frazier",
  "category_id": 2,
  "image_uid": "2014/07/21/12/57/41/740/file",
  "created_at": "2014-06-05T18:21:38+00:00",
  "updated_at": "2015-06-15T19:24:53+00:00",
  "markdown": "",
  "image_alt_text": "",
  "featured": false,
  "database_id": 240,
  "category": {
    "type": "Entry",
    "id": "category_2"
  }
}