{
  "id": "post_350",
  "Title": "Healthcare, Your Website Doesn’t Have to Be Ugly",
  "Summary": "The majority of public health and healthcare digital materials and products are ugly. What can be done about this?",
  "Body": "<p>Let’s address the elephant in the room: healthcare websites. What’s the deal? Too often they’re information-heavy and design deprived. Having dedicated my career to both the creative and healthcare industries, I’m well aware of the problem.</p><p>In my Master’s of Public Health program&nbsp;I worked with statistical software, tore apart published research, and learned to speak in acronym alphabet soup. However, I didn’t learn what goes into building web and mobile applications, nor the tools necessary for it like Photoshop&nbsp;or UXPin. And this is okay. We are not supposed to know those things. But we should be savvy enough to hire people who do. </p><p>As the Digital Health Strategist for a design and web development agency,&nbsp;I’ve seen first hand the impact that user research, experience design, and technical innovation can have for health organizations. The result of integrating these best practices is a website or product that your users will reach for. Here are a few tips for attacking this design challenge: </p><ul> \r\n<li><strong>Ke</strong><strong>ep it simple, but significant.</strong> Chances are your audience is comprised of patients, the general public, or people with health-related questions. They may not know the inside jargon and 10-syllable words that are the norm in our industry. Talk to your audience simply, remembering that you’ll get your message across best if it is easy to understand.</li></ul><ul> \r\n<li><strong>Cut through the noise. </strong>There is a global hunger for accessible health information, ranging from finding the right specialist at a hospital, to appointment scheduling, to understanding personal health records. How do you cut through the noise? With well-executed design, relevant content, and paying attention to your audience’s needs. Your design speaks volumes about your credibility and relevance as an organization.  </li></ul><ul> \r\n<li><strong>Consult with digital design experts.</strong> They can provide insight about intuitive navigation and how to organize an information-heavy site or application. Use those conversations to find the right digital partner to bring your website or mobile app to life. </li></ul><ul> \r\n<li><strong>Design for people.</strong> Address your audience’s needs at each stage of the design and development process and turn the focus toward the “human” in human-centered design. See how we helped Duke, the CDC, and the deBeaumont Foundation do that with&nbsp;<a href=\"http://smashingboxes.com/work/duke\" target=\"_blank\">Practical Playbook</a>.</li></ul><p>So let's use our favorite word - innovate - and change our industry's approach to web and mobile design. User-friendliness coupled with smart, simple design are key to creating a real impact on our target populations. It's time to disrupt the status quo and start making websites&nbsp;and apps people will actually want to use.&nbsp;<em style=\"background-color: initial;\">Check out our latest design work and experimentation on </em><a href=\"http://dribbble.com/smashingboxes\" style=\"font-size: 14px; background-color: initial;\">Dribbble</a><em style=\"background-color: initial;\">.</em></p><p><em>About the author:&nbsp;Katie Donohue McMillan, MPH is the Digital Health Technology Strategist at Smashing Boxes as well as a founding member of the Triangle mHealth Consortium. During her MPH program&nbsp;at UNC-Chapel Hill she successfully lobbied for a Public Health Entrepreneurship course to introduce students to the world of startups. She has experience working for USAID, Care International and the UNC Gillings School of Global Public Health.</em></p>",
  "Slug": "healthcare-your-website-doesnt-have-to-be-ugly",
  "slug_history": "---\n- healthcare-your-s-and-star-doesnt-have-to-be-ugly\n- healthcare-your-wesbite-doesnt-have-to-be-ugly\n",
  "visits": 1415,
  "Published": "2014-09-25T00:44:22+00:00",
  "Authorname": "Katie McMillan",
  "category_id": 3,
  "image_uid": "2014/09/22/16/48/09/603/file",
  "created_at": "2014-09-22T20:27:37+00:00",
  "updated_at": "2014-12-18T23:13:14+00:00",
  "markdown": "",
  "image_alt_text": null,
  "featured": false,
  "database_id": 350,
  "category": {
    "type": "Entry",
    "id": "category_3"
  }
}