{
  "id": "post_315",
  "Title": "Building Themes for Spree eCommerce",
  "Summary": "Spree is an open-source eCommerce solution built on top of Ruby on Rails. It is fairly simple to extend, however building and modifying the front-end can be somewhat of a chore. I’m going to start with the assumption that you have already have an existing Spree installation. If you aren’t aquainted with the installation process, Spree…",
  "Body": "<p><a title=\"Spree eCommerce\" href=\"http://spreecommerce.com/\" target=\"_blank\">Spree</a> is an&nbsp;open-source eCommerce solution built on top of Ruby on Rails. It is fairly simple to extend, however building and modifying the front-end can be somewhat of a chore.</p><p>I’m going to start with the assumption that you have already have an existing Spree installation. If you aren’t acquainted with the installation process, Spree provides an excellent guide <a title=\"Getting Started With Spree\" href=\"http://guides.spreecommerce.com/getting_started.html\" target=\"_blank\">here</a>.</p><h3>Speed things up</h3><p>Before doing any styling, I wanted to recommend the inclusion of <a title=\"Active Reload Gem\" href=\"https://github.com/paneq/active_reload\">active_reload</a> in your Gemfile. Since Spree hasn’t made the jump to Rails 3.1, asset compilation can make changing the appearance of a Spree site frustrating. Active_reload adds some additional intelligence to the recompilation process, and is baked in to Rails 3.2.</p><h3>Changing Markup</h3><p>Through the asset pipeline, Spree makes it dead simple to manipulate stylesheets. To directly effect markup Spree provides two options. First, templates can be overridden&nbsp;by placing matching templates within the app/views directory of your application. For example to overide the product page simply:</p><ol>\r\n<li>Visit Spree’s Github Page</li><li>View&nbsp;<em>core/app/views/spree/products/show.html.erb</em>\r\n</li><li>Copy the code into <em>app/views/spree/products/show.html.erb</em>\r\n</li></ol><p>Couldn’t be easier. However this mitigates any work done by the Spree team on such templates, be it bug fixes or additional functionality. The preferred method to change Spree markup is through the <a title=\"Deface Gem on Github\" href=\"https://github.com/railsdog/deface\">Deface</a> gem.</p><h3>Defacing Your Application</h3><p>Deface allows you to modify template data after it has been rendered using CSS3 selectors. Let’s do some initial setup for altering Spree with Deface.</p><ol>\r\n<li>Add Deface to your Gemfile</li><li>Bundle it</li><li>Make an “Overrides” directory under /app</li></ol><p><a title=\"Spree's Source Code\" href=\"https://github.com/spree/spree\" target=\"_blank\">Spree’s source code</a> is a&nbsp;great companion when making changes. Be sure to swap Spree’s github branch to 1.0-stable (or whatever you happen to be using).</p><p>Let’s look at a some example code:</p>\r\n<pre># For this particular project, we needed to add an additional navigation bar\r\nDeface::Override.new(:virtual_path =&gt; \"layouts/spree_application\",\r\n :name =&gt; \"add_secondary_navigation\",\r\n :insert_after =&gt; \"#nav-bar\",\r\n :partial =&gt; \"shared/navigation\")</pre><p>Here we tell Deface to take the output from layouts/spree_application and add a partial after the DOM element with an ID of #nav-bar. The resulting code is easier to maintain, because we don’t have to worry about checking on every Spree update to see if any changes were made to the core layout file.</p><h3>Wrapping Up</h3><p>Styling Spree applications can be a breeze once one becomes&nbsp;acquainted&nbsp;with the environment. Aim on the side of caution when editing templates and use Deface wherever possible. Doing so will help you to build great experiences without hurting future releases.</p><p><em>Smashing Boxes is a web and mobile app development company know for creating a lasting experience through bold design and disrupting the status quo. We are entrepreneurs and craftsmen first, and a digital creative agency second. Inspired by our visionary clients, we transform ideas into innovative web and mobile applications. </em><a href=\"http://smashingboxes.com/work\">Take a look at our work.</a></p><p><em>Cover photo by&nbsp;</em><a href=\"https://www.flickr.com/photos/halfbisqued/\" style=\"background-color: initial;\"><em>Beck Gusler</em></a></p>",
  "Slug": "building-themes-for-spree-ecommerce",
  "slug_history": "--- []\n",
  "visits": 5591,
  "Published": "2012-03-29T04:00:00+00:00",
  "Authorname": "Nate Hunzaker ",
  "category_id": 1,
  "image_uid": "2014/07/29/18/14/44/726/file",
  "created_at": "2014-06-05T18:25:20+00:00",
  "updated_at": "2014-10-01T13:45:54+00:00",
  "markdown": null,
  "image_alt_text": null,
  "featured": false,
  "database_id": 315,
  "category": {
    "type": "Entry",
    "id": "category_1"
  }
}