{
  "id": "post_381",
  "Title": "How We Built An App For The Apple Watch",
  "Summary": "Durham technology lab, Smashing Boxes, built a surf app for the new Apple Watch, Android, and iOS. Here's what they learned from building an app for the watch. ",
  "Body": "<p>\r\n\tWe were huddled around&nbsp;<a href=\"http://www.apple.com/apple-events/june-2014/\">a large, projected image of Tim Cook</a>. In true Apple fashion, there was one more thing Tim wanted us all to know&hellip; They’re building a watch. It’s personal. It’s sleek. And we’ll all have to wait a year to get it.</p><p>\r\n\tWe could have listened. Waited a year to start building CRNT for the Watch. But that wouldn’t be in true Smashing Boxes fashion.</p><h5><strong>Here’s the back story. </strong></h5><p>\r\n\tI’m a lifelong surfer and designer.</p><p>\r\n\tMy biggest frustration when surfing is finding the current surf conditions at my favorite spots. I’d call up friends or scan multiple websites. When Smashing Boxes announced “Labs” - off-the-clock time dedicated to exploring creative side projects - I saw an opportunity to bring my idea to life.</p><p>\r\n\tWe started by building&nbsp;<a href=\"http://crntapp.com/\">CRNT (short for current) for iPhone and Android</a>. Then Apple did it’s thing: announcing another product that would change the way people experience life.</p><p>\r\n\t<img src=\"https://lh3.googleusercontent.com/cRQP992H615qxuKfhXcsQxqkLhGyfshI2vwt04QnCN_pWtgsf7KMhlCBPM6p2n9jO2hMo0myyf5ITBouAeEhk-peEajSV6E5AGyPGIpbSLPI1vScdew0mUoitZHtnQO958M3paI\" width=\"270px;\" height=\"360px;\" style=\"border-style: none; transform: rotate(0rad); -webkit-transform: rotate(0rad); width: 465px;\" alt=\"WWDC14.jpg\"></p><p>\r\n\tOur team watching the Apple Watch announcement during WWDC14.</p><p>\r\n\tI should probably take a moment here to tell you that CRNT won’t make us a dime. At least not this present rendition. This was an experiment. A design challenge, not a business one. Could we create software for a product that, at present, doesn’t exist?</p><h5><strong>We didn’t know, but we dove right in.</strong></h5><p>\r\n\tThe SDK wasn’t immediately released but images of the Watch had been spread across the internet. I did some quick mock-ups to see if I could pull off the design on such a small screen. It looked good.</p><p>\r\n\t<img src=\"https://lh3.googleusercontent.com/LURXCdT4BbAkFN1jyN1joLiNPy9MPVF0hXrMvylZoJolMR3empGkEChZG8VvVh2QEB7i-8z0elOTlPSPDxMXWsMUszgk6rPHx0P69K_TJU7hWawWFf9_qatkvPi6mt_bQUdL2fY\" width=\"575px;\" height=\"430px;\" style=\"border-style: none; transform: rotate(0rad); -webkit-transform: rotate(0rad);\"></p><p style=\"text-align: center;\">\r\n\t<em>My initial mock-up where I thought the screen would stretch to the edge of the watch face. In the beginning, everything was a guess. </em></p><p style=\"text-align: center;\">\r\n\t<em><br>\r\n\t</em></p><p>\r\n\tIt helped that we had started with a minimalist app for iPhone and Android. The simplicity of the previous design made translating it from phone to watch relatively easy. Of course, I’d be amiss to say it was all smooth sailing. The Watch posed new constraints.</p><p>\r\n\tThe primary challenge was designing for something that was largely unknown and untested. We didn’t have a physical object to test our ideas on. Viewing the designs on a monitor, we didn’t even know if our images were to scale. We had no idea if the functionality that was revealed at the conference would be the same functionality available once the SDK was released.</p><p>\r\n\tWe had to be creative and flexible.</p><p>\r\n\tWould there be glare on the screen in the sun? How would transitions appear? Would there be transitions at all? Was the sky the limit, or would we be severely constrained?</p><p>\r\n\tWe didn’t know. We had to dream up all the potential variables that could impact the end product. And I am certain there are several that we missed.</p><p>\r\n\tOnce the SDK was released and we had more information to work with, we took several of our ideas and designs back to the drawing board. We still haven’t tested our app on the Watch and there will be many iterations to come to make it perfect. Never-the-less, we’ve learned quite a bit.</p><p>\r\n\tHere’s how we tackled it.</p><h5><strong>Go simple.</strong></h5><p>\r\n\tThe Apple Watch enforces simplicity; it has to be simple to be effective. With the Watch, the user must be able to execute an action or pickup content in a few seconds or it's going to fail. That’s your sniff test.</p><p>\r\n\tI approached designing for CRNT as if I were drawing in the sand. When you strip down all of the details and break it into segments that are simple enough to communicate in sand, you’ve hopefully achieved something minimal, functional, and memorable for the user.</p><h5><strong>A team always beats going it alone.</strong></h5><p>\r\n\tIt’s important I mention that I didn’t do all of this alone. I had an amazing team of designers, developers, and marketers working alongside me to bring this app to life and then share it with the world. I also had the immense support of our founders, Brian Fischer and Nick Jordan.</p><p>\r\n\tEveryone who was part of this project volunteered their expertise and enthusiasm, and CRNT only exists due to their efforts. Do yourself a favor, and find a great team.</p><p>\r\n\t<img src=\"https://lh6.googleusercontent.com/99PVOZuyz1piE12E_zzgCrcPz5xYuiA90ndQyvYMTPk0zKL6OSdI5XBvZF_YyXf-OjTg3DA25RSfss5wiwHPoNlsoLz88t0oJNXCRmWE0Jb7zAgT2FF2VDZMAG2Pw8EnPMbJYiA\" width=\"624px;\" height=\"409px;\" style=\"border-style: none; transform: rotate(0rad); -webkit-transform: rotate(0rad); width: 1129px;\" alt=\"_DSC3781.jpg\"></p><p style=\"text-align: center;\">\r\n\t<em>From top left to bottom right - Austin Lanier (Android Developer), Margaret McNab (Dir. of Growth), Raleigh Felton (Dir. of Design), Lucas Brauer (UX Designer), Bret Kruse (Developer &amp; Interactive Designer), David Melgar (iOS Developer), David Sweetman (iOS Developer), Alicia Midland&nbsp;(Growth Engineer), Laura Smith (Community Manager). Not pictured but also played a huge part: Helen Vasconcelos (Back-End &amp; iOS Developer), Andrew Folwer (QA Specialist),&nbsp;Jordan Clifton (iOS Developer).&nbsp;</em></p><p style=\"text-align: center;\"></p><h5><strong>It’s not a reduction game.</strong></h5><p>\r\n\tIt would have been easy to scrunch the design down into an inch by inch square, but it wouldn’t have worked. The Watch demands the removal of complementary content so smart user experience design was crucial.</p><p>\r\n\tEven though we were translating a simple and uncluttered app from phone to watch, we had to further refine our goals and focus on what mattered most. I can’t understate how crucial this is. With the watch you are not building an app, you are creating an action.</p><h5><strong>Cut visual affordances. </strong></h5><p>\r\n\tIt's not only about designing something cool; it's also about designing something useful. You don’t need to style buttons. With the Watch, information is the interface.</p><h5><strong>Consider potential constraints. </strong></h5><p>\r\n\tThis will be much easier for those building for the Watch after it’s released, but regardless, it will still help you to consider the variables and constraints of this platform.</p><p>\r\n\tFor instance, the Watch may not always used in a stationary or indoor environment so contrast might need to be a consideration. Elements (such as text) must be large, clear, and readable with enough contrast for the user to ‘get it’ without having to work for it.</p><p>\r\n\t<img src=\"/media/W1siZiIsIjIwMTUvMDQvMjIvMTEvNDIvNDUvNjE0LzU1MmJkY2MyNzI5ZjBjYWUwOGFmN2I4N18xNDI4OTM3OTIyNjgxLmpwZyJdXQ/552bdcc2729f0cae08af7b87-1428937922681.jpg?sha=9ead1914\"></p><p style=\"text-align: center;\">\r\n\t<em>The phone application has white text and icons on a sky blue screen. For the Watch, we chose a black background with light blue lettering to create greater contrast.</em></p><p style=\"text-align: center;\">\r\n\t<strong><br>\r\n\t</strong></p><h5><strong>There’s a lot we still don’t know. </strong></h5><p>\r\n\tBuilding for the Watch before the Watch was released was a process riddled with guessing and questioning. We don’t know what this is yet or how users will react - both to the Watch and to CRNT.</p><p>\r\n\tUltimately, just as Apple will have much to learn from the initial release of the Watch, app creators like us will also face multiple iterations to get it right. Playing with our app on the Watch after release is likely to be a humbling experience. We’ve created a buzzworthy app for a product we’ve never touched.  So far, CRNT has been featured in <a href=\"http://mashable.com/2015/03/09/apple-watch-apps-2/\">Mashable</a>, <a href=\"http://www.wareable.com/apple-watch/best-apple-watch-apps-832\">Wearable</a>, and <a href=\"http://www.creativebloq.com/app-design/how-apple-watch-will-change-apps-forever-31514563\">Creative Bloq</a>.</p><p>\r\n\tYet amidst all of the unknowns, one thing is certain: the Watch is about simplicity. To be successful, you have to focus, refine, and prioritize what really matters.</p><p><em>\r\n\tDownload CRNT on Android, iOS, and the Apple Watch by the end of the month.&nbsp;</em></p><p>*This article was originally published in&nbsp;<a href=\"http://www.exitevent.com/article/how-smashing-boxes-built-an-app-for-the-apple-watch-150413\">ExitEvent</a>.&nbsp;</p>",
  "Slug": "how-we-built-an-app-for-the-apple-watch",
  "slug_history": "--- []\n",
  "visits": 1584,
  "Published": "2015-04-22T08:00:00+00:00",
  "Authorname": "",
  "category_id": 4,
  "image_uid": "2015/04/22/12/51/25/194/file",
  "created_at": "2015-04-22T15:45:30+00:00",
  "updated_at": "2015-04-29T21:44:08+00:00",
  "markdown": "",
  "image_alt_text": "",
  "featured": true,
  "database_id": 381,
  "category": {
    "type": "Entry",
    "id": "category_4"
  },
  "tags": [
    {
      "type": "tag",
      "id": "tag_8"
    },
    {
      "type": "tag",
      "id": "tag_25"
    },
    {
      "type": "tag",
      "id": "tag_31"
    }
  ]
}