{
  "id": "post_337",
  "Title": "From Silicon Valley to Research Triangle Park: The Race for mHealth Domination",
  "Summary": "It’s no surprise that both Apple and Google want a piece of the $5.1 billion dollar industry that is mobile health. Wearable products like Fitbit have piqued consumer interest in tracking health stats like daily exercise, diet, and sleep patterns. However, with a 50% six month attrition rate, the mHealth community has wondered how to continue to engage people on digital platforms while contemplating the ways the collected data can be used in a meaningful way by health professionals.",
  "Body": "<p>\r\n\tIt’s no surprise that both Apple and Google want a piece of the <a href=\"http://www.ihealthbeat.org/articles/2014/7/2/report-mobile-health-device-market-to-reach-42b-by-2023\" target=\"_blank\">$5.1 billion dollar industry</a> that is mobile health. Wearable products like Fitbit have peaked consumer interest in tracking health stats like daily exercise, diet, and sleep patterns. However, with a <a href=\"http://endeavourpartners.net/assets/Wearables-and-the-Science-of-Human-Behavior-Change-EP4.pdf\" target=\"_blank\">50% six month attrition rate</a>, the mHealth community has wondered how to continue to engage people on digital platforms while contemplating the ways the collected data can be used in a meaningful way by health professionals.</p><h3>An Apple a Day...</h3><p dir=\"ltr\">\r\n\t<a href=\"http://sbblog.s3.amazonaws.com/wp-content/uploads/2014/07/healthkit-hero.png\"><img class=\"alignleft size-full wp-image-5497\" alt=\"healthkit-hero\" src=\"http://sbblog.s3.amazonaws.com/wp-content/uploads/2014/07/healthkit-hero.png\" width=\"128\" height=\"128\"></a>Apple announced its new app,&nbsp;<a href=\"https://www.apple.com/ios/ios8/health/\" target=\"_blank\">Health</a>,&nbsp;on June 2, 2014. The company was smart to partner with <a href=\"http://www.epic.com/\" target=\"_blank\">Epic Systems</a> and the <a href=\"http://www.mayoclinic.org/\" target=\"_blank\">Mayo Clinic </a>from the start to enhance the credibility of the application. The concept of Health is to aggregate data from different digital sensors such as fitness monitors as well as glucometers. It also adds an emergency medical information card with vital information including the wearer's allergies and current medical conditions.</p><p dir=\"ltr\">\r\n\tGoogle <a href=\"http://mobihealthnews.com/34430/google-unveils-google-fit-a-fitness-platform-for-developers/\" target=\"_blank\">introduced the Fit app&nbsp;</a>as a response to Health on June 25, 2014. Fit is a platform that helps a variety of fitness trackers play nice with Android phones. The basic functionality of both Health and Fit appears similar but what we don’t see from Google is the long-game that Apple is playing by looping in doctors and EMRs (electronic medical records) so the information can be used to better guide patient care.pea</p><p dir=\"ltr\">\r\n\t<a href=\"http://sbblog.s3.amazonaws.com/wp-content/uploads/2014/07/fit_icon_512x512.png\"><img class=\"alignright wp-image-5498\" alt=\"fit_icon_512x512\" src=\"http://sbblog.s3.amazonaws.com/wp-content/uploads/2014/07/fit_icon_512x512.png\" width=\"166\" height=\"166\"></a>Is there a permanent divide between the two tech giants? Regardless of the current competition, there could be a future merge of Apple with Google via the use of Google Glass. Physicians are increasingly experimenting with Glass in the operating room, to <a href=\"http://time.com/2869953/google-glass-doctors/\" target=\"_blank\">access health records</a>,&nbsp;and&nbsp;to <a href=\"http://www.newswise.com/articles/ucla-doctors-use-google-glass-to-teach-surgery-abroad\" target=\"_blank\">teach medical students and doctors</a> around the world how to perform surgeries. The field of Glass apps is wide open, and as Epic and other EMRs become ubiquitous in hospitals, there is a major opportunity for developers to access APIs for <a href=\"https://developer.apple.com/healthkit/\" target=\"_blank\">HealthKit</a> and <a href=\"https://developers.google.com/fit/\" target=\"_blank\">Developer.Fit</a> to try new solutions and bring the most useful parts of each technology together.</p><p dir=\"ltr\">\r\n\tThe jury is out on whether Apple or Google will dominate personal health data management. Yet there is no doubt that the variety and quality of data collected by sensors like wearables will improve in the near future and shape the ability of physicians to personalize health plans for patients.</p><h3 dir=\"ltr\">Influence in the Triangle Region</h3><p dir=\"ltr\">\r\n\tDespite the success of these two digital powerhouses, health technology and wearable device research transcends Silicon Valley. So far this year, <a href=\"http://venturebeat.com/2014/06/30/2-2b-in-digital-health-funding-during-2014-already-exceeds-2013-total/\">$2.2 billion in funding</a> has been invested in digital health startups. Several of those startups are located in smaller cities, including an area with a tradition of tech innovation: the Triangle of North Carolina. At Smashing Boxes, we’ve seen interest from non-profits to experiment with Google Glass applications and startups challenging antiquated patient-provider interactions. Moreover, centers like the <a href=\"http://www.dihi.org\">Duke Institute for Health Innovation</a> are disrupting silos and activating partnerships between doctors and nurses as well as business and software.</p><p dir=\"ltr\">\r\n\tTo involve health influencers and entrepreneurs in our area, the Triangle Health Startup Weekend is hosted by local organizations annually, with this year’s taking place August 8-10. &nbsp;We hope to see our neighbors bring forth innovative approaches towards presenting individually monitored health data to physicians in a useful way, as well as considering what could be possible beyond Apple Health and Google Fit.&nbsp;<a href=\"http://sbblog.s3.amazonaws.com/wp-content/uploads/2014/02/Empowering-Patients-Through-mHealth.pdf\">Download our white paper</a> to learn more about empowering patients through mHealth.&nbsp;</p><p dir=\"ltr\"></p><p><em>Smashing Boxes is a web and mobile app development company known for creating a lasting experience through bold design and disrupting the status quo. We are entrepreneurs and craftsmen first, and a digital creative agency second. Inspired by our visionary clients, we transform ideas into innovative web and mobile applications. </em><a href=\"http://smashingboxes.com/work\">Take a look at our work.</a></p>",
  "Slug": "silicon-valley-rtp-mhealth-domination",
  "slug_history": "---\n- siliconvalleyrtpmhealthdomination\n- the-race-for-mhealth-domination-from-silicon-valley-to-the-triangle\n",
  "visits": 1429,
  "Published": "2014-07-30T17:39:06+00:00",
  "Authorname": "Katie McMillan",
  "category_id": 4,
  "image_uid": "2014/08/01/13/22/17/528/file",
  "created_at": "2014-07-30T17:39:06+00:00",
  "updated_at": "2014-08-19T15:07:52+00:00",
  "markdown": null,
  "image_alt_text": null,
  "featured": false,
  "database_id": 337,
  "category": {
    "type": "Entry",
    "id": "category_4"
  }
}