{
  "id": "post_274",
  "Title": "Quick & Dirty: ViewDeck",
  "Summary": "I often use libraries to make life easier. One library I want to endorse is ViewDeck. ViewDeck is an implementation that allows controllers to have a sliding effect, providing the same functionality seen in Path and Facebook apps. By using a natural swiping gesture, controllers can slide into view…",
  "Body": "<p>I often use libraries to make life easier. One library I want to endorse is \r\n\t<a title=\"ViewDeck\" href=\"https://github.com/Inferis/ViewDeck\" target=\"_blank\">ViewDeck</a>. ViewDeck is an implementation that allows controllers to have a sliding effect, providing the same functionality seen in Path and Facebook apps. By using a natural swiping gesture, controllers can slide into view from both the left and right sides of the screen.</p><p>\r\n\tWithin about 30 minutes, I was able to properly set-up the ViewDeck library for a client project. Not only was setting-up the library quick and easy, but it looked great out of the box. What really amazed me was the customization ViewDeck allows. Depending on the iOS device running the app, you can adjust how far on-screen the controllers can be swiped. On an iPhone you’re able to better utilize its lower resolution to focus on the controller being swiped into view (Fig. 1).</p><p id=\"attachment_3437\" style=\"width: 266px\" class=\"wp-caption aligncenter\">\r\n\t<img class=\" wp-image-3437 \" alt=\"Figure 1. iPhone Screenshot\" src=\"http://sbblog.s3.amazonaws.com/wp-content/uploads/2013/05/iOS-Simulator-Screen-shot-May-9-2013-4.08.02-PM.png\" width=\"256\" height=\"384\"></p><p class=\"wp-caption-text\" style=\"text-align: center;\">\r\n\t<em>Figure 1. iPhone Screenshot</em></p><p>\r\n\tWhile on the iPad, you’re able to take advantage of its higher screen resolution to display both controllers (Fig. 2).</p><p id=\"attachment_3433\" style=\"width: 416px\" class=\"wp-caption aligncenter\">\r\n\t<img class=\" wp-image-3433 \" alt=\"Figure 2. iPad Screenshot\" src=\"http://sbblog.s3.amazonaws.com/wp-content/uploads/2013/05/iOS-Simulator-Screen-shot-May-9-2013-3.42.14-PM.png\" width=\"406\" height=\"540\"></p><p class=\"wp-caption-text\" style=\"text-align: center;\">\r\n\t<em>Figure 2. iPad Screenshot</em></p><p>\r\n\tBy changing the controller’s size through ViewDeck, you don’t have to worry about resizing the frame, it’s all handled for you (especially if you use resizers on your objects).</p><p>\r\n\tHere’s the code required:</p><p>\r\n\t<img class=\"size-full wp-image-3642 alignnone\" alt=\"Screenshot of ViewDeck Implementation \" src=\"http://sbblog.s3.amazonaws.com/wp-content/uploads/2013/05/Screen-Shot-2013-05-10-at-2.12.06-PM.png\" width=\"551\" height=\"122\"></p><p>\r\n\tViewDeck also allows you to change the left and right controllers during run-time. For our example project, the run-time functionality restricts the ability to access the left or right controllers under certain conditions. For example, only granting access to the right controller on a subset of screens, but allowing the left controller to be present on every screen. The example app also features a screen dedicated to presentation mode, providing the user access to a full screen view of their document. During the full screen view, the left and right controllers are disabled so the user can interact with the document naturally. Once the user exits presentation mode, the application restores access to the left/right controllers.</p><p>\r\n\tAnother way to use ViewDeck is to customize where a swipe can occur to summon the left/right controllers. On one screen, I’m using a scrollView that would normally be overridden by the gesture recognition ViewDeck uses. By using the panning property, we can apply the ViewDeck swipe gestures to specific Views and leave the rest of the screen to navigate normally. In addition to ViewDeck’s default left/right controllers, the panning property allows a vertically/horizontally scrolling scrollView.</p><p>\r\n\tFeel free to leave a comment if you have any questions or want to mention a favorite iOS library that you use!</p>",
  "Slug": "messing-with-viewdeck",
  "slug_history": "--- []\n",
  "visits": 613,
  "Published": "2013-05-15T08:00:00+00:00",
  "Authorname": "Eric Harmon",
  "category_id": 4,
  "image_uid": "2014/07/21/13/33/25/48/file",
  "created_at": "2014-06-05T18:23:27+00:00",
  "updated_at": "2015-06-15T19:21:19+00:00",
  "markdown": "",
  "image_alt_text": "",
  "featured": false,
  "database_id": 274,
  "category": {
    "type": "Entry",
    "id": "category_4"
  },
  "tags": [
    {
      "type": "tag",
      "id": "tag_3"
    }
  ]
}