{
  "id": "post_226",
  "Title": "FDA Regulations on mHealth",
  "Summary": "Developers (and investors) have been long awaiting regulations to be put in place by the Food and Drug Administration (FDA) regarding mobile health (mHealth) applications and after over two years since the guidance was drafted, the FDA finally published final guidance for classifying mobile medical apps in September. Luckily for app developers, most mHealth applications…",
  "Body": "<p>\r\n\tDevelopers (and \r\n\t<a href=\"http://venturebeat.com/2013/09/23/fda-removes-roadblocks-to-medical-app-innovation/\">investors</a>) have been long awaiting regulations to be put in place by the <a href=\"http://www.fda.gov/\">Food and Drug Administration</a> (FDA) regarding mobile health (mHealth) applications and after over two years since the guidance was drafted, the FDA finally published final <a href=\"http://www.fda.gov/downloads/MedicalDevices/DeviceRegulationandGuidance/GuidanceDocuments/UCM263366.pdf\">guidance for classifying mobile medical apps</a> in September. Luckily for app developers, most mHealth applications will bypass the approval process, but these regulations should be kept in mind when developing mHealth apps in the future.</p><h5>\r\n<strong>What type of apps will the FDA regulate?</strong>\r\n</h5><p>\r\n\tThe FDA plans to concentrate its regulations on mHealth apps that have the potential to be health risks to consumers and classify these as “mobile medical apps” (MMAs) in their guidance document. The applications that will be controlled are those that are classified as devices in the Federal Food, Drug, and Cosmetic Act and are designed to: 1) convert mobile devices into medical devices that fall under FDA regulations or 2) be used as additional components to medical devices which fall under FDA regulations. The FDA states that only apps and devices that may risk a patient’s safety when nonfunctional are considered MMAs.</p><h5>\r\n<strong>What are some examples of apps that will be regulated?</strong>\r\n</h5><p>\r\n\tApps that use built-in features of phones or make use of additional sensors/attachments to perform medical tasks that are typically performed by health care practitioners to treat and diagnose diseases will be regulated. These include apps that measure heart activity, amplify heart sounds, and measure blood glucose levels. Additionally, apps that are used to control implantable or worn medical devices such as to change the setting of infusion pumps, act as wireless remote controls for imaging machines, and to calibrate cochlear implants fall under the regulations. Visit the guidance document linked above for a more complete list of examples.</p><h5>\r\n<strong>What if my app is already on the market?</strong>\r\n</h5><p>\r\n\tSince most existing health apps do not fall under the FDA’s regulation guidelines, it is likely that if your app is already in app stores, you do not have to do anything and your app can remain on the market without extra review. The FDA has already approved approximately 100 mobile medical apps, which include ~40 apps in the past 2 years (\r\n\t<a href=\"http://www.fda.gov/MedicalDevices/ProductsandMedicalProcedures/ConnectedHealth/MobileMedicalApplications/ucm368784.htm\">examples of approved MMAs</a>). Therefore, even before final guidance was released, it is likely you knew that your app may be considered a <a href=\"http://www.fda.gov/MedicalDevices/DeviceRegulationandGuidance/Overview/ClassifyYourDevice/\">Class II</a> medical device and you submitted a 510(k) premarket notification to the FDA.</p><h5>\r\n<strong>What do I need to submit before marketing my app?</strong>\r\n</h5><p>\r\n\tLuckily, not all mobile medical apps must obtain \r\n\t<a href=\"http://www.fda.gov/MedicalDevices/DeviceRegulationandGuidance/HowtoMarketYourDevice/PremarketSubmissions/PremarketApprovalPMA/default.htm\">Premarket Approval</a> (PMA) or submit a <a href=\"http://www.fda.gov/MedicalDevices/DeviceRegulationandGuidance/HowtoMarketYourDevice/PremarketSubmissions/PremarketNotification510k/default.htm\">510(k) Premarket Notification</a> and submit their associated fees (<a href=\"http://www.fda.gov/MedicalDevices/DeviceRegulationandGuidance/HowtoMarketYourDevice/PremarketSubmissions/PremarketApprovalPMA/ucm048161.htm\">PMA fees</a> and <a href=\"http://www.fda.gov/MedicalDevices/DeviceRegulationandGuidance/HowtoMarketYourDevice/PremarketSubmissions/PremarketNotification510k/ucm134566.htm\">510(k) fees</a>) before they can be marketed. The degree of regulation and approval depends on the classification of your app. Most Class I devices are exempt and just have to comply with “<a href=\"http://www.fda.gov/MedicalDevices/DeviceRegulationandGuidance/Overview/GeneralandSpecialControls/ucm055910.htm\">General Controls</a>.” To determine the FDA classification for<br>\r\nyour app, the FDA suggests that you search the “\r\n\t<a href=\"http://www.accessdata.fda.gov/scripts/cdrh/cfdocs/cfPCD/classification.cfm\">Product Classification</a>” and “<a href=\"http://www.accessdata.fda.gov/scripts/cdrh/cfdocs/cfPMN/pmn.cfm\">510(k) Premarket Notification</a>” databases to find comparable apps and observe their associated regulations.</p><p>\r\n\tThe FDA wants to facilitate innovation and hopes that mHealth apps will enable better care and patient empowerment, but this guidance was necessary to ensure that the apps are safe. If you have any questions related to mobile medical apps, \r\n\t<a href=\"mailto:mobilemedicalapps@fda.hhs.gov\">send an email to the FDA</a>. If you have any questions or opinions to share with us about the MMA guidance, leave a comment below.</p><p>\r\n\tWe hope that the guidelines promote the development of more mHealth apps, startups, and investments. To read more about an area that could severely benefit from the help of mHealth applications,&nbsp;<a href=\"http://sbblog.s3.amazonaws.com/wp-content/uploads/2014/02/Empowering-Patients-Through-mHealth.pdf\">download our white&nbsp;paper</a>.</p><p><em>Smashing Boxes is a web and mobile app development company known for creating a lasting experience through bold design and disrupting the status quo. We are entrepreneurs and craftsmen first, and a digital creative agency second. Inspired by our visionary clients, we transform ideas into innovative web and mobile applications. </em><a href=\"http://smashingboxes.com/work\">Take a look at our work.</a></p>",
  "Slug": "fda-regulations-on-mhealth",
  "slug_history": "--- []\n",
  "visits": 1645,
  "Published": "2014-02-19T05:00:00+00:00",
  "Authorname": "Alicia Midland",
  "category_id": 4,
  "image_uid": "2014/07/21/15/47/10/915/file",
  "created_at": "2014-06-05T18:21:12+00:00",
  "updated_at": "2014-08-11T15:40:27+00:00",
  "markdown": null,
  "image_alt_text": null,
  "featured": false,
  "database_id": 226,
  "category": {
    "type": "Entry",
    "id": "category_4"
  }
}