{
  "id": "post_224",
  "Title": "What Makes a Mobile Health (mHealth) App Effective?",
  "Summary": "Since the advent of the smartphone, the mobile health (mHealth) market has been growing steadily into a billion dollar industry and is projected to be $26B by 2017. This means that although there are currently around 17,000 mobile health apps on the market, the door of opportunity for new apps is still wide open to…",
  "Body": "<p>\r\n\tSince the advent of the smartphone, the mobile health (mHealth) market has been growing steadily into a billion dollar industry and is projected to be \r\n\t<a href=\"http://www.informationweek.com/mobile/mobile-health-market-to-reach-%2426b-by-2017/d/d-id/1110964?\">$26B by 2017</a>. This means that although there are currently around <a href=\"http://www.smartphonehc.com/2013/10/01/17k-mobile-health-wellness-and-fitness-apps/\">17,000 mobile health apps</a> on the market, the door of opportunity for new apps is still wide open to create new solutions for improving health and wellness. So, once you come up with an mHealth app idea, how do you differentiate your app and ensure that health care professionals and/or consumers will actually use yours when the landscape is so crowded?</p><h5><strong>Does your app solve a legitimate health problem?</strong></h5><p>\r\nThe most important driver for an mHealth app should be that it solves a valid pain point in healthcare. There are many areas of health that still need solutions and mHealth has the potential to solve many existing and emerging issues help people save on healthcare expenditures.</p><h5><strong>Is your app easy to use?</strong></h5><p>\r\nDoctors and consumers are busy with their jobs and everyday lives, so they are unlikely to use anything that requires too much extra effort. When designing an app, you want to maximize the value it provides for everyone who is using it, whether the app is saving time for doctors who are interacting with patients through a messaging platform or facilitating access to health information for patients on the go.</p><h5><strong>Does a solution already exist? If so, what makes your solution better?</strong></h5><p>\r\nThe mHealth market is competitive, so it is important to do research ahead of time to ensure that your time isn’t being wasted developing something that is already on the market and has a large following. Differentiate yourself by talking to health care professionals and consumers before and while building your app so that you know you are building something that serves a purpose.</p><h5><strong>Does your app empower patients?</strong></h5><p>\r\nPatient empowerment is key to changing and improving long-term patient behavior, especially for medication adherence and other preventative health measures. If your app enables people to take control of their health outcomes and facilitates healthy behavior, healthcare professionals are more likely to see the benefits of the app and prescribe it to their patients.</p><h5><strong>Will your app require FDA approval?</strong></h5><p>\r\nRecently, the FDA published guidelines outlining the types of apps that they will be regulating. When developing your app, ensure that you know if your app will be considered a medical device or medical device accessory and will be regulated by the FDA. Take a look at our post detailing the recent \r\n\t<a href=\"http://www.smashingboxes.com/fda-regulations-on-mhealth/\">FDA regulations around mHealth applications</a> and if your app will be impacted.</p><p>\r\n\tNow that you know what aspects make an mHealth app effective, think about what areas of health where mHealth apps would improve health outcomes.&nbsp;One of the areas where mHealth could make a big impact is medication non-adherence. To read more about this problem and how mHealth can help,&nbsp;<a href=\"http://sbblog.s3.amazonaws.com/wp-content/uploads/2014/02/Empowering-Patients-Through-mHealth.pdf\">download our white&nbsp;paper</a>.</p><p><em>Smashing Boxes is a web and mobile app development company known for creating a lasting experience through bold design and disrupting the status quo. We are entrepreneurs and craftsmen first, and a digital creative agency second. Inspired by our visionary clients, we transform ideas into innovative web and mobile applications. </em><a href=\"http://smashingboxes.com/work\">Take a look at our work.</a></p>",
  "Slug": "what-makes-a-mobile-health-mhealth-app-effective",
  "slug_history": "--- []\n",
  "visits": 1366,
  "Published": "2014-03-06T05:00:00+00:00",
  "Authorname": "Alicia Midland",
  "category_id": 4,
  "image_uid": "2014/07/21/13/00/23/993/file",
  "created_at": "2014-06-05T18:21:08+00:00",
  "updated_at": "2014-08-11T15:40:15+00:00",
  "markdown": null,
  "image_alt_text": null,
  "featured": false,
  "database_id": 224,
  "category": {
    "type": "Entry",
    "id": "category_4"
  }
}