{
  "id": "post_386",
  "Title": "Smashing Boxes Apprenticeship ",
  "Summary": "In this 12-week program, you’ll be paid to hone your skills as a professional Ruby on Rails developer, learning advanced programming concepts through the practical application of the Ruby language. \r\nUpon completion and with your newly honed skills in hand, you will be hired by Smashing Boxes as a Junior Developer. You’ll get a fat raise, begin working on client projects, and tackle the problems of the world - one line of code at a time. ",
  "Body": "",
  "Slug": "smashing-boxes-apprenticeship",
  "slug_history": "--- []\n",
  "visits": 926,
  "Published": "2015-07-20T20:00:00+00:00",
  "Authorname": "Jordan Hammond",
  "category_id": 1,
  "image_uid": "2015/07/20/13/02/36/884/file",
  "created_at": "2015-07-20T15:52:50+00:00",
  "updated_at": "2015-07-27T16:04:54+00:00",
  "markdown": "###Program Overview\r\n\r\nYou’ve worked hard to learn to code. You can build an app and automate away the minor annoyances of life, but this trade takes practice and precision. There’s a disparity between learning to code and understanding the nuances of programming as a professional. Our apprenticeship program is designed to bridge that gap. \r\n\r\nIn this 12-week program, you’ll be paid to hone your skills as a professional Ruby on Rails developer, learning advanced programming concepts through the practical application of the Ruby language. You'll start with practice and demonstration apps but before long you'll be building APIs, managing company tools, and assisting with production client work. \r\n\r\nUpon completion and with your newly honed skills in hand, you will be hired by Smashing Boxes as a Junior Developer. You’ll get a fat raise, begin working on client projects, and tackle the problems of the world - one line of code at a time. \r\n\r\n###Mentorship\r\n\r\nMentorship is at the core of our apprenticeship program. The differentiator between the apprentice experience and that of jumping straight into a professional development role is that apprentices will learn and work one-on-one with experienced developers. The professional development and success of the apprentice is the mentor's primary goal. Through this program, the mentor will also gain tremendous knowledge and experience. Our hope is that many of our apprentices will grow into mentors themselves for future generations.\r\n\r\n###What Is It Like To Work at SB?\r\n\r\nOne of our programmers, Zach Kuhn, says it best in [this article](https://medium.com/@zacharykuhn/my-first-two-weeks-at-smashing-boxes-549559e6c4d) recapping his first two weeks at Smashing Boxes.\r\n\r\n###Timeline\r\n\r\n*July 27 from 5-6:30pm - Info Session at Smashing Boxes \r\n\r\n*July 30 - Submissions due by 5pm (see how to apply below)\r\n\r\n* August 3- 4 - Interviews take place at Smashing Boxes\r\n\r\n* August 5-7 - Offers awarded \r\n\r\n* August 11 - Apprenticeship program begins\r\n\r\n###Requirements\r\n\r\n* Graduation from a full-time, accredited code school (or) a Bachelor's Degree in Computer Science (or) equivalent professional programming experience is required for admission into our apprenticeship program. \r\n\r\n* Applicants are asked to submit their resume or LinkedIn profile and a link to their GitHub account, personal blog, or portfolio.\r\n\r\n* Qualified applicants will be invited to our office for an interview with our development team. \r\n\r\n###How To Apply\r\n\r\nPlease send the above to [careers@smashingboxes.com](mailto: careers@smashingboxes.com) with the subject line: SB Apprenticeship \r\n\r\n\r\n",
  "image_alt_text": "smashing boxes employees ",
  "featured": false,
  "database_id": 386,
  "category": {
    "type": "Entry",
    "id": "category_1"
  },
  "tags": [
    {
      "type": "tag",
      "id": "tag_2"
    },
    {
      "type": "tag",
      "id": "tag_16"
    },
    {
      "type": "tag",
      "id": "tag_39"
    }
  ]
}