{
  "id": "job_38",
  "title": "Director of Project Management",
  "description": "<p>Smashing Boxes project managers aren’t merely taskers or go-betweens. They’re the leaders of our projects from inception to completion. They scope and plan projects, lead teams and clients through our process and workflow, and ensure that work is delivered on time, on budget and is of the highest quality. The Director of Project Management is responsible for training, guiding and growing our PMs.</p>",
  "responsibilities": "<p>Director Responsibilities Include:</p><ul><li>Keeping the recruitment pipeline fresh with potential PM candidates in the event we need to hire quickly.</li><li>Managing PM project assignments, monitoring utilization and leading hiring efforts as needed.</li><li>Training new Project Managers as they join the team.</li><li>Championing and mastering existing and new workflow tools within the organization; training other Project Managers and teams for consistentuse.</li><li>Mentoring and providing ongoing positive and corrective feedback on performance of Project Managers; providing day-to-day coaching and regular development conversations.</li><li>Leading PM Ops meetings to ensure projects are running on-time and within budget; providing reports to management as needed.</li><li>Developing professional development and training plans to grow the skill-level of the PM team.</li></ul><p>Project Management Responsibilities Include:</p><ul><li>Working with sales and other team members to help define requirements and plan, scope and estimate projects.</li><li>Participating in project kick-off meetings to set expectations and the process and pace for our projects.</li><li>Working with Product Directors to assign and prioritize tasks to the appropriate team members.</li><li>Ensuring your projects are always moving forward and everyone is clear on next steps.</li><li>Alerting the appropriate SB staff at the first sign of any potential risk or barrier that may prevent work from being completed.</li><li>Providing detailed weekly project status updates to your clients.</li><li>Creating project documentation as needed and/or ensuring all documentation is saved on our central server.</li><li>Providing quality control before sending any work to the client.</li><li>Managing sprint planning meetings with your team and client.</li><li>Tracking weekly budget expenditure and approving invoices before sending to clients.</li><li>Coordinating any internal and client meetings as needed.</li><li>Working with operations to properly resource projects to meet timeline goals.</li><li>Contributing to company processes and proactively identifying areas for improvement.</li></ul>",
  "lookingFor": "<ul><li>8+ years prior product management or project management experience within a digital agency or digital product environment. </li><li>Experience running projects within both agile and waterfall environments. </li><li>Leadership with integrity and direct attitude.</li><li>Exceptional written and verbal communication skills.</li><li>Extreme attention to detail.</li><li>Outstanding judgment, especially in high-pressure situations.</li><li>Comfort in a fast-paced environment.</li><li>Ability to anticipate problems and risks in advance, and change plans accordingly.</li><li>Ability to multi-task – you’d actually prefer to be involved in multiple projects at once.</li><li>Entrepreneurial spirit, salesmanship skills and presentation chops.</li><li>Strong knowledge of technical applications, programs and standards</li><li>Basic HTML/CSS knowledge. You can talk the talk even if you can’t</li><li>code.</li><li>Passion for new technologies.</li><li>Experience with Google Apps (Basecamp and Harvest are additional bonuses).</li></ul>",
  "active": false,
  "created_at": "2015-05-28T19:30:49+00:00",
  "updated_at": "2015-09-15T19:05:14+00:00",
  "submitClass": "director-of-project-management",
  "importance": -6235689,
  "database_id": 38
}