{
  "id": "job_37",
  "title": "Product Director",
  "description": "<p>As a Smashing Boxes Product Director, you ensure our clients and projects are always moving in a positive, successful direction. Within our walls you are your clients, meaning: you represent their vision and best interests to our teams and all of SB. However, this doesn’t mean you do whatever clients ask of you. You have the responsibility of asking them the hard questions that challenge their thinking. And you aren’t afraid to tell them when something they want might be a bad idea for their product. However, you do this with good reason, grace and alternative solutions because you never leave them feeling like you don’t have their back.</p><p>You are also accountable to your teams. Partnering with project managers, your new best friend at SB, you are responsible for ensuring teams get what they need from clients in a timely manner to deliver the best work possible. You also ensure the right team members are pulled in at the right time to ensure we deliver on our integrated, interdisciplinary approach to projects. And just as you have the client’s back, you also have your team’s back. You walk a fine line between the two, but you manage this split-personality requirement with ease.</p><p>On a daily basis, you are constantly on the lookout for ways to provide new value to your accounts. So much value that our clients eventually feel they can't manage without you as a part of your team. At the end of each engagement, clients often come back to work with us again not just because we deliver amazing products, but because they want you to still be thinking about their business more so than their own team members. You represent and deliver quality, thoroughness, depth of knowledge and intelligent efficiency. </p>",
  "responsibilities": "<ul> <li>Fielding and qualifying incoming leads and referrals, owning initial meetings with qualified prospects, creating project proposals and estimates and managing negotiations through to the signing of MSA and SOW agreements</li><li>Running internal and client project kick-off meetings to ensure our clients and project teams are aligned on the project direction, expectations and delivery process</li><li>Owning the Discovery phases of projects to define product vision, roadmap, goals and KPIs, requirements, unique value proposition, personas, user stories, initial sprint plan, etc.</li><li>Overseeing your assigned projects to ensure the work remains on strategy, on budget and of the highest quality and partnering with Project Managers to help solve day-to-day account issues as needed</li><li>Working closely with project managers, UX, UI, and developers to advise on project direction, deliverables and overall approach to meet our clients goals</li><li>Nurturing your client relationships to uncover new opportunities to grow their business or obtain referrals </li><li>Maintaining awareness about trends and current events relevant to our client’s business, industry, competitors, etc., that could aid in our work together</li><li>Utilizing the proper frameworks, tools and approaches to facilitating strategic and creative work sessions with clients and teams to help solve problems and define and prioritize product features and functionality</li><li>Co-author case studies or related blog posts for your assigned projects</li><li>Contributing to thought leadership activities and company blog</li></ul>",
  "lookingFor": "<ul>\r\n<li>Minimum of 6 years of product management experience or project / account management experience with a digital or product design agency or software development</li><li>Product management experience with software development firms</li><li>Experience managing projects in both waterfall and agile environments</li><li>Creative and analytical thinker with strong problem solving capabilities</li><li>Experienced in applying the principles of usability and user centered design as a foundation for great work</li><li>Strong leadership and organizational skills</li><li>Strong presentation and communication skills (written / verbal)</li><li>Strong negotiation skills and experience</li><li>Thorough understanding of web and mobile technologies</li><li>Strong familiarity with digital marketing, content marketing, SEO, and social media strategy and tactics</li></ul>",
  "active": false,
  "created_at": "2015-04-27T17:52:07+00:00",
  "updated_at": "2015-07-16T20:17:23+00:00",
  "submitClass": "",
  "importance": -131073,
  "database_id": 37
}